///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	НастройкиОтчета.Описание = НСтр("ru = 'Список и сводная статистика по задачам.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ТекущиеЗадачи");
	НастройкиВарианта.Описание = НСтр("ru = 'Список всех задач в работе к заданному сроку.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СправкаПоИсполнительскойДисциплине");
	НастройкиВарианта.Описание = НСтр("ru = 'Сводка по количеству выполненных в срок и просроченных задачах у исполнителей.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ВыполненныеЗадачиПоДатеВыполнения");
	НастройкиВарианта.Описание = НСтр("ru = 'Выполненные задачи (в разрезе даты выполнения).'");
	
КонецПроцедуры

// Определяет состав программного интерфейса для вызова из кода конфигурации.
//
// Параметры:
//   Настройки - Структура - см. ПодключаемыеКоманды.НастройкиПодключаемыхОтчетовИОбработок.
//
Процедура ПриОпределенииНастроек(Настройки) Экспорт
	
	Настройки.НастроитьВариантыОтчета = Истина;
	Настройки.ОпределитьНастройкиФормы = Истина;
	
	Настройки.ДобавитьКомандыОтчетов = Истина;
	Настройки.Размещение.Добавить(Метаданные.Документы.АктыВыполненныхРабот);
	
КонецПроцедуры

// Вызывается для добавления команд отчетов.
// См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Команды отчетов, которые требуется задать.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Команда = КомандыОтчетов.Добавить();
	Команда.Представление = НСтр("ru = 'Выполненные задачи (в разрезе даты выполнения)'");
	Команда.КлючВарианта  = "ВыполненныеЗадачиПоДатеВыполнения";
	Команда.ОтображениеКнопки = ОтображениеКнопки.КартинкаИТекст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли