
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивИзбранныхIDПроектов = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"Проекты", "МассивИзбранныхIDПроектов",Новый Массив);

	РаботаСЗадачами.ЗаполнитьТаблицуИзбранныхПроектов(МассивИзбранныхIDПроектов,СписокИзбранныхПроектов);	
		
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	МассивСтруктур = Новый Массив;
	
	МассивСтруктур.Добавить(ОписаниеНастройки(
	    "Проекты",
	    "МассивИзбранныхIDПроектов",     	
	    СформироватьМассивИзбранныхПроектов()));
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранитьМассив(МассивСтруктур, Истина);
	
	Оповестить("Изменены_избранные_проекты");
	
	Закрыть();

КонецПроцедуры

&НаКлиенте
Функция ОписаниеНастройки(Объект, Настойка, Значение)
	
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", Объект);
	Элемент.Вставить("Настройка", Настойка);
	Элемент.Вставить("Значение", Значение);
	
	Возврат Элемент;
	
КонецФункции

&НаСервере
Функция СформироватьМассивИзбранныхПроектов() 
	
	МассивДанных = Новый Массив;
	
	Для каждого ТекСтрока Из СписокИзбранныхПроектов Цикл
		
		Если Не ТекСтрока.Используется Тогда
			Продолжить;
		КонецЕсли;
		
		МассивДанных.Добавить(ТекСтрока.IDПроекта);
	
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для каждого ТекСтрока Из СписокИзбранныхПроектов Цикл
	
		ТекСтрока.Используется = Истина;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиВсе(Команда)
	
	Для каждого ТекСтрока Из СписокИзбранныхПроектов Цикл
	
		ТекСтрока.Используется = Ложь;
	
	КонецЦикла;
	
КонецПроцедуры

