
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Функция возвращает все новые актуальные состояния с учетом старых состояний
//
// Параметры:
//  МассивСостояний	 - Массив - массив СправочникСсылка.СостоянияЗадач старых состояний
//		Если не будет заполнено, то возвращаться будут все состояния
//	ТолькоНовые - Булево - по-умолчанию Ложь. Истина, будут выведены только состояния не входящие в  МассивСостояний
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблицы старых и обновленных состояний:
//		* Состояние - СправочникСсылка.СостоянияЗадач
//		* НовоеСостояние - Булево - Истина, в случае если в МассивСостояний не было ранее состояния
//
Функция ВсеАктуальныеСостояния(МассивСостояний = Неопределено, ТолькоНовые = Ложь) Экспорт
	
	Если МассивСостояний = Неопределено Тогда
		МассивСостояний = Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостоянияЗадач.Ссылка КАК Состояние,
	               |	ИСТИНА КАК НовоеСостояние,
	               |	ЗНАЧЕНИЕ(Перечисление.ДоступностьПолей.НеНазначено) КАК Доступность,
	               |	СостоянияЗадач.РеквизитДопУпорядочивания КАК Порядок,
	               |	СостоянияЗадач.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.СостоянияЗадач КАК СостоянияЗадач
	               |ГДЕ
	               |	НЕ СостоянияЗадач.Ссылка В (&МассивСостояний)
	               |	И НЕ СостоянияЗадач.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СостоянияЗадач.Ссылка,
	               |	ЛОЖЬ,
	               |	ЗНАЧЕНИЕ(Перечисление.ДоступностьПолей.НеНазначено),
	               |	СостоянияЗадач.РеквизитДопУпорядочивания,
	               |	СостоянияЗадач.Наименование
	               |ИЗ
	               |	Справочник.СостоянияЗадач КАК СостоянияЗадач
	               |ГДЕ
	               |	СостоянияЗадач.Ссылка В(&МассивСостояний)
	               |	И (&ТолькоНовые = ЛОЖЬ
	               |			ИЛИ &ТолькоНовые = ИСТИНА
	               |				И ЛОЖЬ)
	               |	И НЕ СостоянияЗадач.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания";
	
	Запрос.УстановитьПараметр("МассивСостояний", МассивСостояний);
	Запрос.УстановитьПараметр("ТолькоНовые", ТолькоНовые);
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();

КонецФункции // ВсеАктуальныеСостояния()

#КонецОбласти

#КонецЕсли
