
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = СтрШаблон(НСтр("ru = '[%1]%2'"), Исполнитель, КраткоеНаименование);
	
	ДатаРедактирования = ТекущаяДатаСеанса();
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Включен = Истина;
	Исполнитель = Пользователи.ТекущийПользователь();
	
	НовСтрока = ДниНедели.Добавить();
	НовСтрока.Повторять = Перечисления.ПовторятьНедель.РазВНеделю;
	НовСтрока.ДеньНедели = Перечисления.ДниНедели.Понедельник;
	НовСтрока.ТипРаботы = Перечисления.ТипыРаботПоЗадачам.Сопровождение;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли