#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// отметка протестированных объектов метаданных
	Принято = 0;
	Для каждого стр Из ЭтапыПроверки Цикл
		Если стр.РезультатЭтапа=Перечисления.РезультатЭтапаПроверки.Принято Тогда
			Принято = Принято + 1;
		КонецЕсли;
	КонецЦикла;
	ПринятыОбъекты = ЭтапыПроверки.Количество()= Принято;
	
	Для каждого стр Из ОбъектыНаПроверке Цикл
		// отражение протокола этапов проверки в информационном поле
		Если стр.ОбъектМетаданных.ОбъектПротестирован = ПринятыОбъекты Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектОМ = стр.ОбъектМетаданных.ПолучитьОбъект();
		ОбъектОМ.Заблокировать();
		ОбъектОМ.ОбъектПротестирован = ПринятыОбъекты;
		ОбъектОМ.Записать();
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
