//{{ *Олег Каратаев >>>>>>>>>>>>>>>>>>>>>>> ОПИСАНИЕ ИЗМЕНЕНИЙ >>>>>>>>>>>>>>>>>>>>>>>>>>>
// 
// ИЗМЕНЕННЫЕ СВОЙСТВА ОБЪЕКТА ОТСУТСТВУЮТ
// 
// НОВЫЕ/ИЗМЕНЕННЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//  * [Процедура]ПриЗаполненииСпискаРеквизитовИсточникаСДатамиДляНапоминания
// 
// ТЕГИ ИЗМЕНЕНИЙ
//
//}} *Олег Каратаев <<<<<<<<<<<<<<<<<<<<<<< ОПИСАНИЕ ИЗМЕНЕНИЙ <<<<<<<<<<<<<<<<<<<<<<<<<<<

// Разделитель описания изменений общего модуля >> *Олег Каратаев
Функция ИзмененияОбщегоМодуля()
	
	Если Ложь Тогда
	    ИзмененияОбщегоМодуля()
	КонецЕсли;

	Возврат Неопределено;	

КонецФункции // Конец Разделитель описания изменений общего модуля

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Переопределяет настройки подсистемы.
//
// Параметры:
//  Настройки - Структура:
//   * Расписания - Соответствие из КлючИЗначение:
//      ** Ключ     - Строка - представление расписания;
//      ** Значение - РасписаниеРегламентногоЗадания - вариант расписания.
//   * СтандартныеИнтервалы - Массив - содержит строковые представления интервалов времени.
//
Процедура ПриОпределенииНастроек(Настройки) Экспорт
	
КонецПроцедуры

// Переопределяет массив реквизитов объекта, относительно которых разрешается устанавливать время напоминания.
// Например, можно скрыть те реквизиты с датами, которые являются служебными или не имеют смысла для 
// установки напоминаний: дата документа или задачи и прочие.
// 
// Параметры:
//  Источник - ЛюбаяСсылка - ссылка на объект, для которого формируется массив реквизитов с датами;
//  РеквизитыСДатами - Массив - имена реквизитов (из метаданных), содержащих даты.
//
Процедура ПриЗаполненииСпискаРеквизитовИсточникаСДатамиДляНапоминания(Источник, РеквизитыСДатами) Экспорт
	
	// { *Олег Каратаев
	Если ТипЗнч(Источник) = Тип("ЗадачаСсылка.ЗадачиПользователя") Тогда
	
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыСДатами, "ДатаВыполнения"); 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыСДатами, "СрокОповещения"); 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыСДатами, "ДатаПринятияКИсполнению"); 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыСДатами, "ДатаОценкиЗадачи"); 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыСДатами, "ДатаНачала"); 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыСДатами, "ДатаОценкиЗадачи"); 
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыСДатами, "ДатаПриобретения"); 
	
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.Сертификаты") Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыСДатами, "ДатаИзменения"); 
		
	Иначе	
		// Без обработки.
	КонецЕсли;
	// }
	
КонецПроцедуры

#КонецОбласти
