 //&НаКлиенте
 //Процедура ПодключениеКРабочемуМестуПоОсновнойСхеме(РабочееМесто) Экспорт
 //	Если 	ТипЗнч(РабочееМесто) = Тип("СправочникСсылка.itilРабочиеМеста") Тогда
 //   	 Если РабочееМесто.ОсновнойШаблонУдаленногоДоступа.Пустая() тогда
 //   		 ПодключениеКРабочемуМесту(РабочееМесто,ШаблонУдаленногоПодключенияПоУмолчанию());
 //   	 Иначе	 
 //   		 ПодключениеКРабочемуМесту(РабочееМесто,РабочееМесто.ОсновнойШаблонУдаленногоДоступа);
 //   	 КонецЕсли;
 //	КонецЕсли;
 //КонецПроцедуры
 //
 //
 //&НаСервере
 //Функция ШаблонУдаленногоПодключенияПоУмолчанию()	 
 //	Возврат Константы.itilШаблонУдаленногоПодключенияПоУмолчанию.Получить();	 
 //КонецФункции
 //
 //
 //&НаКлиенте
 //Процедура ПодключениеКРабочемуМесту(РабочееМесто, ШаблонПодключения) Экспорт
 //	
 //	Если ТипЗнч(ШаблонПодключения) = Тип("СправочникСсылка.itilШаблоныУдаленногоДоступа") и
 //   	 ТипЗнч(РабочееМесто) = Тип("СправочникСсылка.itilРабочиеМеста") Тогда
 //   	 
 //   	 СтрокаКоманды = ПолучитьТекстКоманднойСтроки(РабочееМесто, ШаблонПодключения);
 //   	 
 //   	 Для Счетчик = 1 По СтрЧислоСтрок(СтрокаКоманды) Цикл
 //   		 ТекСтрока = СтрПолучитьСтроку(СтрокаКоманды, Счетчик);
 //   		 Если не СокрЛП(ТекСтрока) = "" тогда 
 //   			 ЗапуститьПриложение(ТекСтрока, ШаблонПодключения.РабочийКаталог);
 //   		 конецесли;
 //   	 КонецЦикла;
 //   	 
 //	конецесли;
 //КонецПроцедуры
 //
 //&НаСервере
 //Функция ПолучитьТекстКоманднойСтроки(РабочееМесто, ШаблонПодключения) 
 //	
 //	
 //	СтрокаКоманды = ШаблонПодключения.ШаблонКоманднойСтроки;
 //	
 //	Запрос = Новый Запрос;
 //	Запрос.Текст = 
 //	"ВЫБРАТЬ
 //	|	itilЗначенияСвойствОбъектов.Объект,
 //	|	itilЗначенияСвойствОбъектов.Свойство,
 //	|	itilЗначенияСвойствОбъектов.Значение
 //	|ИЗ
 //	|	РегистрСведений.itilЗначенияСвойствОбъектов КАК itilЗначенияСвойствОбъектов
 //	|ГДЕ
 //	|	itilЗначенияСвойствОбъектов.Объект = &Объект";
 //	
 //	Запрос.УстановитьПараметр("Объект", РабочееМесто);
 //	
 //	Результат = Запрос.Выполнить();
 //	
 //	ВыборкаДетальныеЗаписи = Результат.Выбрать();
 //	
 //	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
 //   	 
 //   	 Свойство = "%"+ВыборкаДетальныеЗаписи.Свойство+"%";
 //   	 СтрокаКоманды = СтрЗаменить(СтрокаКоманды,Свойство, ВыборкаДетальныеЗаписи.Значение); 	
 //   	 
 //	КонецЦикла;
 //	
 //	
 //	Возврат СтрокаКоманды;	 
 //	
 //	
 //	
 //КонецФункции 
