#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗапомнитьСобеседника(Сообщение, ДанныеБота, ПозволитьДальнейшееОбщение) Экспорт
	
	Чат 				= Сообщение.chat;
	КоллекцияСвойств 	= Чат.Свойства();
	
	МЗ = РегистрыСведений.ТелеграмСобеседники.СоздатьМенеджерЗаписи();
	МЗ.Бот = ДанныеБота.Бот;
	МЗ.ИдентификаторЧата = Чат.id;
	МЗ.Прочитать();
	
	Если МЗ.Выбран() Тогда
		СчетчикПринятыхСообщений = МЗ.СчетчикПринятыхСообщений + 1;
		ПозволятьОбщение = МЗ.ПозволятьОбщение;
	Иначе
		СчетчикПринятыхСообщений = 1;
		ПозволятьОбщение = Ложь; 
	КонецЕсли;
	
	МЗ.Бот = ДанныеБота.Бот;
	МЗ.ИдентификаторЧата = Чат.id;
	
	Если КоллекцияСвойств.Получить("first_name") <> Неопределено Тогда
		МЗ.first_name = Чат.first_name;
	КонецЕсли;
	
	Если КоллекцияСвойств.Получить("last_name") <> Неопределено Тогда
		МЗ.last_name = Чат.last_name;
	КонецЕсли;
	
	Если КоллекцияСвойств.Получить("username") <> Неопределено Тогда
		МЗ.username = Чат.username;
	КонецЕсли;
	
	МЗ.Дата = ТекущаяДата();
	МЗ.СчетчикПринятыхСообщений = СчетчикПринятыхСообщений;
	МЗ.ПозволятьОбщение = ПозволятьОбщение;
	МЗ.Записать();
	
	ПозволитьДальнейшееОбщение = ПозволятьОбщение;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
