#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		
		ПутьКФайлуБазы_v8i = "";
		Используется = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДатаСеанса();
	
	Если ЕстьИзмененияПараметровСпискаБазы() Тогда
		ДатаИзмененияПараметровБазы = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьИзмененияПараметровСпискаБазы()
	
	ЕстьИзменения = Ложь;
	
	// Сравнение по реквизитам справочника.
	МассивРеквизитовСравнения = Новый Массив;
	МассивРеквизитовСравнения.Добавить("Родитель");
	МассивРеквизитовСравнения.Добавить("ТипРасположенияИБ");
	МассивРеквизитовСравнения.Добавить("Сервер1С");
	МассивРеквизитовСравнения.Добавить("КаталогИБ");
	МассивРеквизитовСравнения.Добавить("ИмяБазыНаСервере");
	МассивРеквизитовСравнения.Добавить("ВерсияПлатформы");
	МассивРеквизитовСравнения.Добавить("ПутьКФайлуБазы_v8i");
	МассивРеквизитовСравнения.Добавить("ПутьКФайлуБазы_v8i");
	МассивРеквизитовСравнения.Добавить("РежимЗапуска");
	МассивРеквизитовСравнения.Добавить("ОписаниеВФормате_v8i");
	
	ЕстьИзменения = ОбщегоНазначенияКупоросСервер.ЕстьИзмененияРеквизитовОбъекта(ЭтотОбъект, Ссылка, МассивРеквизитовСравнения, ЕстьИзменения);
	
	// Сравнение таблицы параметров доступа.
	МассивТабличныхЧастейСравнения = Новый Массив;
	МассивТабличныхЧастейСравнения.Добавить("СписокПравДоступа");
	
	ЕстьИзменения = ОбщегоНазначенияКупоросСервер.ЕстьИзмененияТабличныхЧастейОбъект(ЭтотОбъект, Ссылка, МассивТабличныхЧастейСравнения, ЕстьИзменения);
	
	Возврат ЕстьИзменения;

КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
