
&НаКлиенте
Процедура МетодПриИзменении(Элемент)
	
	МетодПриИзмененииСервер();
	
КонецПроцедуры


&НаСервере
Процедура МетодПриИзмененииСервер()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Метод", Запись.Метод);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТелеграмМетоды.Сортировка КАК Сортировка
	|ИЗ
	|	РегистрСведений.ТелеграмМетоды КАК ТелеграмМетоды
	|ГДЕ
	|	ТелеграмМетоды.Метод = &Метод
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сортировка УБЫВ";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Запись.Сортировка = 1;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Запись.Сортировка = Выборка.Сортировка + 1;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Сортировка(Команда)
	
	МетодПриИзмененииСервер();
	
КонецПроцедуры
