
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Заголовок 			= Параметры.Заголовок;
	Метод 						= Параметры.Метод;
	НазваниеПроцедуры 			= Параметры.НазваниеПроцедуры;
	СопроводитьКомментариями 	= 1;
	ЗаполнитьТаблицуПараметров();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перенести(Команда)
	
	ВходнойФайлСтруктура = 
	"ВходнойФайлСтруктура = Новый Структура;
	|ВходнойФайлСтруктура.Вставить(""ВидИсточника"", [""Файл"", ""АдресВХранилище"", ""ДвоичныеДанные"", ""СерверТелеграм""]);
	|ВходнойФайлСтруктура.Вставить(""Источник"", [Полное имя файла, или ссылка на значение типа ДвоичныеДанные во временном хранилище, или значение типа ДвоичныеДанные, или ссылка на сервер Телеграм]);
	|ВходнойФайлСтруктура.Вставить(""ИмяФайла"", <Строка>);
	|
	|";
	
	Ответ = "Сообщение = Новый Структура;";
	Ответ = Ответ + Символы.ПС;
	
	ПоляПоиска = Новый Структура("Добавить", Истина);
	СтрокиПеренести = ТаблицаПараметров.НайтиСтроки(ПоляПоиска);
	Для Каждого СтрокаПеренести Из СтрокиПеренести Цикл
		
		Если СтрокаПеренести.Параметр1С = "ВходнойФайлСтруктура" Тогда
			Если СопроводитьКомментариями > 0 Тогда
				Ответ = Ответ + ФорматироватьВКомментарий(СтрокаПеренести.Описание);
			КонецЕсли;
			Ответ = Ответ + "Сообщение.Вставить(""ВходнойФайлСтруктура"", ВходнойФайлСтруктура);" + Символы.ПС;
			Ответ = ВходнойФайлСтруктура + Ответ;
		Иначе
			Если СопроводитьКомментариями > 0 Тогда
				Ответ = Ответ + ФорматироватьВКомментарий(СтрокаПеренести.Описание);
			КонецЕсли;
			Ответ = Ответ + СтрШаблон("Сообщение.Вставить(""%1"", <%2>);", СтрокаПеренести.Параметр1С, СтрокаПеренести.Тип) + Символы.ПС;
		КонецЕсли;
		
	КонецЦикла;
	
	Ответ = Ответ + Символы.ПС + СтрШаблон("%1(Сообщение, НакопленныеДанные);", НазваниеПроцедуры);
	
	Если СопроводитьКомментариями = 2 Тогда // Максимальный
		Ответ = НакопленныеДанныеПодсказка() + Ответ;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(Ответ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуПараметров()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Метод", Метод);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТелеграмМетоды.Параметр1С КАК Параметр1С,
	|	ТелеграмМетоды.ОбязательныйДляЗаполнения КАК ОбязательныйДляЗаполнения,
	|	ТелеграмМетоды.Тип КАК Тип,
	|	ТелеграмМетоды.Описание КАК Описание,
	|	ТелеграмМетоды.ОбязательныйДляЗаполнения КАК Добавить
	|ИЗ
	|	РегистрСведений.ТелеграмМетоды КАК ТелеграмМетоды
	|ГДЕ
	|	ТелеграмМетоды.Метод = &Метод
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТелеграмМетоды.Сортировка";
	
	ТаблицаПараметров.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Функция ФорматироватьВКомментарий(Описание)
	
	Если ЗначениеЗаполнено(Описание) Тогда
		Ответ = СтрЗаменить(Описание, Символы.ПС, Символы.ПС + "// ");
		Ответ = "// " + Ответ;
		Ответ = Символы.ПС + Ответ + Символы.ПС;
	Иначе
		Ответ = "";
	КонецЕсли;
	Возврат Ответ;
	
КонецФункции


&НаСервере
Функция НакопленныеДанныеПодсказка()
	
	Возврат ТелеграмСервер.ПодсказкаПоСтруктуреНакопленныеДанные();
	
КонецФункции

#КонецОбласти




