
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПапкаДляВыгрузокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПапкаДляВыгрузокНачалоВыбораЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ВыбратьКаталог(ОписаниеОповещения, НСтр("ru = 'Выберите каталог'"), Объект.ПапкаДляВыгрузокПоУмолчанию);
		
КонецПроцедуры

&НаКлиенте
Процедура ПапкаДляВыгрузокНачалоВыбораЗавершение(ИмяКаталога, Параметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяКаталога) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПапкаДляВыгрузокПоУмолчанию = ИмяКаталога;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПапкаДляВыгрузокПриИзменении(Элемент)
	
	Если Объект.ПапкаДляВыгрузокПоУмолчанию <> "" Тогда
		Объект.ПапкаДляВыгрузокПоУмолчанию = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(Объект.ПапкаДляВыгрузокПоУмолчанию);
		Объект.ПапкаДляВыгрузокПоУмолчанию = Лев(Объект.ПапкаДляВыгрузокПоУмолчанию,СтрДлина(Объект.ПапкаДляВыгрузокПоУмолчанию)-1);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если Объект.Сервер = "" Тогда
		Объект.Сервер = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПапкаКБазамПоУмолчаниюПриИзменении(Элемент)
	
	Если Объект.ПапкаКБазамПоУмолчанию <> "" Тогда
		Объект.ПапкаКБазамПоУмолчанию = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(Объект.ПапкаКБазамПоУмолчанию);
		Объект.ПапкаКБазамПоУмолчанию = Лев(Объект.ПапкаКБазамПоУмолчанию,СтрДлина(Объект.ПапкаКБазамПоУмолчанию)-1);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПапкаКБазамПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПапкаКБазамПоУмолчаниюНачалоВыбораЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ВыбратьКаталог(ОписаниеОповещения, НСтр("ru = 'Выберите каталог'"), Объект.ПапкаКБазамПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура ПапкаКБазамПоУмолчаниюНачалоВыбораЗавершение(ИмяКаталога, Параметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяКаталога) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПапкаКБазамПоУмолчанию = ИмяКаталога;
	
КонецПроцедуры 

#КонецОбласти
