#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВидыВходящихОбновлений = Перечисления.ТелеграмВидыВходящихОбновлений;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(ВидыВходящихОбновлений.Сообщение);
	ДанныеВыбора.Добавить(ВидыВходящихОбновлений.ОтветКонтекстнойКлавиатуры);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
