
#Область ПрограммныйИнтерфейс

// Для Загрузки данных из макетов: возвращает соответствие с описанием типов на основе колонок таблицы значений
//
// Параметры:
//  ТаблицаОснова	 - ТаблицаЗначений - с любыми данными 
// 
// Возвращаемое значение:
//   Соответствие - содержит:
//		* Ключ - Строка - Имя колонки
//		* Значение - ОписаниеТипов - описание типа колонки таблицы значений
//
Функция СоответствиеСОписаниемТиповНаОсновеТаблицыЗначений(ТаблицаОснова) Экспорт

	ОписаниеТипов = Новый Соответствие;
	Для каждого ТекКолонка Из ТаблицаОснова.Колонки Цикл
	
		ОписаниеТипов.Вставить(ТекКолонка.Имя, ТекКолонка.ТипЗначения);	
	
	КонецЦикла;
	
	Возврат ОписаниеТипов;

КонецФункции

#КонецОбласти
