#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЗначениеПараметраВходящегоСообщения(Параметр, Сообщение) Экспорт
	
	Перем Ответ;
	
	Предопределенные = ПланыВидовХарактеристик.ТелеграмПараметрыВходящегоСообщения;
	
	Если Сообщение = Неопределено Тогда
		Если Параметр = Предопределенные.СодержитАудио Тогда
			Ответ = Ложь;
		ИначеЕсли Параметр = Предопределенные.СодержитВидео Тогда
			Ответ = Ложь;
		ИначеЕсли Параметр = Предопределенные.СодержитГолосовоеСообщение Тогда
			Ответ = Ложь;
		ИначеЕсли Параметр = Предопределенные.СодержитМестоНаКарте Тогда
			Ответ = Ложь;
		ИначеЕсли Параметр = Предопределенные.СодержитМестоположение Тогда
			Ответ = Ложь;
		ИначеЕсли Параметр = Предопределенные.СодержитПодписьФФВ Тогда
			Ответ = Ложь;
		ИначеЕсли Параметр = Предопределенные.СодержитТекст Тогда
			Ответ = Ложь;
		ИначеЕсли Параметр = Предопределенные.СодержитФайл Тогда
			Ответ = Ложь;
		ИначеЕсли Параметр = Предопределенные.СодержитФото Тогда
			Ответ = Ложь;
		ИначеЕсли Параметр = Предопределенные.СодержитКонтакт Тогда
			Ответ = Ложь;
		ИначеЕсли Параметр = Предопределенные.ТекстПодписиФФВ Тогда
			Ответ = "";
		ИначеЕсли Параметр = Предопределенные.ТекстСообщения Тогда
			Ответ = "";
		КонецЕсли;
		Возврат Ответ;
	КонецЕсли;
	
	КоллекцияСвойств = Сообщение.Свойства();
	Если Параметр = Предопределенные.СодержитАудио Тогда
		Ответ = КоллекцияСвойств.Получить("audio") <> Неопределено;
	ИначеЕсли Параметр = Предопределенные.СодержитВидео Тогда
		Ответ = КоллекцияСвойств.Получить("video") <> Неопределено;
	ИначеЕсли Параметр = Предопределенные.СодержитГолосовоеСообщение Тогда
		Ответ = КоллекцияСвойств.Получить("voice") <> Неопределено;
	ИначеЕсли Параметр = Предопределенные.СодержитМестоНаКарте Тогда
		Ответ = КоллекцияСвойств.Получить("venue") <> Неопределено;
	ИначеЕсли Параметр = Предопределенные.СодержитМестоположение Тогда
		Ответ = КоллекцияСвойств.Получить("location") <> Неопределено;
	ИначеЕсли Параметр = Предопределенные.СодержитПодписьФФВ Тогда
		Ответ = КоллекцияСвойств.Получить("caption") <> Неопределено;
	ИначеЕсли Параметр = Предопределенные.СодержитТекст Тогда
		Ответ = КоллекцияСвойств.Получить("text") <> Неопределено;
	ИначеЕсли Параметр = Предопределенные.СодержитФайл Тогда
		Ответ = КоллекцияСвойств.Получить("document") <> Неопределено;
	ИначеЕсли Параметр = Предопределенные.СодержитФото Тогда
		Ответ = КоллекцияСвойств.Получить("photo") <> Неопределено;
	ИначеЕсли Параметр = Предопределенные.СодержитКонтакт Тогда
		Ответ = КоллекцияСвойств.Получить("contact") <> Неопределено;
	ИначеЕсли Параметр = Предопределенные.ТекстПодписиФФВ Тогда
		Если КоллекцияСвойств.Получить("caption") <> Неопределено Тогда
			Ответ = Сообщение.caption;
		Иначе
			Ответ = "";
		КонецЕсли;		
	ИначеЕсли Параметр = Предопределенные.ТекстСообщения Тогда
		Если КоллекцияСвойств.Получить("text") <> Неопределено Тогда
			Ответ = Сообщение.text;
		Иначе
			Ответ = "";
		КонецЕсли;		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#КонецЕсли



