
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(Бот, СтрокаJSON, Метод, Тип = Неопределено) Экспорт
	
	Если СтрокаJSON = "{""ok"":true,""result"":[]}" Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Бот) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ФорматированныйJSON = ТелеграмСервер.ФорматироватьСтрокуJSON(СтрокаJSON);
	Исключение
		ФорматированныйJSON = СтрокаJSON;
	КонецПопытки;
	
	МенеджерЗаписи = РегистрыСведений.ТелеграмЖурнал.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Бот = Бот;
	МенеджерЗаписи.ДатаВремя = ТекущаяДата();
	МенеджерЗаписи.УникальныйИдентификатор = Новый УникальныйИдентификатор;
	МенеджерЗаписи.СтрокаJSON = ФорматированныйJSON;
	МенеджерЗаписи.Метод = Метод;
	МенеджерЗаписи.Тип = ?(Тип = Неопределено, ОпределитьТип(Метод), Тип);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьТип(Метод)
	
	Если Метод = "getUpdates" Тогда
		Возврат "ВХ";
	Иначе
		Возврат "ОТВЕТ";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
