
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	ЗагрузитьСтраницу(Код1С);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Попытка
		Код1С = РаскрашенныйКод1С();
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка выполнения клиентского кода.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьКод(Команда)
	
	Попытка
		
		Код1С = РаскрашенныйКод1С();
		Если ВыполнятьНаСервере Тогда
			ВыполнитьКодНаСервере();
		Иначе 	
			Выполнить(Код1С);
		КонецЕсли;
		
	Исключение
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКодНаСервере()
	
	ОбщегоНазначения.ВыполнитьВБезопасномРежиме(Код1С);
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьСтраницу(Код);
	
	ОбъектСервера = РеквизитФормыВЗначение("Объект");
	СтраницаHTML = ОбъектСервера.РаскрашеннаяСтраница1C(Код);
	
КонецПроцедуры

&НаКлиенте
Функция РаскрашенныйКод1С()
	
	//Возврат ОбщегоНазначенияКупоросКлиент.КодПрограммыИзРаскрашенногоHTML(Элементы.СтраницаHTML);
	Возврат ОбщегоНазначенияКупоросКлиент.КодПрограммыИзРаскрашенногоHTML(Элементы.СтраницаHTML);
	
КонецФункции

#КонецОбласти



