
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого ТекСтрока Из Параметры.Пользователи Цикл
	
		ПользователиДанных.Добавить(ТекСтрока.Значение);
	
	КонецЦикла;
	
	Если Не Параметры.ГруппаДоступа.Пустая() Тогда
		ГруппаДоступа = Параметры.ГруппаДоступа;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьНовогоПользователя(Команда)
	СоздатьНовогоПользователяНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьНовогоПользователяНаСервере()
	
	Для каждого ТекСтрока Из ПользователиДанных Цикл
	
		РаботаСоСтруктуройКаталоговAD.СоздатьНовогоПользователяИБ(ТекСтрока.Значение, ГруппаДоступа, Организация);
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Пользователь создан: %1.'"),ТекСтрока.Значение);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Отключить(Команда)
	ОтключитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтключитьНаСервере()
	
	Для каждого ТекСтрока Из ПользователиДанных Цикл
	
		РаботаСоСтруктуройКаталоговAD.ОтключитьПользователяОтИБ(ТекСтрока.Значение);
	
	КонецЦикла;
	ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Пользователи отключены'"));
	
КонецПроцедуры

#КонецОбласти

