
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Отказ = Истина;
	ЗаписатьНаСервере();
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбновлениеСпискаОбщихБазПользователей(Команда)
	
	ВыполнитьОбновлениеСпискаОбщихБазПользователейНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выполнено обновление справочники ""Список общих баз пользователей"".'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьНаСервере()
	
	НаборЗаписей = РегистрыСведений.ПараметрыКупорос.СоздатьНаборЗаписей();
	НоваяЗапись = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, Запись);
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбновлениеСпискаОбщихБазПользователейНаСервере()
	
	РаботаСоСтруктуройКаталоговAD.ОбновлениеСправочникаСпискаОбщихБазПользователей();
	
КонецПроцедуры

#КонецОбласти
