#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает найденную запись в виде ссылке на "Список общих баз пользователей"
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи	 
// 
// Возвращаемое значение:
//  СправочникСсылка.СписокОбщихБазПользователей
//
Функция НайтиСписокПоПользователю(Пользователь) Экспорт

	НайденныйПользовательСпискаБаз = Справочники.СписокОбщихБазПользователей.НайтиПоРеквизиту("Пользователь", Пользователь);
	
	Возврат НайденныйПользовательСпискаБаз;

КонецФункции 

#КонецОбласти

#КонецЕсли