#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = "" + Пользователь;
	ДатаИзменения = ТекущаяДатаСеанса();
	
	ОбновлятьКодСписка = Истина;
	Если ДополнительныеСвойства.Свойство("ОбновлятьКодСписка") Тогда
		ОбновлятьКодСписка = ДополнительныеСвойства.ОбновлятьКодСписка;
	КонецЕсли;
	
	Если ОбновлятьКодСписка Тогда
		КодСписка = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
