

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ТекстИзменениеКонфигурации = "Изменение от " + Формат(Запись.ДатаДобавления, "ДФ=dd.MM.yyyy") + " к версии " + Запись.ВерсияКонфигурации; 
	
	Оповестить("Запись_ОписаниеИзмененийКонфигурации", ТекстИзменениеКонфигурации);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВерсияКонфигурацииПриИзменении(Элемент)
	
	Запись.ПорядковыйНомер = ПолучитьМаксимальныйПорядковыйНомерСервер(Запись.Конфигурация, Запись.ВерсияКонфигурации, Запись.РазделОбновления) + 1; 
	
КонецПроцедуры

&НаКлиенте
Процедура РазделОбновленияПриИзменении(Элемент)
	
	Запись.ПорядковыйНомер = ПолучитьМаксимальныйПорядковыйНомерСервер(Запись.Конфигурация, Запись.ВерсияКонфигурации, Запись.РазделОбновления) + 1; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьМаксимальныйПорядковыйНомерСервер(Конфигурация, ВерсияКонфигурации, РазделОбновления)

	Возврат РегистрыСведений.ОписаниеИзмененийКонфигурации.ПолучитьМаксимальныйПорядковыйНомер(Конфигурация, ВерсияКонфигурации, РазделОбновления);	

КонецФункции // ПолучитьМаксимальныйПорядковыйНомерСервер()

#КонецОбласти

