////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ ИСПОЛЬЗУЕТСЯ ДЛЯ НАЗНАЧЕНИЯ ОБРАБОТЧИКОВ СОБЫТИЙ ОБМЕНА КУПОРОС
//  
////////////////////////////////////////////////////////////////////////////////


//////////////////////////////////////////////////////////////////////////////
// Обработчики событий подписок для плана обмена "ОбменВРаспределеннойИнформационнойБазе".

// Описание см. в ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью.
//
Процедура ОбменВРаспределеннойИнформационнойБазеЗарегистрироватьИзменение(Источник, Отказ) Экспорт
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменВРаспределеннойИнформационнойБазе", Источник, Отказ);
	
КонецПроцедуры

// Описание см. в ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента.
//
Процедура ОбменВРаспределеннойИнформационнойБазеЗарегистрироватьИзменениеДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("ОбменВРаспределеннойИнформационнойБазе", Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

// Описание см. в ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюКонстанты.
//
Процедура ОбменВРаспределеннойИнформационнойБазеЗарегистрироватьИзменениеКонстанты(Источник, Отказ) Экспорт
	
	// Не регистрируем в обмен константы из подчиненного узла.
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюКонстанты("ОбменВРаспределеннойИнформационнойБазе", Источник, Отказ);
	
КонецПроцедуры

// Описание см. в ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра.
//
Процедура ОбменВРаспределеннойИнформационнойБазеЗарегистрироватьИзменениеНабораЗаписей(Источник, Отказ, Замещение) Экспорт
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ОбменВРаспределеннойИнформационнойБазе", Источник, Отказ, Замещение);
	
КонецПроцедуры

// Описание см. в ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра.
//
Процедура ОбменВРаспределеннойИнформационнойБазеЗарегистрироватьИзменениеНабораЗаписейРасчетаПередЗаписью(Источник, Отказ, Замещение, ТолькоЗапись, ЗаписьФактическогоПериодаДействия, ЗаписьПерерасчетов) Экспорт
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ОбменВРаспределеннойИнформационнойБазе", Источник, Отказ, Замещение);
	
КонецПроцедуры

// Описание см. в ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением.
//
Процедура ОбменВРаспределеннойИнформационнойБазеЗарегистрироватьУдаление(Источник, Отказ) Экспорт
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменВРаспределеннойИнформационнойБазе", Источник, Отказ);
	
КонецПроцедуры

