//{{ *Олег Каратаев >>>>>>>>>>>>>>>>>>>>>>> ОПИСАНИЕ ИЗМЕНЕНИЙ >>>>>>>>>>>>>>>>>>>>>>>>>>>
// 
// ИЗМЕНЕННЫЕ СВОЙСТВА ОБЪЕКТА ОТСУТСТВУЮТ
// 
// НОВЫЕ/ИЗМЕНЕННЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//  * [Процедура]ПриВыбореИсполнителя #TaskUsers переопределение стандартной формы выбора исполнителя, для возможности более тонкого управления объектами адресации
//  + [Процедура]НеобходимоОпределениеОбъектовАдресацииПриВыбореРоли #TaskUsers
// 
// ТЕГИ ИЗМЕНЕНИЙ
//
//}} *Олег Каратаев <<<<<<<<<<<<<<<<<<<<<<< ОПИСАНИЕ ИЗМЕНЕНИЙ <<<<<<<<<<<<<<<<<<<<<<<<<<<

// Разделитель описания изменений общего модуля >> *Олег Каратаев
Функция ИзмененияОбщегоМодуля()
	
	Если Ложь Тогда
	    ИзмененияОбщегоМодуля()
	КонецЕсли;

	Возврат Неопределено;	

КонецФункции // Конец Разделитель описания изменений общего модуля


///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при открытии формы выбор исполнителя.
// Позволяет переопределить стандартную форму выбора.
//
// Параметры:
//  ЭлементИсполнитель   - ПолеФормы - элемент формы, в которой выбирается исполнитель.
//  РеквизитИсполнитель  - СправочникСсылка.Пользователи - выбранный ранее исполнитель.
//                         Используется для установки текущей строки в форме выбора исполнителя.
//  ТолькоПростыеРоли    - Булево - если Истина, то указывает что для выбора нужно
//                         использовать только роли без объектов адресации.
//  БезВнешнихРолей      - Булево - если Истина, то указывает, что для выбора надо использовать только роли,
//                         у которых не установлен признак ВнешняяРоль.
//  СтандартнаяОбработка - Булево - если Ложь, то не требуется выводить стандартную форму выбора исполнителя.
//
Процедура ПриВыбореИсполнителя(ЭлементИсполнитель, РеквизитИсполнитель, ТолькоПростыеРоли,
	БезВнешнихРолей, СтандартнаяОбработка) Экспорт

	// { *Олег Каратаев [08.03.2017]

	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Исполнитель, ТолькоПростыеРоли, БезВнешнихРолей", 
		РеквизитИсполнитель, ТолькоПростыеРоли, БезВнешнихРолей);
		
	ОткрытьФорму("ОбщаяФорма.ВыборИсполнителяЗадачиПользователя", ПараметрыФормы, ЭлементИсполнитель);

	// }	
	
КонецПроцедуры

#КонецОбласти

// { *Олег Каратаев [08.03.2017]

&НаКлиенте
Функция НеобходимоОпределениеОбъектовАдресацииПриВыбореРоли(ТипОсновногоОбъектаАдресации,ТипДополнительногоОбъектаАдресации) Экспорт

	Результат = Истина;
	
	Если Не ЗначениеЗаполнено(ТипОсновногоОбъектаАдресации) Тогда
	   	Результат = Ложь;
	КонецЕсли;
	
	// Проект определяется из задачи, если у роли указан объект адресации только "Проект"
	Если ТипОсновногоОбъектаАдресации = ПредопределенноеЗначение("ПланВидовХарактеристик.ОбъектыАдресацииЗадач.Проект") 
		И (Не ЗначениеЗаполнено(ТипДополнительногоОбъектаАдресации)) Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // НеобходимоОпределениеОбъектовАдресацииПриВыбореРоли()
