
&НаКлиенте
Процедура Мультимедиа_Открыть(Команда)
	
	ПолучитьФайл(
		ПолучитьНавигационнуюСсылку(
			ПолучитьКлючЗаписиРегистраСведений("СообщенияЧатБота", Новый Структура("Период,ЧатБот,IDЧата", Запись.Период, Запись.ЧатБот, Запись.IDЧата)),
			"СообщениеХранимыйФайл"),
		Запись.ИмяХранимогоФайла,
		Истина);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлючЗаписиРегистраСведений(ИмяРегистра, СтруктураКлюча)
	
	Возврат РегистрыСведений[ИмяРегистра].СоздатьКлючЗаписи(СтруктураКлюча)
	
КонецФункции