

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКупоросСервер.ПриСозданииНаСервереФормыВыбора(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ОбщегоНазначенияКлиент.ДатаСеанса());	
	
	ПараметрыОтбора = Новый Соответствие();
	ПараметрыОтбора.Вставить("ПоказыватьВсеСертификаты", ПоказыватьВсеСертификаты);	
	УстановитьОтборСписка(Список, ПараметрыОтбора);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьВсеСертификатыПриИзменении(Элемент)
	
	УстановитьОтборНаКлиенте();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновлениеНапоминанийСертификатовСГруппамиПользователей(Команда)
	
	ОбновлениеНапоминанийСертификатовСГруппамиПользователейНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновлениеНапоминанийСертификатовСГруппамиПользователейНаСервере()
	
	Справочники.Сертификаты.ОбновлениеНапоминанийАктивныхСертификатовТолькоСГруппамиПользователей();	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборНаКлиенте()
	
	ПараметрыОтбора = Новый Соответствие();
	ПараметрыОтбора.Вставить("ПоказыватьВсеСертификаты", ПоказыватьВсеСертификаты);	
	УстановитьОтборСписка(Список, ПараметрыОтбора);	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора)
	
	// показывать все сертификаты
	ПоказыватьВсеСертификаты = ПараметрыОтбора.Получить("ПоказыватьВсеСертификаты");
	Если ПоказыватьВсеСертификаты <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "Актуален");
		Если Не ПараметрыОтбора["ПоказыватьВсеСертификаты"] Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
				Список.Отбор, "Актуален", Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
