
#Область ПрограммныйИнтерфейс

#Область РегламентныеЗадания

// Регламентное задание. Обработка справочника Пользователи по данным КП_ПользователиТекущейИС.
Процедура АктуализацияНаДоступПользователей() Экспорт
	
	// Обновление текущих пользоватлей по справочнику КП_ПользователиТекущейИС
	ОбработкаПользователейНаДоступ();
	
	// Отключение пользователей отсутствующих в справочнике КП_ПользователиТекущейИС 
	ОтключениеДоступаНеВходящимВТекущуюИС();
	
КонецПроцедуры 

// Регламентное задание. Обновление прав доступа пользователей
//
Процедура ОбновлениеПравДоступаПользователей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КП_ПользователиТекущейИС.Ссылка КАК Ссылка,
	               |	КП_ПользователиТекущейИС.Пользователь КАК Пользователь
	               |ИЗ
	               |	Справочник.КП_ПользователиТекущейИС КАК КП_ПользователиТекущейИС
	               |ГДЕ
	               |	КП_ПользователиТекущейИС.ТребуетсяОбновлениеПравПользователя
	               |	И КП_ПользователиТекущейИС.Пользователь <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ОбновитьПраваДоступаПользователя(Выборка.Ссылка, Выборка.Пользователь);		
	
	КонецЦикла;

КонецПроцедуры 

#КонецОбласти

// Добавление/обновление пользователей в справочнике КП_ПользователиТекущейИС
//
// Параметры:
//  ТаблицаАктуальныхПользователей	 - ТаблицаЗначений - см. описание возвращаемого значения КП_ОбменДаннымиКупорос.ЗагрузкаАктуальныхПользователейИзКупорос() 
//
Процедура АктуализацияПользователейТекущейИС(ТаблицаАктуальныхПользователей) Экспорт
	
	// Проверка на заполенность таблицы пользователей от Купорос.
	// Если таблица пустая, то есть вероятность сбоя при получении данных от Купорос.
	Если Не ЗначениеЗаполнено(ТаблицаАктуальныхПользователей) Тогда
		ТекстИнформации = НСтр("ru = 'Таблица актуальных пользователей от Купорос получена пустой. Загрузка пользователей остановлена.'"); 
		КП_УправлениеБотомVKTeams.ОтправитьСообщениеВГруппуУправлениеДоступомПользователей(ТекстИнформации);
		
		КП_ОбщегоНазначенияКупорос.ЗаписьЖурналаРегистрацииРасширенная("КП_ВнешнееУправлениеДоступом.АктуализацияПользователейТекущейИС", 
			ТекстИнформации, 
			УровеньЖурналаРегистрации.Информация);
    	
		Возврат;	
	КонецЕсли;
	
	// Актуализация новых/обновленных.
	АктуализироватьПользователейТекущейИС(ТаблицаАктуальныхПользователей);
	
	// Выявление отключенных.
	ОпределениеОтключенныхПользователейТекущейИС(ТаблицаАктуальныхПользователей);
	
КонецПроцедуры 
// Обновление текущих пользователей по справочнику КП_ПользователиТекущейИС
//
Процедура ОбработкаПользователейНаДоступ(ТолькоИнформация = Ложь, СводнаяСтрокаСообщений = "") Экспорт

 	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КП_ПользователиТекущейИС.Ссылка КАК Ссылка,
	               |	КП_ПользователиТекущейИС.Недействителен КАК Недействителен,
	               |	КП_ПользователиТекущейИС.Пользователь КАК Пользователь
	               |ИЗ
	               |	Справочник.КП_ПользователиТекущейИС КАК КП_ПользователиТекущейИС
	               |ГДЕ
	               |	НЕ КП_ПользователиТекущейИС.ПометкаУдаления
	               |	И КП_ПользователиТекущейИС.ТребуетсяОбновлениеПользователя";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ТекстНовыеПользователи = "";
	ТекстОбновленныеПользователи = "";
	ТекстОтключенныеПользователи = "";
	
	Пока Выборка.Следующий() Цикл
	
		Если Не Выборка.Недействителен Тогда
		
			РезультатСоздания = СоздатьНовогоПользователяИБ(Выборка.Ссылка, Выборка.Пользователь,, ТолькоИнформация);
			ЭтоНовый = Ложь;
			Если РезультатСоздания.СозданНовыйПользователь
				Или РезультатСоздания.СозданНовыйПользовательИБ Тогда
				ТекстДействие = "Создан ";
				ЭтоНовый = Истина;
			ИначеЕсли РезультатСоздания.ОбновленПользователь Тогда
				ТекстДействие = "Обновлен ";
			Иначе
				ТекстДействие = "";
			КонецЕсли;
			
			ТекстИнформацииПользователя = СтрШаблон(НСтр("ru = '
                                                           |%1[%2]: %3'"), ТекстДействие, Выборка.Ссылка, РезультатСоздания.Комментарий);
		
			Если ЭтоНовый Тогда
				ТекстНовыеПользователи = ТекстНовыеПользователи + ТекстИнформацииПользователя;	
			Иначе
				ТекстОбновленныеПользователи = ТекстОбновленныеПользователи + ТекстИнформацииПользователя;	
			КонецЕсли;

			Пользователь = РезультатСоздания.Пользователь;
			
		Иначе
			
			РезультатОтключения = ОтключитьПользователяТекущейИС(Выборка.Ссылка, ТолькоИнформация);
			
			ТекстДействие = Формат(РезультатОтключения.Отключен, "БЛ='Не отключен '; БИ='Отключен '");
			
			ТекстИнформацииПользователя = СтрШаблон(НСтр("ru = '
				|%1[%2]: %3'"), ТекстДействие, Выборка.Ссылка, РезультатОтключения.Комментарий);

			
			ТекстОтключенныеПользователи = ТекстОтключенныеПользователи + ТекстИнформацииПользователя;
			
			Пользователь = РезультатОтключения.Пользователь;
			
		КонецЕсли;	
		
		Если Не ТолькоИнформация Тогда
		
			// Зафиксировать результат отработки пользователя в справочнике КП_ПользователиТекущейИС.
			Данные = Новый Структура;
			Данные.Вставить("ТребуетсяОбновлениеПользователя", Ложь);
			Данные.Вставить("Пользователь", Пользователь);
			ОбъектДанных = Выборка.Ссылка.ПолучитьОбъект();
			
			ЗаписатьПользователяТекущейИС(Данные, ОбъектДанных);
		
		КонецЕсли;
		
	КонецЦикла; 
	
	СводнаяСтрокаСообщений = СтрШаблон(НСтр("ru = 'Добавление новых пользователей:
                                             |%1
                                             |------------------------------------------------
                                             |Обновление пользователей:
                                             |%2
                                             |------------------------------------------------
                                             |Отключение пользователей:
                                             |%3
                                             |'"), ТекстНовыеПользователи, ТекстОбновленныеПользователи, ТекстОтключенныеПользователи);
	
КонецПроцедуры 

// Отключение пользователей отсутствующих в справочнике КП_ПользователиТекущейИС
//
// Параметры:
//  ТолькоИнформация		 - Булево - Если Истина, то не отключает пользователей системы, а только информирует
//  СводнаяСтрокаСообщений	 - Строка - Собирает все сообщения в одну строку, для дальнейшего вывода клиенту
//
Процедура ОтключениеДоступаНеВходящимВТекущуюИС(ТолькоИнформация = Ложь, СводнаяСтрокаСообщений = "") Экспорт
	
	ОтключатьПользователей = РегистрыСведений.КП_ПараметрыСистемыУправленияДоступомПользователей.ЗначениеПараметра("ОтключатьПользователейДобавленныхВручную");
	Если Не ОтключатьПользователей Тогда
		Возврат;		
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Ссылка КАК Ссылка,
	               |	Пользователи.Недействителен КАК Недействителен
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КП_ПользователиТекущейИС КАК КП_ПользователиТекущейИС
	               |		ПО (КП_ПользователиТекущейИС.Пользователь = Пользователи.Ссылка)
	               |ГДЕ
	               |	НЕ Пользователи.ПометкаУдаления
	               |	И НЕ Пользователи.Недействителен
	               |	И КП_ПользователиТекущейИС.Ссылка ЕСТЬ NULL";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ТекстОтключенных = "";
	ТекстТехнических = "";
	Пока Выборка.Следующий() Цикл
	
		РезультатОтключения = ОтключитьПользователяИБ(Выборка.Ссылка, ТолькоИнформация);
		
		ТекстСообщения = СтрШаблон(НСтр("ru = '%1: Результат отключения - %2. %3'"), 
			Выборка.Ссылка, Формат(РезультатОтключения.Отключен, "БЛ='Не отключен'; БИ=Отключен"), 
			РезультатОтключения.Комментарий);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Если РезультатОтключения.Отключен Тогда
			ТекстОтключенных = ТекстОтключенных + Символы.ПС + ТекстСообщения;
			
			ТекстИнформации = СтрШаблон(НСтр("ru = 'Отключен %1, т.к. не входит в группу AD.'"), Выборка.Ссылка); 
			КП_УправлениеБотомVKTeams.ОтправитьСообщениеВГруппуУправлениеДоступомПользователей(ТекстИнформации);	
			
		Иначе
			ТекстТехнических = ТекстТехнических + Символы.ПС + ТекстСообщения;	
		КонецЕсли;
		
	КонецЦикла;
	
	СводнаяСтрокаСообщений = СтрШаблон(НСтр("ru = 'Отключение не входящих в группу ИС:
                                             |%1
                                             |------------------------------------------------
                                             |Технические пользователи, которые не отключены:
                                             |%2
                                             |'"), ТекстОтключенных, ТекстТехнических);
	
КонецПроцедуры 

// Возвращает данные по группам доступа пользователя
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи, Массив Из СправочникСсылка.Пользователи
//  ВыводитьНаследованныеГруппыПользователей - Булево - Если передать Ложь, то не будут выводиться наследованные группы пользователей
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки:
//		* ГруппаДоступа - СправочникСсылка.ГруппыДоступа
//		* ГруппаПользователей - СправочникСсылка.ГруппыПользователей
//		* Наследованный - Булево - Истина, если группа пользователя является по иерархии выше и в ней нет этого пользователя
//
Функция ДанныеПоДоступамПользователя(Пользователь, ВыводитьНаследованныеГруппыПользователей = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоставыГруппПользователей.ГруппаПользователей КАК ГруппаПользователей,
	|	СоставыГруппПользователей.Пользователь КАК Пользователь,
	|	ВЫБОР
	|		КОГДА ГруппыПользователейСостав.Ссылка ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Наследованный
	|ПОМЕСТИТЬ ВТ_ГруппыПользователей
	|ИЗ
	|	РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|		ПО СоставыГруппПользователей.Пользователь = ГруппыПользователейСостав.Пользователь
	|			И СоставыГруппПользователей.ГруппаПользователей = ГруппыПользователейСостав.Ссылка
	|ГДЕ
	|	СоставыГруппПользователей.Пользователь В(&Пользователи)
	|	И СоставыГруппПользователей.ГруппаПользователей <> ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
	|	И СоставыГруппПользователей.Пользователь <> СоставыГруппПользователей.ГруппаПользователей
	|	И СоставыГруппПользователей.Используется
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыДоступаПользователи.Ссылка КАК Группа,
	|	ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ПустаяСсылка) КАК ГруппаПользователя,
	|	ЛОЖЬ КАК Наследованный
	|ПОМЕСТИТЬ ВТ_ГруппыДоступа
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|ГДЕ
	|	ГруппыДоступаПользователи.Пользователь В(&Пользователи)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГруппыДоступаПользователи.Ссылка,
	|	ВТ_ГруппыПользователей.ГруппаПользователей,
	|	ВТ_ГруппыПользователей.Наследованный
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГруппыПользователей КАК ВТ_ГруппыПользователей
	|		ПО ГруппыДоступаПользователи.Пользователь = ВТ_ГруппыПользователей.ГруппаПользователей
	|ГДЕ
	|	(ВТ_ГруппыПользователей.Наследованный = ЛОЖЬ
	|			ИЛИ ВТ_ГруппыПользователей.Наследованный = &Наследованный)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГруппыДоступа.Группа КАК ГруппаДоступа,
	|	МИНИМУМ(ВТ_ГруппыДоступа.ГруппаПользователя) КАК ГруппаПользователя,
	|	МИНИМУМ(ВТ_ГруппыДоступа.Наследованный) КАК Наследованный
	|ИЗ
	|	ВТ_ГруппыДоступа КАК ВТ_ГруппыДоступа
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ГруппыДоступа.Группа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ГруппыДоступа.Группа.Наименование";		
	Запрос.УстановитьПараметр("Пользователи", Пользователь);
	Запрос.УстановитьПараметр("Наследованный", ВыводитьНаследованныеГруппыПользователей);
	
	Результат = Запрос.Выполнить();
	ТаблицаДанных = Результат.Выгрузить();
	
	Возврат ТаблицаДанных;

КонецФункции

// Возвращает строку описания группы доступа
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
// 
// Возвращаемое значение:
//  Строка - данные по группе доступа
//
Функция СтрокаОписанияГруппДоступа(Пользователь) Экспорт
	
	ТаблицаДанных = ДанныеПоДоступамПользователя(Пользователь);
	
	СтрокаОписания = "";
	
	Для каждого ТекСтрока Из ТаблицаДанных Цикл
		
		Если ЗначениеЗаполнено(ТекСтрока.ГруппаПользователя) Тогда
		
			НовСтрока = СтрШаблон(НСтр("ru = '- %1 
				| --> %2%3
				|'"), 
			ТекСтрока.ГруппаДоступа, ТекСтрока.ГруппаПользователя, Формат(ТекСтрока.Наследованный, "БЛ=; БИ=(Наследован)"));
			
		Иначе
			
			НовСтрока = СтрШаблон(НСтр("ru = '- %1
                                        |'"), ТекСтрока.ГруппаДоступа);
			
		КонецЕсли;
		
		СтрокаОписания = СтрокаОписания + НовСтрока;	
	
	КонецЦикла;
	
	СтрокаОписания = СокрЛП(СтрокаОписания);
	
	Возврат СтрокаОписания;

КонецФункции

// Таблица актуальных шаблонов доступа
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки:
//		* Ссылка - СправочникСсылка.КП_ШаблоныДоступаПользователей
//		* Наименование - Строка
//		* ОписаниеГруппДоступа - Строка
//
Функция ТаблицаАктуальныхШаблоновДоступа() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КП_ШаблоныДоступаПользователей.Ссылка КАК Ссылка,
	               |	КП_ШаблоныДоступаПользователей.Наименование КАК Наименование,
	               |	КП_ШаблоныДоступаПользователей.ОписаниеГруппДоступа КАК ОписаниеГруппДоступа,
	               |	КП_ШаблоныДоступаПользователей.ПользовательШаблон КАК ПользовательШаблон,
	               |	КП_ШаблоныДоступаПользователей.Комментарий КАК Комментарий
	               |ИЗ
	               |	Справочник.КП_ШаблоныДоступаПользователей КАК КП_ШаблоныДоступаПользователей
	               |ГДЕ
	               |	НЕ КП_ШаблоныДоступаПользователей.ПометкаУдаления
	               |	И КП_ШаблоныДоступаПользователей.Использовать";
	
	Результат = Запрос.Выполнить();
	ТаблицаДанных = Результат.Выгрузить();
	
	Возврат ТаблицаДанных;

КонецФункции

// Обновление шаблонов доступа, в случае наличия отличий
// Вызывается из КП_ОбменДаннымиКупорос.ОбработкаВыгрузкиАктуальныхШаблоновДоступа()
//
Процедура ОбновлениеШаблоновДоступа() Экспорт

	ТаблицаДанных = ТаблицаАктуальныхШаблоновДоступа();
	
	Для каждого ТекСтрока Из ТаблицаДанных Цикл
	
		НовоеОписаниеГруппДоступа = СтрокаОписанияГруппДоступа(ТекСтрока.ПользовательШаблон);
		
		Если НовоеОписаниеГруппДоступа = ТекСтрока.ОписаниеГруппДоступа Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектШаблон = ТекСтрока.Ссылка.ПолучитьОбъект();
		
		// При записи произойдет обновление описания группы доступа.
		ОбъектШаблон.Записать();
		
	КонецЦикла;
	
КонецПроцедуры 

// Загрузка прав доступа в справочник КП_ПользователиТекущейИС 
//
// Параметры:
//  ТаблицаПравПользователей - ТаблицаЗначений - содержит колонки:
//		* ID_User - Строка - УИД пользователя Купорос
//		* ID_Pattern - Строка - УИД шаблоная доступа пользователя текущей системыч 
//		* Comment - Строка
//
Процедура ЗагрузкаПравДоступа(ТаблицаПравПользователей) Экспорт

	Для каждого ТекСтрока Из ТаблицаПравПользователей Цикл
		
	    ПользовательТекущейИС = НайтиПользователяТекущейИСПоИД(ТекСтрока.ID_User);
		
		Если Не ЗначениеЗаполнено(ПользовательТекущейИС) Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектПользователь = ПользовательТекущейИС.ПолучитьОбъект(); 
		
		Если ЗначениеЗаполнено(ТекСтрока.ID_Pattern) Тогда
			
			ИД_ШаблонаДоступа = Новый УникальныйИдентификатор(ТекСтрока.ID_Pattern);
			СсылкаНаШаблонДоступа = Справочники.КП_ШаблоныДоступаПользователей.ПолучитьСсылку(ИД_ШаблонаДоступа);
			
			ОбрабатываемаяСтрока = ОбъектПользователь.ПраваПользователяИзКупорос.Найти(СсылкаНаШаблонДоступа, "ШаблонДоступа");
			Если ОбрабатываемаяСтрока = Неопределено Тогда
				ОбрабатываемаяСтрока = ОбъектПользователь.ПраваПользователяИзКупорос.Добавить();
			КонецЕсли;
			ОбрабатываемаяСтрока.ШаблонДоступа = СсылкаНаШаблонДоступа;
			ОбрабатываемаяСтрока.Комментарий   = ТекСтрока.Comment;
			
		ИначеЕсли ТаблицаПравПользователей.Количество() = 1 Тогда 
			// Таблица прав пустая
			
			ОбъектПользователь.ПраваПользователяИзКупорос.Очистить();
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
		ОбъектПользователь.ТребуетсяОбновлениеПравПользователя = Истина;
		ОбъектПользователь.Записать();
		
	КонецЦикла;
	
КонецПроцедуры 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область АктуализацияПользователейТекущейИС

// Обновить пользователя текущей ИС
//
// Параметры:
//  Данные - СтрокаТаблицыЗначений - см. описание возвращаемого значения КП_ОбменДаннымиКупорос.ЗагрузкаАктуальныхПользователейИзКупорос() 
//  СсылкаНаПользователя - СправочникСсылка.КП_ПользователиТекущейИС 
//
Процедура ОбновитьПользователяТекущейИС(Данные, СсылкаНаПользователя)
	
	СписокПолейСравнения = Новый Массив;
	СписокПолейСравнения.Добавить("Наименование");
	СписокПолейСравнения.Добавить("УчетнаяЗаписьWindows");
	СписокПолейСравнения.Добавить("ПользовательОС");
	СписокПолейСравнения.Добавить("Email");
	СписокПолейСравнения.Добавить("Недействителен");
	СписокПолейСравнения.Добавить("ИД_Купорос");
	
	// Проверка на наличие изменений в текущем объекте.
	Если Не КП_ОбщегоНазначенияКупорос.ЕстьИзмененияРеквизитовОбъекта(Данные, СсылкаНаПользователя, СписокПолейСравнения) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновляем, т.к. есть изменения.
	ОбъектДанных = СсылкаНаПользователя.ПолучитьОбъект();	
	
	ЗаписатьПользователяТекущейИС(Данные, ОбъектДанных);
	
	// логирование
	ТекстИнформации = СтрШаблон(НСтр("ru = 'Обновлен %1 по учетной записи %2, т.к. есть изменения по ключевым полям сравнения.'"), 
		СсылкаНаПользователя, Данные.УчетнаяЗаписьWindows); 
	ОбщегоНазначения.СообщитьПользователю(ТекстИнформации);
	
	КП_ОбщегоНазначенияКупорос.ЗаписьЖурналаРегистрацииРасширенная("КП_ВнешнееУправлениеДоступом.ОбновитьПользователяТекущейИС", 
		ТекстИнформации, 
		УровеньЖурналаРегистрации.Информация);
	
КонецПроцедуры 

Процедура ЗаписатьПользователяТекущейИС(Данные, ОбъектДанных)
	
	ОбъектДанных.ТребуетсяОбновлениеПользователя = Истина;
	
	ЗаполнитьЗначенияСвойств(ОбъектДанных, Данные);
	
	ОбъектДанных.Записать();

КонецПроцедуры 

// Актуализация пользователей текущей ИС
//
// Параметры:
//  ТаблицаАктуальныхПользователей	 - ТаблицаЗначений - см. описание возвращаемого значения КП_ОбменДаннымиКупорос.ЗагрузкаАктуальныхПользователейИзКупорос() 
//
Процедура АктуализироватьПользователейТекущейИС(ТаблицаАктуальныхПользователей)
	
	Для каждого ТекСтрока Из ТаблицаАктуальныхПользователей Цикл
		
		АктуализироватьПользователяТекущейИС(ТекСтрока);	   
		
	КонецЦикла;

КонецПроцедуры 

// Возвращает ссылку на справочник КП_ПользователиТекущейИС 
//
// Параметры:
//  ИД_Купорос - Строка - УИД строка в 36 символов
// 
// Возвращаемое значение:
//  СправочникСсылка.КП_ПользователиТекущейИС - Ссылка
//
Функция НайтиПользователяТекущейИСПоИД(ИД_Купорос)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КП_ПользователиТекущейИС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КП_ПользователиТекущейИС КАК КП_ПользователиТекущейИС
	|ГДЕ
	|	КП_ПользователиТекущейИС.ИД_Купорос = &ИД_Купорос";
	
	Запрос.УстановитьПараметр("ИД_Купорос", ИД_Купорос);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Возврат Выборка.Ссылка;	
	
	КонецЕсли;
	
	Возврат Справочники.КП_ПользователиТекущейИС.ПустаяСсылка();
	
КонецФункции 

// Актуализировать строку по пользователю текущей ИС
//
// Параметры:
//  Данные - СтрокаТаблицыЗначений - см. описание возвращаемого значения КП_ОбменДаннымиКупорос.ЗагрузкаАктуальныхПользователейИзКупорос()
//
Процедура АктуализироватьПользователяТекущейИС(Данные)
	
	 СсылкаНаПользователя = НайтиПользователяТекущейИСПоИД(Данные.ИД_Купорос); 
	 
	 Если ЗначениеЗаполнено(СсылкаНаПользователя) Тогда
		 
		ОбновитьПользователяТекущейИС(Данные, СсылкаНаПользователя);	 
		
	 Иначе
		 
		ОбъектДанных = Справочники.КП_ПользователиТекущейИС.СоздатьЭлемент();
		ЗаписатьПользователяТекущейИС(Данные, ОбъектДанных);
		
	 КонецЕсли;
	 
КонецПроцедуры 

// Определяет отключенных пользователей текущей ИС и фиксирует в справочнике КП_ПользователиТекущейИС
//
// Параметры:
//  ТаблицаАктуальныхПользователей	 - ТаблицаЗначений - см. описание возвращаемого значения КП_ОбменДаннымиКупорос.ЗагрузкаАктуальныхПользователейИзКупорос() 
//
Процедура ОпределениеОтключенныхПользователейТекущейИС(ТаблицаАктуальныхПользователей)

	 ТаблицаАктуальныхПользователей.Индексы.Добавить("УчетнаяЗаписьWindows");
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	КП_ПользователиТекущейИС.Ссылка КАК Ссылка,
	                |	КП_ПользователиТекущейИС.УчетнаяЗаписьWindows КАК УчетнаяЗаписьWindows
	                |ИЗ
	                |	Справочник.КП_ПользователиТекущейИС КАК КП_ПользователиТекущейИС
	                |ГДЕ
	                |	НЕ КП_ПользователиТекущейИС.ПометкаУдаления
	                |	И НЕ КП_ПользователиТекущейИС.Недействителен";
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 
		 СтруктураОтбора = Новый Структура;
		 СтруктураОтбора.Вставить("УчетнаяЗаписьWindows", Выборка.УчетнаяЗаписьWindows); 
		 НайденныеПользователи = ТаблицаАктуальныхПользователей.НайтиСтроки(СтруктураОтбора);   
		 
		 Если НайденныеПользователи.Количество() = 1 Тогда
			 // Найден в актуальных, отключать не нужно.
			 Продолжить;
		 КонецЕсли;
		 
		 Если НайденныеПользователи.Количество() > 1 Тогда
			 // Найдено несколько дублей. Необходимо провести анализ администратору.
			 ТекстИнформации = СтрШаблон(НСтр("ru = 'Есть дубли по учетной записи %1 в 1С Купорос по группе AD. Необходимо провести корректировку.'"), 
			 	Выборка.УчетнаяЗаписьWindows); 
			 ОбщегоНазначения.СообщитьПользователю(ТекстИнформации);
			 
			 КП_ОбщегоНазначенияКупорос.ЗаписьЖурналаРегистрацииРасширенная("КП_ВнешнееУправлениеДоступом.ОпределениеОтключенныхПользователейТекущейИС", 
			 		ТекстИнформации, 
			 		УровеньЖурналаРегистрации.Ошибка);
					
			 Прервать;
			 
		 КонецЕсли;
		 
		 // Устанавливаем признак "Недействителен", т.к. не найден в актуальной группе доступа для этой системы.
		 ОбъектДанных = Выборка.Ссылка.ПолучитьОбъект();
		 Данные = Новый Структура;
		 Данные.Вставить("Недействителен", Истина);
		 ЗаписатьПользователяТекущейИС(Данные, ОбъектДанных);
		 
		 ТекстИнформации = СтрШаблон(НСтр("ru = 'Перевод в недействительные %1 по учетной записи %2.'"), Выборка.Ссылка, Выборка.УчетнаяЗаписьWindows); 
		 ОбщегоНазначения.СообщитьПользователю(ТекстИнформации);
		 
		 КП_ОбщегоНазначенияКупорос.ЗаписьЖурналаРегистрацииРасширенная("КП_ВнешнееУправлениеДоступом.ОпределениеОтключенныхПользователейТекущейИС", 
		 		ТекстИнформации, 
		 		УровеньЖурналаРегистрации.Информация);
				
	 КонецЦикла;

КонецПроцедуры 

#КонецОбласти

#Область ОбновлениеПользователей

// Основная функция, которая создает/обновляет пользователя в текущей информационной базе 1С
//	Администраторов не изменяет.
//
// Параметры:
//  ТехническийПользовательОбмена  - СправочникСсылка.КП_ПользователиТекущейИС - пользователь на основе которого формируется пользователь ИБ
//  УжеНайденныйПользователь  - СправочникСсылка.Пользователи - не обязательный параметр. Пользователь текущий уже ранее найденный.
//  ГруппаДоступа  - СправочникСсылка.ГруппыДоступа - не обязательный параметр. Группа доступа, в которую необходимо добавить нового пользователя
//  ТолькоИнформация  - Булево - не обязательный параметр. Только информация без изменения данных
//
// Возвращаемое значение:
//   Структура - содержит свойства: 
//		* Пользователь - СправочникСсылка.Пользователи - ссылка на найденного пользователя
//		* СозданНовыйПользователь - Булево - создан в СправочникСсылка.Пользователи
//		* ОбновленПользователь - Булево - обновлен в СправочникСсылка.Пользователи
//		* СозданНовыйПользовательИБ - Булево - создан в ПользователиИнформационнойБазы
//		* ОбновленПользовательИБ - Булево - обновлен в ПользователиИнформационнойБазы
//		* Комментарий - Строка - информация о деталях/ошибках
//
Функция СоздатьНовогоПользователяИБ(ТехническийПользовательОбмена, УжеНайденныйПользователь = "", ГруппаДоступа = "", ТолькоИнформация = Ложь)

	УстановитьПривилегированныйРежим(Истина);

	РезультатСоздания = Новый Структура;
	РезультатСоздания.Вставить("Пользователь", Справочники.Пользователи.ПустаяСсылка());
	РезультатСоздания.Вставить("СозданНовыйПользователь", Ложь);
	РезультатСоздания.Вставить("ОбновленПользователь", Ложь);
	РезультатСоздания.Вставить("СозданНовыйПользовательИБ", Ложь);
	РезультатСоздания.Вставить("ОбновленПользовательИБ", Ложь);
	РезультатСоздания.Вставить("Комментарий", "-");
	
	
	// - Поиск в справочнике Пользователи.
	ПользовательСправочника = ?(ЗначениеЗаполнено(УжеНайденныйПользователь), УжеНайденныйПользователь, Справочники.Пользователи.ПустаяСсылка());
	
	Если Не ПользовательСправочника.Пустая() Тогда
		// Определяем полные данные по найденному в Пользователе.
		ПараметрыПоиска = Новый Структура("Пользователь", ПользовательСправочника);
		РезультатПоиска = НайтиПользователя(ПараметрыПоиска); 
	КонецЕсли;
	
	Если ПользовательСправочника.Пустая() Тогда
		ПараметрыПоиска = Новый Структура("Email", ТехническийПользовательОбмена.Email);
		РезультатПоиска = НайтиПользователя(ПараметрыПоиска);
		ПользовательСправочника = РезультатПоиска.Пользователь;
	КонецЕсли;
	
	Если ПользовательСправочника.Пустая() Тогда
		// Поиск по Наименование + ПользовательОС
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Наименование", ТехническийПользовательОбмена.Наименование);
		ПараметрыПоиска.Вставить("ПользовательОС", ТехническийПользовательОбмена.ПользовательОС);
		
		РезультатПоиска = НайтиПользователя(ПараметрыПоиска);
		ПользовательСправочника = РезультатПоиска.Пользователь;
	КонецЕсли;
	
	РезультатСоздания.Пользователь = ПользовательСправочника; 
	
	Если Не ПользовательСправочника.Пустая()
		И ПользовательАдминистратор(ПользовательСправочника) Тогда
		// Администраторов не изменяем.
		РезультатСоздания.Комментарий = НСтр("ru = 'Пользователь администратор. Не изменяем.'");
		
		Возврат РезультатСоздания;
	КонецЕсли;
	
	ЭтотПользовательИсключенИзОбработки = ПользовательВСпискеИсключений(ПользовательСправочника);
	Если Не ПользовательСправочника.Пустая()
		И ЭтотПользовательИсключенИзОбработки Тогда
		// Пользователь в списке исключений, не изменяем.
		РезультатСоздания.Комментарий = НСтр("ru = 'Пользователь в списке исключений. Не изменяем.'");
		
		Возврат РезультатСоздания;
	КонецЕсли;
	
	// - Поиск пользователя ИБ по идентификатору.
	Если Не ПользовательСправочника.Пустая() Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
			ПользовательСправочника["ИдентификаторПользователяИБ"]);	
	КонецЕсли;
	
	// - Параметры текущего пользователя по справочнику Пользователи и Пользователи ИБ
	ДанныеТекущегоПользователя = ПараметрыЗаполненияТекущегоПользователя();	
	ДанныеТекущегоПользователя.СправочникПользователи_Ссылка = ПользовательСправочника;
	ДанныеТекущегоПользователя.СправочникПользователи_Email = РезультатПоиска.Email;
	ДанныеТекущегоПользователя.ПользовательИБ = ПользовательИБ;
	
	// - Проверка на наличие отличий Данных текущего пользователя от Технического пользователя из обмена.
	ДанныеПоИзменениямПользователяИБ = НаличиеОтличийДанныхТекущегоПользователя(ДанныеТекущегоПользователя, ТехническийПользовательОбмена);
	
	Если ДанныеПоИзменениямПользователяИБ.ПользовательИБСуществует 
		И Не ДанныеПоИзменениямПользователяИБ.ЕстьИзменения Тогда
	    // Прерываем функцию, т.к. пользователь уже существует и по нему нет изменений.
		
		РезультатСоздания.Комментарий = НСтр("ru = 'Пользователь уже существует и по нему нет изменений.'");
	
		Возврат РезультатСоздания;
	
	КонецЕсли;
	
	// - Создание/обновление пользователя ИБ.
	ДанныеНовогоПользователяИБ = СозданиеПользователяИБ(ПользовательИБ, ТехническийПользовательОбмена, ТолькоИнформация);
	
	ПользовательИБ = ДанныеНовогоПользователяИБ.ПользовательИБ;	
	Пользователь = ДанныеНовогоПользователяИБ.СвязанныйСправочникПользователи_Ссылка;
	
	РезультатСоздания.СозданНовыйПользовательИБ = ДанныеНовогоПользователяИБ.СозданНовый;
	РезультатСоздания.ОбновленПользовательИБ = ДанныеНовогоПользователяИБ.ОбновленСуществующий;
	
	// - Создание/обновление пользователя в справочнике Пользователи. 
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Справочники.Пользователи.СоздатьЭлемент();
		РезультатСоздания.СозданНовыйПользователь = Истина;	
	Иначе
		Пользователь = Пользователь.ПолучитьОбъект();
		Пользователь.Недействителен = Ложь;
	КонецЕсли;
	
	Пользователь.Наименование = ПользовательИБ.ПолноеИмя;
	
	ОписаниеПользователяИБ = Новый Структура;
	ОписаниеПользователяИБ.Вставить("Действие", "Записать");
	ОписаниеПользователяИБ.Вставить(
		"УникальныйИдентификатор", ПользовательИБ.УникальныйИдентификатор);
	
	Пользователь.ДополнительныеСвойства.Вставить(
		"ОписаниеПользователяИБ", ОписаниеПользователяИБ);
		
	// Заполнение контактной информации.
	Пользователь.КонтактнаяИнформация.Очистить();
	
	// добавление email
	ДобавитьEmailПользователя(Пользователь, ТехническийПользовательОбмена.Email);
	
	ОписаниеДляЖурналаРегистрации = НСтр("ru = 'Администрирование.УправлениеСетью.СоздатьНовогоПользователяИБ'"); 
	
	Попытка
		
		ЗаписатьОбъектЕслиНеТолькоИнформация(Пользователь, ТолькоИнформация);
		
		// логирование успешного результата записи
		Если ДанныеПоИзменениямПользователяИБ.ЕстьИзменения Тогда
			ДействиеТекст = СтрШаблон(НСтр("ru = 'Обновлен (реквизиты: %1)'"), ДанныеПоИзменениямПользователяИБ.ИзмененныеРеквизиты);	
			РезультатСоздания.ОбновленПользователь = Истина;	
		ИначеЕсли РезультатСоздания.СозданНовыйПользователь Тогда 
			ДействиеТекст = НСтр("ru = 'Создан'");
		Иначе
			ДействиеТекст = НСтр("ru = 'Перезаписан'");
			РезультатСоздания.ОбновленПользователь = Истина;	
		КонецЕсли;
		
		ТекстИнформации = СтрШаблон(НСтр("ru = '%1 %2 по учетной записи %3.'"), 
			ДействиеТекст, ТехническийПользовательОбмена.Наименование, ТехническийПользовательОбмена.УчетнаяЗаписьWindows); 
			
		ОбщегоНазначения.СообщитьПользователю(ТекстИнформации);
		
		КП_ОбщегоНазначенияКупорос.ЗаписьЖурналаРегистрацииРасширенная(ОписаниеДляЖурналаРегистрации, 
				ТекстИнформации, 
				УровеньЖурналаРегистрации.Информация);
				
		// уведомление через чат-бота
		КП_УправлениеБотомVKTeams.ОтправитьСообщениеВГруппуУправлениеДоступомПользователей(ТекстИнформации);	
		
		РезультатСоздания.Комментарий  = ТекстИнформации;
		РезультатСоздания.Пользователь = Пользователь.Ссылка; 
		
	Исключение
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка при попытке записи пользователя %1'"), Пользователь.Ссылка);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		
		КП_ОбщегоНазначенияКупорос.ЗаписьЖурналаРегистрацииРасширенная(ОписаниеДляЖурналаРегистрации, 
				ТекстОшибки, 
				УровеньЖурналаРегистрации.Ошибка,
				Истина);
				
		// уведомление через чат-бота
		КП_УправлениеБотомVKTeams.ОтправитьСообщениеВГруппуУправлениеДоступомПользователей(ТекстОшибки);	
		
		РезультатСоздания.СозданНовыйПользователь = Ложь;
		РезультатСоздания.ОбновленПользователь = Ложь;
		РезультатСоздания.Комментарий  = ТекстОшибки;
				
	КонецПопытки;
	
	// - Добавление в группу доступа.
	Если ЗначениеЗаполнено(ГруппаДоступа) Тогда
		
		ОбъектГруппаДоступа = ГруппаДоступа.ПолучитьОбъект();
		СтрокаПользователей = ОбъектГруппаДоступа.Пользователи.Добавить();
		СтрокаПользователей.Пользователь = Пользователь.Ссылка;

		ЗаписатьОбъектЕслиНеТолькоИнформация(ОбъектГруппаДоступа, ТолькоИнформация);
		
	КонецЕсли;
	
	// - Обновление ролей доступа.
	Если Не ТолькоИнформация Тогда
	
		ПользователиДляОбновления = Новый Массив;
		ПользователиДляОбновления.Добавить(Пользователь.Ссылка);
		
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ОбновитьРолиПользователей(ПользователиДляОбновления);
	
	КонецЕсли;
	
	Возврат РезультатСоздания;
	
КонецФункции

// Процедура отключает пользователя спр. КП_ПользователиТекущейИС от текущей информационной базы 1С
//
// Параметры:
//  ПользовательДанных	 - 	 - СправочникСсылка.КП_ПользователиТекущейИС
//  ТолькоИнформация	 - Булево - Если Истина, то формирует только информацию без отключения
// 
// Возвращаемое значение:
//  Структура - содержит свойства:
//		* Пользователь - СправочникСсылка.Пользователи
//		* Отключен - Булево
//		* Комментарий - Строка
//
Функция ОтключитьПользователяТекущейИС(ПользовательДанных, ТолькоИнформация = Ложь)

	// идентификация пользователя
	РеквизитыПользовательДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПользовательДанных, 
		"Пользователь, Наименование, ПользовательОС, УчетнаяЗаписьWindows");
	Если ЗначениеЗаполнено(РеквизитыПользовательДанных.Пользователь) Тогда
		ПользовательСсылка = РеквизитыПользовательДанных.Пользователь;
	Иначе	
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Наименование", РеквизитыПользовательДанных.Наименование);
		ПараметрыПоиска.Вставить("ПользовательОС", РеквизитыПользовательДанных.ПользовательОС);
		РезультатПоиска = НайтиПользователя(ПараметрыПоиска);
		ПользовательСсылка = РезультатПоиска.Пользователь;
	КонецЕсли;
	
	// выполнение отключения
	РезультатОтключения = ОтключитьПользователяИБ(ПользовательСсылка, ТолькоИнформация);
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Результат отключения %3: %1. %2'"), 
		Формат(РезультатОтключения.Отключен, "БЛ='Не отключен'; БИ=Отключен"), 
		РезультатОтключения.Комментарий,
		ПользовательСсылка);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
	Если РезультатОтключения.Отключен Тогда
		ТекстИнформации = СтрШаблон(НСтр("ru = 'Отключен %1 по учетной записи %2.'"), 
			ПользовательСсылка, РеквизитыПользовательДанных.УчетнаяЗаписьWindows); 
		КП_УправлениеБотомVKTeams.ОтправитьСообщениеВГруппуУправлениеДоступомПользователей(ТекстИнформации);	
	КонецЕсли;
	
	РезультатОтключения.Вставить("Пользователь", ПользовательСсылка);
	
	Возврат РезультатОтключения;
	
КонецФункции

// Отключить пользователя ИБ
//
// Параметры:
//  ПользовательСсылка	 - СправочникСсылка.Пользователи
//  ТолькоИнформация	 - Булево	 - Если Истина, то формирует только информацию без отключения
// 
// Возвращаемое значение:
//  Структура - содержит свойства:
//		* Отключен - Булево
//		* Комментарий - Строка
//
Функция ОтключитьПользователяИБ(ПользовательСсылка, ТолькоИнформация = Ложь)
	
	РезультатОтключения = Новый Структура;
	РезультатОтключения.Вставить("Отключен", Ложь);
	РезультатОтключения.Вставить("Комментарий", "");
	
	Если ПользовательСсылка.Пустая() Тогда
		Возврат РезультатОтключения;
	КонецЕсли;
	
	Если ПользовательАдминистратор(ПользовательСсылка) Тогда
		// не делать недействительным администратора
		РезультатОтключения.Отключен = Ложь;
		РезультатОтключения.Комментарий = НСтр("ru = 'Пользователь является администратором.'");
		Возврат РезультатОтключения;
	КонецЕсли;
	
	//РеквизитыПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПользовательСсылка, "Наименование, Недействителен, КП_ТехническийПользователь");
	РеквизитыПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПользовательСсылка, "Наименование, Недействителен");
	
	Если РеквизитыПользователя.Наименование = НСтр("ru = '<Не указан>'") Тогда
		РезультатОтключения.Отключен = Ложь;
		РезультатОтключения.Комментарий = НСтр("ru = 'Это служебный пользователь, который не предназначен для отключения.'");
		Возврат РезультатОтключения;
	КонецЕсли;
	
	ЭтотПользовательИсключенИзОбработки = ПользовательВСпискеИсключений(ПользовательСсылка);
	Если ЭтотПользовательИсключенИзОбработки Тогда
		РезультатОтключения.Отключен = Ложь;
		РезультатОтключения.Комментарий = НСтр("ru = 'Это пользователь (установлен ранее вручную) и не предназначен для отключения.'");
		Возврат РезультатОтключения;
	КонецЕсли;
	
	Если РеквизитыПользователя.Недействителен = Истина Тогда
		// уже был ранее отключен
		РезультатОтключения.Отключен = Ложь;
		РезультатОтключения.Комментарий = НСтр("ru = 'Уже был ранее отключен.'");
		Возврат РезультатОтключения;
	КонецЕсли;
	
	Если ТолькоИнформация Тогда
		РезультатОтключения.Отключен = Истина;
		РезультатОтключения.Комментарий = НСтр("ru = 'Будет отключен, сейчас в режиме ""Только информация"".'");
		Возврат РезультатОтключения;
	КонецЕсли;
	
	ОбъектПользователь = ПользовательСсылка.ПолучитьОбъект();
	ОбъектПользователь.Недействителен = Истина;
	Попытка
	 	ОбъектПользователь.Записать();
		РезультатОтключения.Отключен = Истина;
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка при попытке отключения пользователя %1'"), ПользовательСсылка);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		
		КП_ОбщегоНазначенияКупорос.ЗаписьЖурналаРегистрацииРасширенная("Администрирование.УправлениеСетью.ОтключитьПользователяИБ", 
				ТекстОшибки, 
				УровеньЖурналаРегистрации.Ошибка,
				Истина);
		РезультатОтключения.Отключен = Ложь;
		РезультатОтключения.Комментарий = ТекстОшибки;
	КонецПопытки;
	
	Возврат РезультатОтключения;
	
КонецФункции 

// Поиск пользователя в справочнике Пользователи по параметрам
//
// Параметры:
//  ПараметрыПоиска	 - Структура - варианты ключей: Email, Наименование, Пользователь
// 
// Возвращаемое значение:
//  Структура - найденный пользователь с Email. Если не найден, то пустая ссылка. Содержит свойства:
//		* Пользователь - СправочникСсылка.Пользователи - Пользователь
//		* Email - Строка - емайл
//
Функция НайтиПользователя(ПараметрыПоиска) Экспорт
	
	РезультатПоиска = Новый Структура;
	РезультатПоиска.Вставить("Пользователь", Справочники.Пользователи.ПустаяСсылка());
	РезультатПоиска.Вставить("Email", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	Пользователи.Ссылка КАК Ссылка,
	               |	ЕСТЬNULL(ПользователиКонтактнаяИнформация.АдресЭП, """") КАК Email,
	               |	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	               |		ПО (ПользователиКонтактнаяИнформация.Ссылка = Пользователи.Ссылка)
	               |			И (ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя))
	               |ГДЕ
	               |	ИСТИНА";
	
	Если ПараметрыПоиска.Свойство("Email") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА", "ИСТИНА И ПользователиКонтактнаяИнформация.АдресЭП = &АдресЭП");
		Запрос.УстановитьПараметр("АдресЭП", ПараметрыПоиска.Email);
		
	ИначеЕсли ПараметрыПоиска.Свойство("Наименование") Тогда
		
		// { Каратаев Олег (3Logic) - 16.07.2024
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА", "ИСТИНА И Пользователи.Наименование ПОДОБНО &Наименование + ""%"" ");
		//--1С--
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА", "ИСТИНА И Пользователи.Наименование = &Наименование");
		// }
		Запрос.УстановитьПараметр("Наименование", ПараметрыПоиска.Наименование);
		
	ИначеЕсли ПараметрыПоиска.Свойство("Пользователь") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА", "ИСТИНА И Пользователи.Ссылка = &Пользователь");
		Запрос.УстановитьПараметр("Пользователь", ПараметрыПоиска.Пользователь);
		
	Иначе
		
		Возврат РезультатПоиска;
		
	КонецЕсли;	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// опция варианта поиска только по Наименованию, без ПользовательОС
	ИспользоватьДопВариантПоискаПоФИО = РегистрыСведений.КП_ПараметрыСистемыУправленияДоступомПользователей.ЗначениеПараметра("ИспользоватьДопВариантПоискаПоФИО");
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ИспользоватьДопВариантПоискаПоФИО
			И ПараметрыПоиска.Свойство("Наименование") 
			И ПараметрыПоиска.Свойство("ПользовательОС") Тогда
			// Если найден по наименованию: сравнивать по ПользовательОС из ПользовательИБ.
			
			Если Выборка.ИдентификаторПользователяИБ = ПустойУникальныйИдентификатор() Тогда
				Продолжить;	
			КонецЕсли; 
			
			Если Не ЗначениеЗаполнено(ПараметрыПоиска.ПользовательОС) Тогда
				Продолжить;
			КонецЕсли;
			
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
				Выборка.ИдентификаторПользователяИБ);	
				
			Если ВРЕГ(ПользовательИБ.ПользовательОС) <> ВРЕГ(ПараметрыПоиска.ПользовательОС) Тогда
				// не равны учетные записи.
				Продолжить;	
			КонецЕсли;
				
		КонецЕсли;
		
		РезультатПоиска.Пользователь = Выборка.Ссылка;
		РезультатПоиска.Email = Выборка.Email;
	
	КонецЦикла;
	
	Возврат РезультатПоиска;

КонецФункции

// Вычисляет начальное имя для входа по полному имени пользователя.
//
// Параметры:
//  ПолноеИмя	 - Строка 
// 
// Возвращаемое значение:
//  Строка - возвращает из полного ФИО краткое. Например: МухинИВ
//
Функция КраткоеИмяПользователяИБ(Знач ПолноеИмя)
	
	Разделители = Новый Массив;
	Разделители.Добавить(" ");
	Разделители.Добавить(".");
	
	КраткоеИмя = "";
	Для Счетчик = 1 По 3 Цикл
		
		Если Счетчик <> 1 Тогда
			КраткоеИмя = КраткоеИмя + ВРег(Лев(ПолноеИмя, 1));
		КонецЕсли;
		
		ПозицияРазделителя = 0;
		Для каждого Разделитель Из Разделители Цикл
			ПозицияТекущегоРазделителя = СтрНайти(ПолноеИмя, Разделитель);
			Если ПозицияТекущегоРазделителя > 0
			   И (    ПозицияРазделителя = 0
			      ИЛИ ПозицияРазделителя > ПозицияТекущегоРазделителя ) Тогда
				ПозицияРазделителя = ПозицияТекущегоРазделителя;
			КонецЕсли;
		КонецЦикла;
		
		Если ПозицияРазделителя = 0 Тогда
			Если Счетчик = 1 Тогда
				КраткоеИмя = ПолноеИмя;
			КонецЕсли;
			Прервать;
		КонецЕсли;
		
		Если Счетчик = 1 Тогда
			КраткоеИмя = Лев(ПолноеИмя, ПозицияРазделителя - 1);
		КонецЕсли;
		
		ПолноеИмя = Прав(ПолноеИмя, СтрДлина(ПолноеИмя) - ПозицияРазделителя);
		Пока Разделители.Найти(Лев(ПолноеИмя, 1)) <> Неопределено Цикл
			ПолноеИмя = Сред(ПолноеИмя, 2);
		КонецЦикла;
	КонецЦикла;
	
	Возврат КраткоеИмя;
	
КонецФункции

Функция ПараметрыЗаполненияТекущегоПользователя()

	ДанныеТекущегоПользователя = Новый Структура;
	ДанныеТекущегоПользователя.Вставить("СправочникПользователи_Ссылка", Справочники.Пользователи.ПустаяСсылка());
	ДанныеТекущегоПользователя.Вставить("СправочникПользователи_Email", "");
	ДанныеТекущегоПользователя.Вставить("ПользовательИБ", Неопределено);
	
	Возврат ДанныеТекущегоПользователя;

КонецФункции

// Проверка на наличие отличий Данных текущего пользователя от Технического пользователя из обмена
//
// Параметры:
//  ДанныеТекущегоПользователя		 - см. функцию ПараметрыЗаполненияТекущегоПользователя() 
//  ТехническийПользовательОбмена	 - СправочникСсылка.КП_ПользователиТекущейИС
// 
// Возвращаемое значение:
//  Структура - содержит свойства:
//		* ПользовательИБСуществует - Булево
//		* ЕстьИзменения - Булево - флаг изменения
//		* ИзмененныеРеквизиты - Строка - Возвращает список измененных реквизитов
//
Функция НаличиеОтличийДанныхТекущегоПользователя(ДанныеТекущегоПользователя, ТехническийПользовательОбмена)
	
 	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("ПользовательИБСуществует", Ложь);
	РезультатПроверки.Вставить("ЕстьИзменения", Ложь);
	РезультатПроверки.Вставить("ИзмененныеРеквизиты", "");
	
	ПользовательИБ = ДанныеТекущегоПользователя.ПользовательИБ;
	СправочникПользователи_Ссылка = ДанныеТекущегоПользователя.СправочникПользователи_Ссылка;
	
	ЕстьИзменения = Ложь;
	ИзмененныеРеквизиты = "";
	Если ПользовательИБ = Неопределено Тогда
		Возврат РезультатПроверки;	
	КонецЕсли;
		
	РезультатПроверки.ПользовательИБСуществует = Истина;
		
	ПользовательИБДляСравнения = Новый Структура;
	ПользовательИБДляСравнения.Вставить("Наименование",   ПользовательИБ.ПолноеИмя);
	ПользовательИБДляСравнения.Вставить("ПользовательОС", ПользовательИБ.ПользовательОС);
	ПользовательИБДляСравнения.Вставить("Email", 		  ДанныеТекущегоПользователя.СправочникПользователи_Email);
	ПользовательИБДляСравнения.Вставить("Недействителен", СправочникПользователи_Ссылка.Недействителен);
	
	СписокПолейСравнения = Новый Массив;
	СписокПолейСравнения.Добавить("Наименование");
	СписокПолейСравнения.Добавить("ПользовательОС");
	СписокПолейСравнения.Добавить("Недействителен");
	СписокПолейСравнения.Добавить("Email");
	
	ЕстьИзменения = КП_ОбщегоНазначенияКупорос.ЕстьИзмененияРеквизитовОбъекта(ПользовательИБДляСравнения, 
		ТехническийПользовательОбмена, СписокПолейСравнения,, ИзмененныеРеквизиты); 
	
	Если Не ЕстьИзменения Тогда
		// Доп. проверка на заполненность АутентификацияОС и АутентификацияOpenIDConnect.
		// В случае если не заполнено, то необходимо перезаполнить.
		Если Не ПользовательИБ.АутентификацияОС Тогда
		    ЕстьИзменения = Истина;
			ИзмененныеРеквизиты = КП_ОбщегоНазначенияКупорос.СтрокаИзмененныхРеквизитов(ИзмененныеРеквизиты, "АутентификацияОС", Ложь, Истина);
		КонецЕсли;	
		Если Не ПользовательИБ.АутентификацияOpenIDConnect Тогда
		    ЕстьИзменения = Истина;
			ИзмененныеРеквизиты = КП_ОбщегоНазначенияКупорос.СтрокаИзмененныхРеквизитов(ИзмененныеРеквизиты, "АутентификацияOpenIDConnect", Ложь, Истина);
		КонецЕсли;	
	КонецЕсли;	
	
	РезультатПроверки.ЕстьИзменения = ЕстьИзменения;
	РезультатПроверки.ИзмененныеРеквизиты = ИзмененныеРеквизиты;
	
	Возврат РезультатПроверки;

КонецФункции

// Создание пользователя ИБ
//
// Параметры:
//  ПользовательИБ					 - ПользователиИнформационнойБазы
//									 - Неопределено
//  ТехническийПользовательОбмена	 - СправочникСсылка.КП_ПользователиТекущейИС
//  ТолькоИнформация	 - Булево	 - Если Истина, то формирует только информацию
// 
// Возвращаемое значение:
//  Структура - содержит свойства:
//		* ПользовательИБ - ПользователиИнформационнойБазы
//		* СозданНовый - Булево
//		* ОбновленСуществующий - Булево
//		* СвязанныйСправочникПользователи_Ссылка - СправочникСсылка.Пользователи
//
Функция СозданиеПользователяИБ(ПользовательИБ, ТехническийПользовательОбмена, ТолькоИнформация = Ложь)
	
	РезультатПользовательИБ = Новый Структура;
	РезультатПользовательИБ.Вставить("ПользовательИБ", ПользовательИБ);
	РезультатПользовательИБ.Вставить("СозданНовый", Ложь);
	РезультатПользовательИБ.Вставить("ОбновленСуществующий", Ложь);
	РезультатПользовательИБ.Вставить("СвязанныйСправочникПользователи_Ссылка", Справочники.Пользователи.ПустаяСсылка());
	
	СозданНовый = Ложь;
	ОбновленСуществующий = Ложь;
	
	Если ПользовательИБ = Неопределено Тогда
		// Создаем нового пользователя, т.к. не был найден.
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		
		КраткоеИмя = КраткоеИмяПользователяИБ(ТехническийПользовательОбмена.Наименование);
		ПользовательБазыИмя = КраткоеИмя;
		Индекс = 0;
		
		Пока ПользователиИнформационнойБазы.НайтиПоИмени(ПользовательБазыИмя) <> Неопределено Цикл
			Индекс = Индекс + 1;
			ПользовательБазыИмя = КраткоеИмя + Формат(Индекс, "ЧГ=");
		КонецЦикла;
		
		ПользовательИБ.Имя       = ПользовательБазыИмя;
		
		СозданНовый = Истина;
		
		ПользовательИБ.АутентификацияСтандартная = Ложь;
		
	Иначе
		
		ОбновленСуществующий = Истина;	
		
	КонецЕсли;
	
	// у всех отключаем показ в списке выбора
	ПользовательИБ.ПоказыватьВСпискеВыбора	 = Ложь;
	
	ПользовательИБ.ПолноеИмя = ТехническийПользовательОбмена.Наименование;
	Если ЗначениеЗаполнено(ТехническийПользовательОбмена.ПользовательОС) Тогда
		ПользовательИБ.ПользовательОС 	= ТехническийПользовательОбмена.ПользовательОС;
	КонецЕсли;
	
	ВерсияПлатформыНовая = КП_ОбщегоНазначенияКупорос.ВерсияПлатформыВышеИлиРавна("8.3.18.1616");
	Если ВерсияПлатформыНовая Тогда
		// Проверено, что с 8.3.18 отрабатывает запись в АдресЭлектроннойПочты, даже если режим совместимости 8.3.10
		УстановитьБезопасныйРежим(Истина);

		Выполнить("ПользовательИБ.АдресЭлектроннойПочты = ТехническийПользовательОбмена.Email;");  // почта используется для восстановления пароля
		
		УстановитьБезопасныйРежим(Ложь);

	КонецЕсли;

	ПользовательИБ.Роли.Очистить();
	//ПользовательИБ.Записать();  // * Убрать
	
	Если ЗначениеЗаполнено(ТехническийПользовательОбмена.УчетнаяЗаписьWindows) Тогда
		
		ПользовательИБ.АутентификацияОС = Истина;
		ПользовательИБ.АутентификацияOpenIDConnect = Истина;
		
		Попытка
			
			ЗаписатьОбъектЕслиНеТолькоИнформация(ПользовательИБ, ТолькоИнформация);
		
			// фиксация результата
			РезультатПользовательИБ.ПользовательИБ = ПользовательИБ;
			РезультатПользовательИБ.СозданНовый = СозданНовый;
			РезультатПользовательИБ.ОбновленСуществующий = ОбновленСуществующий;
			
		Исключение
			
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка работы системы при записи пользователя ИБ %1 с именем %2'"), 
				ТехническийПользовательОбмена.Наименование, ПользовательИБ.Имя);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			
			КП_ОбщегоНазначенияКупорос.ЗаписьЖурналаРегистрацииРасширенная("Администрирование.УправлениеСетью.СоздатьНовогоПользователяИБ", 
				ТекстОшибки, 
				УровеньЖурналаРегистрации.Ошибка,
				Истина);
				
			Если СозданНовый Тогда
				ТекстОшибки = СтрШаблон(НСтр("ru = '%1. 
                                              |Скорей всего пользователь уже существует с указанным именем. 
                                              |Необходимо найти и скорректировать поисковые поля у существующего пользователя 
                                              |(email, наименование, пользователь ОС).'"), ТекстОшибки);
				
				КП_УправлениеБотомVKTeams.ОтправитьСообщениеВГруппуУправлениеДоступомПользователей(ТекстОшибки);	
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
				
			Возврат РезультатПользовательИБ;
				
		КонецПопытки;
		
	КонецЕсли;
	
	// Идентификация пользователя в спр.Пользователи относительно идентификатора пользователя ИБ.
	Если ПользовательИБ.УникальныйИдентификатор = ПустойУникальныйИдентификатор() Тогда
		// возможно при параметре ТолькоИнформация = Истина
		Пользователь = Справочники.Пользователи.ПустаяСсылка();
	Иначе
		Пользователь = Справочники.Пользователи.НайтиПоРеквизиту(
			"ИдентификаторПользователяИБ", ПользовательИБ.УникальныйИдентификатор);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Пользователь)
		И ЗначениеЗаполнено(ТехническийПользовательОбмена.Пользователь) Тогда
		// Если ранее уже был определен в техническом справочнике, то используем.
		Пользователь = ТехническийПользовательОбмена.Пользователь; 
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Наименование", ПользовательИБ.ПолноеИмя);
		ПараметрыПоиска.Вставить("ПользовательОС", ПользовательИБ.ПользовательОС);
		РезультатПоиска = НайтиПользователя(ПараметрыПоиска);
		Пользователь = РезультатПоиска.Пользователь;
		
		ЕстьЗаполненныйИдентификаторПользователяИБ = ЗначениеЗаполнено(Пользователь)
		   И ЗначениеЗаполнено(Пользователь.ИдентификаторПользователяИБ);
		
		Если ЕстьЗаполненныйИдентификаторПользователяИБ
		   И Пользователь.ИдентификаторПользователяИБ <> ПользовательИБ.УникальныйИдентификатор
		   И ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		         Пользователь.ИдентификаторПользователяИБ) <> Неопределено Тогда
			
			Пользователь = Справочники.Пользователи.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;
	
	РезультатПользовательИБ.СвязанныйСправочникПользователи_Ссылка = Пользователь;	
	
	Возврат РезультатПользовательИБ;

КонецФункции

Процедура ДобавитьEmailПользователя(Пользователь, Email)

	// Добавление email.
	Если Не ЗначениеЗаполнено(Email) Тогда
		Возврат;
	КонецЕсли;
		
	СтрокаКИ = Пользователь.КонтактнаяИнформация.Добавить();
	СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.EmailПользователя;
	СтрокаКИ.Представление = Email;
	СтрокаКИ.АдресЭП = Email;
	Поз = СтрНайти(СтрокаКИ.АдресЭП, "@");
	Если Поз <> 0 Тогда
		СтрокаКИ.ДоменноеИмяСервера = Сред(СтрокаКИ.АдресЭП, Поз + 1);
	КонецЕсли;
	
	// { Каратаев Олег (3Logic) - 23.09.2024 - ITERP1C-2529 
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ОповещатьПоEmail", Метаданные.Справочники.Пользователи) Тогда
		Пользователь["ОповещатьПоEmail"] = Истина;	
	КонецЕсли;
	// }

КонецПроцедуры 

Функция ПрофильАдминистратор() 
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрофилиГруппДоступа.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПрофилиГруппДоступа КАК ПрофилиГруппДоступа
	|ГДЕ
	|	ПрофилиГруппДоступа.ИдентификаторПоставляемыхДанных = &ИдентификаторПоставляемыхДанных
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрофилиГруппДоступа.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПрофилиГруппДоступа КАК ПрофилиГруппДоступа
	|ГДЕ
	|	ПрофилиГруппДоступа.ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Идентификатор = Новый УникальныйИдентификатор(Справочники.ПрофилиГруппДоступа.ИдентификаторПрофиляАдминистратор());
	Запрос.УстановитьПараметр("ИдентификаторПоставляемыхДанных", Идентификатор);
	Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", "Администратор");
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаПоИдентификатору    = РезультатыЗапроса[0].Выбрать();
	ВыборкаПоПредопределенному = РезультатыЗапроса[1].Выбрать();
	
	ЕстьВыборкаЗапроса = ВыборкаПоИдентификатору.Следующий()
		И ВыборкаПоПредопределенному.Следующий()
		И ВыборкаПоИдентификатору.Количество() = 1
		И ВыборкаПоПредопределенному.Количество() = 1; 
	
	Если ЕстьВыборкаЗапроса
		И ВыборкаПоИдентификатору.Ссылка = ВыборкаПоПредопределенному.Ссылка Тогда
		// Найденные данные по идентификатору и имени "Администратор" в профилях равны. 
		Возврат ВыборкаПоИдентификатору.Ссылка;
		
	КонецЕсли;
	
	Возврат Справочники.ПрофилиГруппДоступа.ПустаяСсылка();
	
КонецФункции

Функция ПользовательАдминистратор(Пользователь)
	
	// - Классический БСП от 3.1
	ПрофильАдминистратора = ПрофильАдминистратор(); 
	Если Не ЗначениеЗаполнено(ПрофильАдминистратора) Тогда
		ВызватьИсключение НСтр("ru = 'В расширении не определен профиль администратора. Необходима доработка расширения.'");
	КонецЕсли;

	ПрофилиАдминистраторов = Новый Массив;
	ПрофилиАдминистраторов.Добавить(ПрофильАдминистратора);
	
	МодульГруппыДоступа = ОбщегоНазначения.ОбщийМодуль("Справочники.ГруппыДоступа");
	МассивАдминистраторов = МодульГруппыДоступа.ПользователиДляОбновленияРолейПоПрофилю(ПрофилиАдминистраторов);
	ЭтоАдминистратор =  МассивАдминистраторов.Найти(Пользователь) <> Неопределено;
	
	Возврат ЭтоАдминистратор;
	
КонецФункции

// Возвращает пустой уникальный идентификатор.
//
// Возвращаемое значение:
//  УникальныйИдентификатор - 00000000-0000-0000-0000-000000000000
//
Функция ПустойУникальныйИдентификатор()
	
	Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
КонецФункции

Процедура ЗаписатьОбъектЕслиНеТолькоИнформация(ОбъектЗаписи, ТолькоИнформация = Ложь)
	
	Если ТолькоИнформация Тогда
		Возврат;	
	КонецЕсли;
	
	ОбъектЗаписи.Записать(); 

КонецПроцедуры 

// Возвращает Истина, если Пользователь входит в список исключений
//
// Параметры:
//  ПользовательСсылка	 - СправочникСсылка.Пользователи 
// 
// Возвращаемое значение:
//  Булево - Истина, если Пользователь входит в список исключений 
//
Функция ПользовательВСпискеИсключений(ПользовательСсылка)
	
	Если Не ЗначениеЗаполнено(ПользовательСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КП_ИсключенныеПользователиИзОбработки.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.КП_ИсключенныеПользователиИзОбработки КАК КП_ИсключенныеПользователиИзОбработки
	|ГДЕ
	|	КП_ИсключенныеПользователиИзОбработки.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ПользовательСсылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Возврат Выборка.Следующий();

КонецФункции

#КонецОбласти

#Область ОбновлениеПравПользователя

// Обновить права доступа пользователя по данным технического пользователя обмена
//
// Параметры:
//  ТехническийПользовательОбмена	 - СправочникСсылка.КП_ПользователиТекущейИС 
//  ПользовательСсылка				 - СправочникСсылка.Пользователи
//
Процедура ОбновитьПраваДоступаПользователя(ТехническийПользовательОбмена, ПользовательСсылка)
	
	ТаблицаТекущегоДоступаПользователя = ДанныеПоДоступамПользователя(ПользовательСсылка, Ложь);	
	
	ОбъектПользовательОбмена = ТехническийПользовательОбмена.ПолучитьОбъект();	
	
	// Проверка на наличие пользователя в исключениях.
	ЭтотПользовательИсключенИзОбработки = ПользовательВСпискеИсключений(ПользовательСсылка);
	Если ЭтотПользовательИсключенИзОбработки Тогда
		// Пользователь в списке исключений, права не трогаем.
		ОбъектПользовательОбмена.ТребуетсяОбновлениеПравПользователя = Ложь;
		ОбъектПользовательОбмена.Записать();
		Возврат;	
	КонецЕсли;
	
	// Создание новой таблицы доступа пользователя для сравнения с текущей таблицей доступа. 
	МассивШаблонов = ОбъектПользовательОбмена.ПраваПользователяИзКупорос.ВыгрузитьКолонку("ШаблонДоступа");
	МассивШаблонов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивШаблонов);
	
	РеквизитыШаблонов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивШаблонов, "ПользовательШаблон, Использовать");
	
	МассивПользователейИзШаблонов = Новый Массив;
	Для каждого ТекСтрока Из РеквизитыШаблонов Цикл
	
		Если Не ТекСтрока.Значение["Использовать"] Тогда
			Продолжить;
		КонецЕсли;
		
		МассивПользователейИзШаблонов.Добавить(ТекСтрока.Значение["ПользовательШаблон"]);
	
	КонецЦикла;
	
	ТаблицаНовогоДоступаПользователя = ДанныеПоДоступамПользователя(МассивПользователейИзШаблонов, Ложь);
	
	// Сравнение таблицы текущей с новым доступом на отличия.
	ТаблицаИзменений = КП_ОбщегоНазначенияКупорос.РазницаТаблицЗначений(ТаблицаТекущегоДоступаПользователя, ТаблицаНовогоДоступаПользователя);
	
	Если ТаблицаИзменений.Количество() = 0 Тогда
	    // Отличий нет, обновлять права не требуется.
		ОбъектПользовательОбмена.ТребуетсяОбновлениеПравПользователя = Ложь;
		ОбъектПользовательОбмена.Записать();
		Возврат;	
	КонецЕсли;
	
	// Обновление прав по таблице изменений.
	ЛитералЕстьТолькоВТаблицеТекущей = 0;

	Для каждого ТекИзменение Из ТаблицаИзменений Цикл
		
		ПараметрыПрав = Новый Структура;
		ПараметрыПрав.Вставить("ГруппаДоступа", ТекИзменение.ГруппаДоступа);
		ПараметрыПрав.Вставить("ГруппаПользователя", ТекИзменение.ГруппаПользователя);
	
		Если ТекИзменение.Знак = ЛитералЕстьТолькоВТаблицеТекущей Тогда
			// Удаление прав пользователя.
			УдалитьПраваПользователю(ПользовательСсылка, ПараметрыПрав);
		Иначе
			// Добавление новых прав пользователю.
			ДобавитьПраваПользователю(ПользовательСсылка, ПараметрыПрав);	
			
		КонецЕсли;	
	
	КонецЦикла;	
	
	// Обновление прав по пользователю.
	УправлениеДоступомСлужебный.ОбновитьРолиПользователей(ПользовательСсылка);
	
	ОбъектПользовательОбмена.ТребуетсяОбновлениеПравПользователя = Ложь;
	ОбъектПользовательОбмена.Записать();
	
	// логирование
	СтрокаШаблоныДоступа = ?(ЗначениеЗаполнено(МассивШаблонов), СтрСоединить(МассивШаблонов, Символы.ПС + " - "), "нет шаблонов доступа"); 
    ТекущиеДанныеДоступа = СтрокаОписанияГруппДоступа(ПользовательСсылка);
	ТекущиеДанныеДоступа = ?(ЗначениеЗаполнено(ТекущиеДанныеДоступа), ТекущиеДанныеДоступа, "нет прав");
	
	ТекстИнформации = СтрШаблон(НСтр("ru = 'Обновлены права по шаблонам доступа 
                                      |%1, учетная запись %2. 
                                      |Шаблоны доступа: 
                                      |- %3
                                      |Актуальные права:
                                      |%4'"), 
		ТехническийПользовательОбмена.Наименование, ТехническийПользовательОбмена.УчетнаяЗаписьWindows, СтрокаШаблоныДоступа, ТекущиеДанныеДоступа); 
	
	ОбщегоНазначения.СообщитьПользователю(ТекстИнформации);
	
	КП_ОбщегоНазначенияКупорос.ЗаписьЖурналаРегистрацииРасширенная("Администрирование.УправлениеСетью.ОбновлениеПрав", 
		ТекстИнформации, 
		УровеньЖурналаРегистрации.Информация);
	
	// уведомление через чат-бота
	КП_УправлениеБотомVKTeams.ОтправитьСообщениеВГруппуУправлениеДоступомПользователей(ТекстИнформации);	
	
КонецПроцедуры 

// Добавить единичные права пользователю
//
// Параметры:
//  ПараметрыПрав	 - Структура - содержит свойства (минимум одно должно быть):
//		* ГруппаДоступа - СправочникСсылка.ГруппыДоступа
//		* ГруппаПользователя - СправочникСсылка.ГруппыПользователей - если указано и заполнено, то группа доступа не используется для добавления
//
Процедура ДобавитьПраваПользователю(ПользовательСсылка, ПараметрыПрав)

	ОбработатьПраваПользователя(ПользовательСсылка, ПараметрыПрав, "Добавить");
	
КонецПроцедуры 

// Удалить права пользователю
//
// Параметры:
//  ПараметрыПрав	 - Структура - содержит свойства (минимум одно должно быть):
//		* ГруппаДоступа - СправочникСсылка.ГруппыДоступа
//		* ГруппаПользователя - СправочникСсылка.ГруппыПользователей - если указано и заполнено, то группа доступа не используется
//
Процедура УдалитьПраваПользователю(ПользовательСсылка, ПараметрыПрав)
	
	ОбработатьПраваПользователя(ПользовательСсылка, ПараметрыПрав, "Удалить");

КонецПроцедуры 

Процедура ОбработатьПраваПользователя(ПользовательСсылка, ПараметрыПрав, ТипДействия)

	УдалятьПраваПользователей = РегистрыСведений.КП_ПараметрыСистемыУправленияДоступомПользователей.ЗначениеПараметра("УдалятьПраваПользователей");
	Если ТипДействия = "Удалить"
		И Не УдалятьПраваПользователей Тогда
		Возврат;	
	КонецЕсли;	
	
	Если ПараметрыПрав.Свойство("ГруппаПользователя")
		И ЗначениеЗаполнено(ПараметрыПрав.ГруппаПользователя) Тогда
		// обновление группы пользователя
		
		ГруппаПользователей = ПараметрыПрав.ГруппаПользователя.ПолучитьОбъект();
		
		НайденнаяСтрокаПользователи = ГруппаПользователей.Состав.Найти(ПользовательСсылка, "Пользователь");
		Если Не ТребуетсяОбработкаНайденнойСтрокиПользователя(ТипДействия, НайденнаяСтрокаПользователи) Тогда
			Возврат;
		КонецЕсли;
		
		Если ТипДействия = "Добавить" Тогда
			СтрокаПользователи = ГруппаПользователей.Состав.Добавить();
	        СтрокаПользователи.Пользователь = ПользовательСсылка;
		Иначе
			ГруппаПользователей.Состав.Удалить(НайденнаяСтрокаПользователи);
		КонецЕсли;
		ГруппаПользователей.Записать();
		
	Иначе	
		// обновление группы доступа
		ГруппаДоступа = ПараметрыПрав.ГруппаДоступа.ПолучитьОбъект();
		
		НайденнаяСтрокаПользователи = ГруппаДоступа.Пользователи.Найти(ПользовательСсылка, "Пользователь");
		Если Не ТребуетсяОбработкаНайденнойСтрокиПользователя(ТипДействия, НайденнаяСтрокаПользователи) Тогда
			Возврат;
		КонецЕсли;
		
		Если ТипДействия = "Добавить" Тогда
			СтрокаПользователи = ГруппаДоступа.Пользователи.Добавить();
			СтрокаПользователи.Пользователь = ПользовательСсылка;
		Иначе
			ГруппаДоступа.Пользователи.Удалить(НайденнаяСтрокаПользователи);
		КонецЕсли;
		ГруппаДоступа.Записать();
		
	КонецЕсли;

КонецПроцедуры

Функция ТребуетсяОбработкаНайденнойСтрокиПользователя(ТипДействия, НайденнаяСтрокаПользователи)
	
	Если ТипДействия = "Добавить" 
		И НайденнаяСтрокаПользователи <> Неопределено Тогда
		// уже ранее был добавлен.
		Возврат Ложь;
	КонецЕсли;
	Если ТипДействия = "Удалить" 
		И НайденнаяСтрокаПользователи = Неопределено Тогда
		// уже ранее был удален.
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

#КонецОбласти

#КонецОбласти