#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	Если Ссылка.Актуальность 
		И (Не Актуальность) Тогда
		// Очистка табличной части изменений по умолчанию.
		ИзмененияПоУмолчанию.Очистить();
	КонецЕсли;
	
	Если ДатаДобавления = '00010101' Тогда
		ДатаДобавления = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
