

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображениеКартинки();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	УстановитьРеквизитКартинки(ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбъектДанных = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.ИндексКартинки = Справочники.ВидыНоменклатуры.ПолучитьИндексКартинкиПоФайлуКартинки(ОбъектДанных.ФайлКартинки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьИзНабора(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла",      Объект.Ссылка);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("АдресКартинки", АдресКартинки);
	
	ОткрытьФорму("ОбщаяФорма.ВыборИзображенияИзНабора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьНавигационнуюСсылкуКартинки(ФайлКартинки, ИдентификаторФормы)

	УстановитьПривилегированныйРежим(Истина);
	
	ДвоичныеДанные = ФайлКартинки.Получить();
	Если ТипЗнч(ИдентификаторФормы) = Тип("УникальныйИдентификатор") Тогда
		СсылкаНаДвоичныеДанныеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ИдентификаторФормы);
	Иначе
		СсылкаНаДвоичныеДанныеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	КонецЕсли;
	
	ДополнительнаяИнформация = Новый Структура;
	ДополнительнаяИнформация.Вставить("СсылкаНаДвоичныеДанныеФайла",  СсылкаНаДвоичныеДанныеФайла);
	
	
	Возврат ДополнительнаяИнформация.СсылкаНаДвоичныеДанныеФайла;
	
КонецФункции

&НаСервере
Процедура ОтображениеКартинки()
	
	// Установка значения реквизита АдресКартинки.
	Если Не Объект.Ссылка.Пустая() Тогда
		ОбъектДанных = РеквизитФормыВЗначение("Объект");
		Если ОбъектДанных.ФайлКартинки.Получить() <> Неопределено Тогда
			АдресКартинки = ПолучитьНавигационнуюСсылкуКартинки(ОбъектДанных.ФайлКартинки, УникальныйИдентификатор)
		Иначе
			АдресКартинки = "";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьРеквизитКартинки(ВыбраннаяКартинка) 
	
	ОбъектДанных = РеквизитФормыВЗначение("Объект");
	ОбъектДанных.ФайлКартинки = Новый ХранилищеЗначения(ВыбраннаяКартинка);
	ОбъектДанных.Записать();
	
	ЗначениеВРеквизитФормы(ОбъектДанных,"Объект");	
	
	АдресКартинки = ПолучитьНавигационнуюСсылкуКартинки(ОбъектДанных.ФайлКартинки, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

