
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Запись.Исполнитель.Пустая() Тогда
		Запись.Исполнитель = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Управление доступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// зафиксировать работу по задаче (ручное добавление)
	Если ТекущийОбъект.ОтразитьРаботуПоЗадаче Тогда
		
		ВестиУчетАктовВыполненныхРабот = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Задача, "Проект.ВестиУчетАктовВыполненныхРабот");
		
		Если ВестиУчетАктовВыполненныхРабот Тогда
		
			ДанныеДляФиксацииРабот = Новый Структура;
			ДанныеДляФиксацииРабот.Вставить("Дата", ТекущийОбъект.Период);
			ДанныеДляФиксацииРабот.Вставить("Задача", ТекущийОбъект.Задача);
			ДанныеДляФиксацииРабот.Вставить("Исполнитель", ТекущийОбъект.Исполнитель);
			ДанныеДляФиксацииРабот.Вставить("ФактическаяТрудоемкость", ТекущийОбъект.ЗатраченноеВремя);
			ДанныеДляФиксацииРабот.Вставить("РучноеДобавление", Истина);
			ДанныеДляФиксацииРабот.Вставить("РаботаПоЗадаче", ТекущийОбъект.РаботаПоЗадаче);
			
			Документы.РаботыПоЗадаче.ЗафиксироватьРаботуПоЗадаче(ДанныеДляФиксацииРабот);
			
			ТекущийОбъект.РаботаПоЗадаче = ДанныеДляФиксацииРабот.РаботаПоЗадаче;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Изменение_ФактическиеТрудозатратыЗадачи",,Запись.Задача);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.Период) Тогда
		Запись.Период = КонецДня(Запись.Период);
	КонецЕсли;	
	
КонецПроцедуры

