
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СохранитьНастройкиБота(НакопленныеДанные) Экспорт
	
	Бот = НакопленныеДанные.ДанныеБота.Бот;
	ИдентификаторОбновления = НакопленныеДанные.ИдентификаторОбновления;
	
	Если ТипЗнч(ИдентификаторОбновления) = Тип("Число") Тогда
		МенеджерЗаписи = РегистрыСведений.ТелеграмНастройкиБотов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Бот 		= Бот;
		МенеджерЗаписи.Смещение = ИдентификаторОбновления;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
