
&НаСервере
Процедура ОбработатьКомандуНаСервере()
	
	ДанныеБота = ТелеграмСервер.ПолучитьДанныеБотаПоКлючу(Запись.Бот.ВебхукКлюч);
	
	Если Запись.Метод = "Webhook" Тогда
	    // Обработка входящего вебхука
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Запись.СтрокаJSON);
		
		Обновление = ФабрикаXDTO.ПрочитатьJSON(ЧтениеJSON);
		ТелеграмСервер.ОбработатьВходящееОбновлениеБота(Обновление, ДанныеБота);
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКоманду(Команда)
	ОбработатьКомандуНаСервере();
КонецПроцедуры
