
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    
    Документы.ЭлектронныеПисьмаВходящие.ПодготовитьТекстПисьмаИСтруктуруКартинок(ТекущийОбъект, ТекстПисьма, СтруктураКартинок);        
        
	ЭтотОбъект.ПолучателиПредставление =      Документы.ЭлектронныеПисьмаВходящие.ПолучитьСтрокойСписокПолучателейИзТабЧасти(Объект.ПолучателиПисьма);
	ЭтотОбъект.ПолучателиКопийПредставление = Документы.ЭлектронныеПисьмаВходящие.ПолучитьСтрокойСписокПолучателейИзТабЧасти(Объект.ПолучателиКопий);
    
    ТолькоПросмотр = Истина;
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    Если Объект.Ссылка.Пустая() Тогда
        
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Документ не может быть создан вручную, он может быть загружен через электронную почту по регламентному заданию.'"));
    	Отказ = Истина;
        Возврат;
    
    КонецЕсли;
    
    ОбщегоНазначенияКупоросКлиент.ВставитьКартинкиВТелоПисьма( СтруктураКартинок, ТекстПисьма );
    
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    
    // Изменять письмо мы не можем. Оно как пришло так и есть, кроме того так - быстрее при больших картинках.
    Отказ = Истина;
    Модифицированность = Ложь;
    ЭтотОбъект.Закрыть();
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекстПисьмаДокументСформирован(Элемент)
    
    Элемент.Документ.Body.ContentEditable = "false";
	Элемент.Документ.body.scroll          = "yes";
    Если СтрДлина(ТекстПисьма) > 0 Тогда
    	Элемент.Документ.Body.innerHTML = ТекстПисьма;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

