
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Ссылка.СтатусЗамены <> СтатусЗамены Тогда
		ДатаСтатуса = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Автоформирование наименования.
	ТекстСтарыеЗадачи = Справочники.ЗаменыЗадачПоПриоритизации.СформироватьСтрокуЗадачСписка(СтарыеЗадачи);
	ТекстНовыеЗадачи = Справочники.ЗаменыЗадачПоПриоритизации.СформироватьСтрокуЗадачСписка(НовыеЗадачи, Истина);
	
	// Примеры: 
	//	1 к 1: [Модификация данных HR: CR-003231]->[Преобразование системы учета: CR-0043123]
	//	2 к 1: [CR-003231|CR-003232]->[Преобразование системы учета: CR-0043123]
	//	2 к 2: [CR-003231|CR-003232]->[CR-0043123|CR-003236]
	//	0 к 1: [Без замены]->[Преобразование системы учета: CR-0043123]
	//	1 к 0: [Преобразование системы учета: CR-0043123]->[Перенос на следующий период]
	Наименование = СтрШаблон(НСтр("ru = '[%1]->[%2]'"), ТекстСтарыеЗадачи, ТекстНовыеЗадачи);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

