
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Исполнитель");
	
	ПериодДнейРаботы = Новый СтандартныйПериод(Параметры.МесяцАнализа, КонецМесяца(Параметры.МесяцАнализа));
	
	ОбновитьСписокНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодДнейРаботыПриИзменении(Элемент)
	
	ОбновитьСписокНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	ОбновитьСписокНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТрудозатраты(Команда)
	
	РезультатЗаполнения = ЗаполнитьТрудозатратыНаСервере();
	
	Если Не РезультатЗаполнения.Отказ Тогда
		Закрыть(РезультатЗаполнения.КолВоОбработаноШаблонов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтаНеделя(Команда)
	
	ПериодДнейРаботы.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
	
	ОбновитьСписокНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрошлаяНеделя(Команда)
	
	ПериодДнейРаботы.Вариант = ВариантСтандартногоПериода.ПрошлаяНеделя;
	
	ОбновитьСписокНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСписокНаКлиенте()
	
	ОбновитьСписокНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчетРабочегоВремени.ШаблонПлановыхЗатрат КАК ШаблонПлановыхЗатрат,
	|	СУММА(УчетРабочегоВремени.Затрачено) КАК Затрачено
	|ПОМЕСТИТЬ ВТ_УчетРабочегоВремени
	|ИЗ
	|	РегистрСведений.УчетРабочегоВремени КАК УчетРабочегоВремени
	|ГДЕ
	|	УчетРабочегоВремени.День МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетРабочегоВремени.ШаблонПлановыхЗатрат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ВТ_УчетРабочегоВремени.ШаблонПлановыхЗатрат ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Выбрать,
	|	ШаблоныПлановыхТрудозатрат.Ссылка КАК Шаблон,
	|	ВЫБОР
	|		КОГДА ВТ_УчетРабочегоВремени.ШаблонПлановыхЗатрат ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_УчетРабочегоВремени.Затрачено
	|	КОНЕЦ КАК УжеЗаполненныеТрудозатраты
	|ИЗ
	|	Справочник.ШаблоныПлановыхТрудозатрат КАК ШаблоныПлановыхТрудозатрат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетРабочегоВремени КАК ВТ_УчетРабочегоВремени
	|		ПО (ВТ_УчетРабочегоВремени.ШаблонПлановыхЗатрат = ШаблоныПлановыхТрудозатрат.Ссылка)
	|ГДЕ
	|	ШаблоныПлановыхТрудозатрат.Включен
	|	И НЕ ШаблоныПлановыхТрудозатрат.ПометкаУдаления
	|	И ШаблоныПлановыхТрудозатрат.Исполнитель = &Исполнитель
	|	И ШаблоныПлановыхТрудозатрат.НачалоДействия <= &НачалоПериода
	|	И ШаблоныПлановыхТрудозатрат.ОкончанияДействия >= &КонецПериода";
	
	Запрос.УстановитьПараметр("МесяцАнализа", МесяцАнализа);
	Запрос.УстановитьПараметр("НачалоМесяца", МесяцАнализа);
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(МесяцАнализа));
	Запрос.УстановитьПараметр("НачалоПериода", ПериодДнейРаботы.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ПериодДнейРаботы.ДатаОкончания);
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	ТаблицаШаблонов.Загрузить(Выгрузка);
	
	Для каждого ТекСтрока Из ТаблицаШаблонов Цикл
	
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтрока.Шаблон , "ЗадачаПользователя.Выполнена") Тогда
			
			ТекСтрока.Выбрать = Ложь;
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'В шаблоне уже выполненная задача: %1. По выполненным задачам не делается заполнения через шаблоны.'"), 
				ТекСтрока.Шаблон);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
		
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТрудозатратыНаСервере()
	
	 РезультатЗаполнения = Новый Структура;
	 РезультатЗаполнения.Вставить("КолВоОбработаноШаблонов", 0);
	 РезультатЗаполнения.Вставить("Отказ", Ложь);
	 
	 Отказ = Ложь;
	 КолВоОбработаноШаблонов = 0;
	 Для каждого ТекСтрока Из ТаблицаШаблонов Цикл
	 
	 	 Если Не ТекСтрока.Выбрать Тогда
		 	Продолжить;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтрока.Шаблон , "ЗадачаПользователя.Выполнена") Тогда
			Отказ = Истина;
			ТекстСообщения = СтрШаблон(НСтр("ru = 'В шаблоне уже выполненная задача: %1. По выполненным задачам не делается заполнения через шаблоны.'"), 
				ТекСтрока.Шаблон);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Прервать;
		КонецЕсли;
		
		Справочники.ШаблоныПлановыхТрудозатрат.ЗаполнитьПоШаблонуФактическиеТрудозатраты(ПериодДнейРаботы.ДатаНачала, 
			ПериодДнейРаботы.ДатаОкончания, ТекСтрока.Шаблон);
			
		КолВоОбработаноШаблонов = КолВоОбработаноШаблонов + 1;
		
	 КонецЦикла;
	 
	 РезультатЗаполнения.КолВоОбработаноШаблонов = КолВоОбработаноШаблонов;
	 РезультатЗаполнения.Отказ = Отказ;
	 
	 Возврат КолВоОбработаноШаблонов;
	 
КонецФункции

#КонецОбласти
