#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает индекс картинки по файлу картинки
//
// Параметры:
//  ХранилищеЗначенийКартинки	 - ХранилищеЗначений - содержит БиблиотекаКартинок 
// 
// Возвращаемое значение:
//  Число - число индекса картинки 
//
Функция ПолучитьИндексКартинкиПоФайлуКартинки(ХранилищеЗначенийКартинки) Экспорт

	ИндексКартинки = 0;
	
	Если ХранилищеЗначенийКартинки.Получить()<>Неопределено Тогда
		
		КартинкаБиблиотеки = ХранилищеЗначенийКартинки.Получить();
		
		Если КартинкаБиблиотеки = БиблиотекаКартинок.Набор_БлокПитания Тогда
			ИндексКартинки = 1;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_Картинка1С Тогда
			ИндексКартинки = 2;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_Клавиатура Тогда
			ИндексКартинки = 3;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_Лицензия Тогда
			ИндексКартинки = 4;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_Монитор Тогда
			ИндексКартинки = 5;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_МФУ Тогда
			ИндексКартинки = 6;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_Мышь Тогда
			ИндексКартинки = 7;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_Ноутбук Тогда
			ИндексКартинки = 8;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_Полка Тогда
			ИндексКартинки = 9;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_Принтер Тогда
			ИндексКартинки = 10;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_ПрограммноеОбеспечение Тогда
			ИндексКартинки = 11;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_РабочееМесто Тогда
			ИндексКартинки = 12;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_СерверныйШкаф Тогда
			ИндексКартинки = 13;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_СетевоеОборудование Тогда
			ИндексКартинки = 14;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_СистемныйБлок Тогда
			ИндексКартинки = 15;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_Сканер Тогда
			ИндексКартинки = 16;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_Склад Тогда
			ИндексКартинки = 17;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_СкладРасходныхМатериалов Тогда
			ИндексКартинки = 18;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_СкладРемонта Тогда
			ИндексКартинки = 19;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_ТВ Тогда
			ИндексКартинки = 20;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_Телефон Тогда
			ИндексКартинки = 21;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_ТонкийКлиент Тогда
			ИндексКартинки = 22;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_Шкаф Тогда
			ИндексКартинки = 23;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_USB1 Тогда
			ИндексКартинки = 24;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_USB2 Тогда
			ИндексКартинки = 25;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_LED Тогда
			ИндексКартинки = 26;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_USB1C Тогда
			ИндексКартинки = 27;
		ИначеЕсли КартинкаБиблиотеки = БиблиотекаКартинок.Набор_Планшет Тогда
			ИндексКартинки = 28;
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат ИндексКартинки;
	
КонецФункции // ПолучитьИндексКартинкиПоФайлуКартинки()

#КонецОбласти

#КонецЕсли
