
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ГрафикРаботыПользователя(Пользователь) Экспорт
	
	СведенияОПользователе = СведенияОПользователе(Пользователь);
	ГрафикРаботы = СведенияОПользователе.ГрафикРаботы;
	
	Если Не ЗначениеЗаполнено(ГрафикРаботы) Тогда
		
		ГрафикРаботы = РегистрыСведений.ПараметрыПодсистемыПланированиеЗадач.ЗначениеПараметра("ОсновнойГрафикРаботы");
		
	КонецЕсли;
	
	Возврат ГрафикРаботы;
	
КонецФункции

Функция СведенияОПользователе(Знач Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		
		Пользователь = Пользователи.ТекущийПользователь();
		
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("Пользователь", Пользователь);
	СведенияОПользователе = Получить(ПараметрыОтбора);
	
	Возврат СведенияОПользователе;
	
КонецФункции

Функция СведениеОПользователе(Сведение, Знач Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		
		Пользователь = Пользователи.ТекущийПользователь();
		
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("Пользователь", Пользователь);
	СведенияОПользователе = Получить(ПараметрыОтбора);
	
	Возврат СведенияОПользователе[Сведение];
	
КонецФункции

#КонецОбласти

#КонецЕсли
