#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Очистка переходов по состояниям без этапов состояний
	ОчисткаПереходовПоСостояниямБезЭтапов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Очистка переходов по состояниям без этапов состояний
Процедура ОчисткаПереходовПоСостояниямБезЭтапов()

	КолСтрокИсходное = ПереходыПоСостояниям.Количество();
	индекс = 1; сч = 0;
	Пока индекс <= КолСтрокИсходное Цикл
		
		СтрокаСостояния = ЭтапыСостояний.Найти(ПереходыПоСостояниям[сч].Состояние,"Состояние");
		
		Если СтрокаСостояния = Неопределено Тогда
			ПереходыПоСостояниям.Удалить(ПереходыПоСостояниям[сч]);    
		Иначе
			сч = сч + 1;    
		КонецЕсли;
		
		индекс = индекс + 1;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли


