
&НаСервере
Процедура ПосмотретьКэшПараметровНаСервере(ТабДокумент)
	
	ТаблицаЗначенийДляПросмотра = ЗначениеИзСтрокиВнутр(Запись.ЗначениеДляКэшПараметра);
		
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаЗначенийДляПросмотра);
	Построитель.ВыводитьЗаголовокОтчета = Ложь;
	Построитель.ВыводитьПодвалОтчета    = Ложь;
	Построитель.ВыводитьПодвалТаблицы    = Ложь;	
	Построитель.Выполнить();
	
	Построитель.Вывести(ТабДокумент);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьКэшПараметров(Команда)
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	ПосмотретьКэшПараметровНаСервере(ТабДокумент);
	
	ТабДокумент.Показать("Кэш параметров"); 

КонецПроцедуры
