//{{ *Олег Каратаев >>>>>>>>>>>>>>>>>>>>>>> ОПИСАНИЕ ИЗМЕНЕНИЙ >>>>>>>>>>>>>>>>>>>>>>>>>>>
// 
// НОВЫЕ/ИЗМЕНЕННЫЕ МЕТАДАННЫЕ ОБЪЕКТА
//  * [ФункциональныеОпции]ИспользоватьБизнесПроцессыИЗадачи - добавление в состав: Подсистема.УчетЗадачПользователей, Задача.ЗадачиПользователя, Справочник.ТелеграмБоты.ИспользоватьДляОтправкиСообщенийЗадач
//  * [ФункциональныеОпции]ИспользоватьДополнительныеОтчетыИОбработки - добавление в состав общих команд: ДополнительныеОбработкиУчетЗадачПользователей, ДополнительныеОтчетыУчетЗадачПользователей
//  * [ОпределяемыйТип]ВладелецПрисоединенныхФайлов - добавление в состав: ПапкиФайлов, Номенклатура, Задание, Проекты, Конфигурации, ЗадачиПользователя, СправочникСсылка.Организации, СообщенияОбсуждений, ШаблоныСообщений 
//  * [ОпределяемыйТип]ВладелецПрисоединенныхФайловОбъект - добавление в состав: ПапкиФайлов, ЗадачиПользователя, Задание, Конфигурации, Организации, СообщенияОбсуждений, ИдентификаторыОбъектовМетаданных, Проекты, Номенклатура, ШаблоныСообщений
//  * [ОпределяемыйТип]ВладелецДополнительныхСведений - добавление в состав: СправочникСсылка.Номенклатура,  СправочникСсылка.РабочиеМеста, СправочникСсылка.Организации
//  * [ОпределяемыйТип]Организация - добавление в состав: СправочникСсылка.Организации
//  * [ОпределяемыйТип]ЗначениеДоступа - добавление в состав: СправочникСсылка.Организации, Проекты
//  * [ОпределяемыйТип]ПрисоединенныйФайл - добавление в состав: СправочникСсылка.Файлы, НоменклатураПрисоединенныеФайлы, ЗаданиеПрисоединенныеФайлы, ПроектыПрисоединенныеФайлы, КонфигурацииПрисоединенныеФайлы, ЗадачиПользователяПрисоединенныеФайлы, ОрганизацииПрисоединенныеФайлы, СообщенияОбсужденийПрисоединенныеФайлы, ШаблоныСообщенийПрисоединенныеФайлы 
//  * [ОпределяемыйТип]ПрисоединенныйФайлОбъект - добавление в состав: СправочникОбъект.ВерсииФайлов, СправочникОбъект.КонфигурацииПрисоединенныеФайлы, СправочникОбъект.ЗадачиПользователяПрисоединенныеФайлы, СправочникОбъект.НоменклатураПрисоединенныеФайлы, СправочникОбъект.ОрганизацииПрисоединенныеФайлы, СправочникОбъект.Файлы, СправочникОбъект.ЭлектронныеПисьмаВходящиеПрисоединенныеФайлы, СправочникОбъект.СообщенияОбсужденийПрисоединенныеФайлы, СправочникОбъект.ПроектыПрисоединенныеФайлы, ЗаданиеПрисоединенныеФайлы, ШаблоныСообщенийПрисоединенныеФайлы 
//  * [ОпределяемыйТип]ФизическоеЛицо - добавление в состав: СправочникСсылка.ФизическиеЛица
//  * [ОпределяемыйТип]ВладелецНаборовЗначенийДоступаОбъект - добавление в состав: ЗадачиОбъект.ЗадачиПользователя для ограничения прав по задачам с использованием наборов значений из регистра
//  * [ОпределяемыйТип]ВладелецЗначенийКлючейДоступа - добавление в состав: ЗадачиПользователя, ЗадачиПользователяПрисоединенныеФайлы, СообщенияОбсужденийПрисоединенныеФайлы, СообщенияОбсуждений, ТемыОбсуждений, ШаблоныСообщенийПрисоединенныеФайлы
//  * [ОпределяемыйТип]ВладелецЗначенийКлючейДоступаОбъект - добавление в состав: ЗадачиПользователя, ЗадачиПользователяПрисоединенныеФайлы, СообщенияОбсужденийПрисоединенныеФайлы, СообщенияОбсуждений, ТемыОбсуждений, ШаблоныСообщенийПрисоединенныеФайлы
//  * [ОпределяемыйТип]ВладелецЗначенийКлючейДоступаНаборЗаписей - добавление в состав: ЗатраченноеВремяПоЗадачам, ХронометражРабочегоВремениПользователей, НапоминанияПользователя
//  * [ОпределяемыйТип]ОбъектСНастраиваемымПорядком - добавление в состав: ВидыДокументовФизическихЛиц, ВидыЗадач, СостоянияЗадач 
//  * [ОпределяемыйТип]ВладелецКонтактнойИнформации - добавление в состав: СправочникОбъект.Организации, СправочникОбъект.Проекты
//  * [ОпределяемыйТип]ПолучательРассылки - добавление в состав: СправочникСсылка.Организации
//  * [ОпределяемыйТип]МестоХраненияФункциональныхОпций - добавление в состав: КонстантаМенеджерЗначения.ИспользоватьУправлениеСетью
//  * [ОпределяемыйТип]ПодписанныйОбъект - добавление в состав: СправочникСсылка.ОрганизацииПрисоединенныеФайлы, СправочникСсылка.ЭлектронныеПисьмаВходящиеПрисоединенныеФайлы, СправочникСсылка.ЗадачиПользователяПрисоединенныеФайлы, СправочникСсылка.КонфигурацииПрисоединенныеФайлы, СправочникСсылка.СообщенияОбсужденийПрисоединенныеФайлы, СправочникСсылка.Файлы, СправочникСсылка.ПроектыПрисоединенныеФайлы, СправочникСсылка.НоменклатураПрисоединенныеФайлы, СправочникСсылка.ЗаданиеПрисоединенныеФайлы
//  * [ОпределяемыйТип]ОбъектСДополнительнымиКомандами - добавление в состав: ЗадачаСсылка.ЗадачиПользователя, ДокументСсылка.ТестированиеОбъектовМетаданных, ДокументСсылка.АктыВыполненныхРабот
//  * [ОпределяемыйТип]Подразделение - добавление в состав: СправочникСсылка.СтруктураПредприятия
//  * [ОпределяемыйТип]ПредметШаблонаСообщения - добавление в состав: ДокументСсылка.АктыВыполненныхРабот, ЗадачаСсылка.ЗадачиПользователя, СправочникСсылка.ИдентификаторыОбъектовМетаданных
//  * [ОпределяемыйТип]ПредметНапоминания - добавление в состав: *
//  * [ОпределяемыйТип]ПредметНапоминанияОбъект - добавление в состав: *
//  * [ОбщаяКоманда]Синхронизировать - добавление в состав: ПланыОбменаРИБКупорос
//  * [ОбщаяКоманда]НастроитьПараметрыТранспортаСообщенийОбмена - добавление в состав: ПланыОбменаРИБКупорос
//  * [ОбщаяКоманда]ЗагрузитьПравилаРегистрацииОбъектов - добавление в состав: ПланыОбменаРИБКупорос
//  * [ОбщаяКоманда]СценарииСинхронизации - добавление в состав: ПланыОбменаРИБКупорос
//  * [ОбщаяКоманда]СобытияОтправки - добавление в состав: ПланыОбменаРИБКупорос
//  * [ОбщаяКоманда]СобытияПолучения - добавление в состав: ПланыОбменаРИБКупорос
//  * [ОбщаяКоманда]СоставОтправляемыхДанных - добавление в состав: ПланыОбменаРИБКупорос
//  * [ОбщаяКоманда]УдалитьНастройкуСинхронизации - добавление в состав: ПланыОбменаРИБКупорос
//  * [ОбщаяКоманда]СозданиеНачальногоОбразаСФайлами - добавление в состав: ПланыОбменаРИБКупорос
//  * [Подсистема]ПодключаемыеОтчетыИОбработки - добавление в состав: Отчет.Задачи
//  * [ПодпискаНаСобытия]ОпределитьФормуПрисоединенногоФайлаШаблоныСообщений.Источник - добавление в состав: СправочникМенеджер.ЗаданиеПрисоединенныеФайлы, СправочникМенеджер.ЗадачиПользователяПрисоединенныеФайлы, СправочникМенеджер.ЭлектронныеПисьмаВходящиеПрисоединенныеФайлы, СправочникМенеджер.СообщенияОбсужденийПрисоединенныеФайлы, СправочникМенеджер.ОрганизацииПрисоединенныеФайлы, СправочникМенеджер.ПроектыПрисоединенныеФайлы, СправочникМенеджер.НоменклатураПрисоединенныеФайлы, СправочникМенеджер.ШаблоныСообщенийПрисоединенныеФайлы, СправочникМенеджер.КонфигурацииПрисоединенныеФайлы
//  * [КритерииОтбора]СвязанныеДокументы - добавлен тип:  ДокументСсылка.РаботыПоЗадаче, ДокументСсылка.АктыВыполненныхРабот, ЗадачаСсылка.ЗадачиПользователя, ДокументСсылка.ПриоритизацияЗадач 
//  * [КритерииОтбора]СвязанныеДокументы - добавлен состав: Документ.РаботыПоЗадаче.Реквизит.Задача, Документ.АктыВыполненныхРабот.ТабличнаяЧасть.СписокЗадач.Реквизит.Задача, Задача.ЗадачиПользователя.Реквизит.Основание, Документ.ПриоритизацияЗадач.ТабличнаяЧасть.СписокЗадач.Реквизит.Задача 
// 
// НОВЫЕ/ИЗМЕНЕННЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
// 
// ТЕГИ ИЗМЕНЕНИЙ
//  #Обсуждения
//   Функционал работы с обсуждениями. Позволяет из задач формировать новые сообщения и ответы на них
//
//}} *Олег Каратаев <<<<<<<<<<<<<<<<<<<<<<< ОПИСАНИЕ ИЗМЕНЕНИЙ <<<<<<<<<<<<<<<<<<<<<<<<<<<

// Разделитель описания изменений модуля объекта >> *Олег Каратаев
Перем ИзмененияМодуляОбъекта; 


///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

// СтандартныеПодсистемы

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие из КлючИЗначение:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Пример инициализации:
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Пример использования:
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт;

// Конец СтандартныеПодсистемы

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы()
	
#Если МобильныйКлиент Тогда
	Если ОсновнойСерверДоступен() = Ложь Тогда
		Возврат;
	КонецЕсли;
#КонецЕсли
	
	// СтандартныеПодсистемы
#Если МобильныйКлиент Тогда
	Выполнить("СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы()");
#Иначе
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
#КонецЕсли
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	// СтандартныеПодсистемы
#Если МобильныйКлиент Тогда
	Выполнить("СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы()");
#Иначе
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
#КонецЕсли
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	// СтандартныеПодсистемы
#Если МобильныйКлиент Тогда
	Выполнить("СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)");
#Иначе
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
#КонецЕсли
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

Процедура ОбработкаПолученияФормыВыбораПользователейСистемыВзаимодействия(НазначениеВыбора,
			Форма, ИдентификаторОбсуждения, Параметры, ВыбраннаяФорма, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы
#Если МобильныйКлиент Тогда
	Выполнить("СтандартныеПодсистемыКлиент.ОбработкаПолученияФормыВыбораПользователейСистемыВзаимодействия(НазначениеВыбора,
		|Форма, ИдентификаторОбсуждения, Параметры, ВыбраннаяФорма, СтандартнаяОбработка)");
#Иначе
	СтандартныеПодсистемыКлиент.ОбработкаПолученияФормыВыбораПользователейСистемыВзаимодействия(НазначениеВыбора,
		Форма, ИдентификаторОбсуждения, Параметры, ВыбраннаяФорма, СтандартнаяОбработка);
#КонецЕсли
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

#КонецОбласти