//{{ *Олег Каратаев >>>>>>>>>>>>>>>>>>>>>>> ОПИСАНИЕ ИЗМЕНЕНИЙ >>>>>>>>>>>>>>>>>>>>>>>>>>>
// 
// НОВЫЕ/ИЗМЕНЕННЫЕ МЕТАДАННЫЕ ОБЪЕКТА
//  * [Состав] - Добавлено: ЗаданиеПрисоединенныеФайлы, ЗадачиПользователяПрисоединенныеФайлы, КонфигурацииПрисоединенныеФайлы, НоменклатураПрисоединенныеФайлы ОрганизацииПрисоединенныеФайлы ПроектыПрисоединенныеФайлы СообщенияОбсужденийПрисоединенныеФайлы ЭлектронныеПисьмаВходящиеПрисоединенныеФайлы
// 
// НОВЫЕ/ИЗМЕНЕННЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
// 
// ТЕГИ ИЗМЕНЕНИЙ
//
//}} *Олег Каратаев <<<<<<<<<<<<<<<<<<<<<<< ОПИСАНИЕ ИЗМЕНЕНИЙ <<<<<<<<<<<<<<<<<<<<<<<<<<<

// Разделитель описания изменений модуля объекта >> *Олег Каратаев
Перем ИзмененияМодуля;