    
#Область ПрограммныйИнтерфейс

// Вызывается из события ОбработкаЗаполнения модулей объектов.
//
// Параметры:
//  Объект - СправочникОбъект
//         - ДокументОбъект - заполняемый объект;
//  ИмяРеквизита - Строка - имя реквизита Организация.
//
Процедура ПриВводеНовогоЗаполнитьОрганизацию(Объект, ИмяРеквизита = "Организация") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ОсновнаяОрганизация КАК ОсновнаяОрганизация
	|		ПО Организации.Ссылка = ОсновнаяОрганизация.Значение";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект[ИмяРеквизита] = Выборка.Организация;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

