
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидВходящегоОбновленияПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.СтраницаВходящийТекст.Видимость = Объект.ВидВходящегоОбновления = ПредопределенноеЗначение("Перечисление.ТелеграмВидыВходящихОбновлений.Сообщение");
	Элементы.СтраницаВходящиеДанные.Видимость = Объект.ВидВходящегоОбновления = ПредопределенноеЗначение("Перечисление.ТелеграмВидыВходящихОбновлений.ОтветКонтекстнойКлавиатуры");
	
КонецПроцедуры

#КонецОбласти

