//{{ *Олег Каратаев >>>>>>>>>>>>>>>>>>>>>>> ОПИСАНИЕ ИЗМЕНЕНИЙ >>>>>>>>>>>>>>>>>>>>>>>>>>>
// 
// ИЗМЕНЕННЫЕ СВОЙСТВА ОБЪЕКТА ОТСУТСТВУЮТ
// 
// НОВЫЕ/ИЗМЕНЕННЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//  * [Процедура]ПриОпределенииНеобходимостиПоказаПредупрежденияОбУстаревшемКлассификатореБанков
// 
// ТЕГИ ИЗМЕНЕНИЙ
//
//}} *Олег Каратаев <<<<<<<<<<<<<<<<<<<<<<< ОПИСАНИЕ ИЗМЕНЕНИЙ <<<<<<<<<<<<<<<<<<<<<<<<<<<

// Разделитель описания изменений общего модуля >> *Олег Каратаев
Функция ИзмененияОбщегоМодуля()
	
	Если Ложь Тогда
	    ИзмененияОбщегоМодуля()
	КонецЕсли;

	Возврат Неопределено;	

КонецФункции // Конец Разделитель описания изменений общего модуля


///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Включает/отключает показ предупреждений о необходимости обновления классификатора банков.
//
// Параметры:
//  ПоказыватьПредупреждение - Булево - при установке значения Ложь предупреждения показываться не будут.
//
Процедура ПриОпределенииНеобходимостиПоказаПредупрежденияОбУстаревшемКлассификатореБанков(ПоказыватьПредупреждение) Экспорт
	
	// { *Олег Каратаев [10.01.2021]
	ПоказыватьПредупреждение = Ложь;
	// }
	
КонецПроцедуры

// Определяет настройки загрузки классификатора банков.
//
// Параметры:
//  Настройки - Структура:
//   * ОбрабатыватьОбластиДанных - Булево - включает выполнение процедуры ПриОбработкеОбластиДанных при обновлении
//                                          классификатора.
//
Процедура ПриОпределенииНастроекЗагрузкиКлассификатораБанков(Настройки) Экспорт
	
КонецПроцедуры

// Используется только в разделенном режиме. Вызывается после загрузки классификатора для выполнения дополнительных
// действий в областях данных. Выполнение процедуры необходимо включить в ПриОпределенииНастроек, по умолчанию выключена.
//
Процедура ПриОбработкеОбластиДанных() Экспорт
	
КонецПроцедуры

#КонецОбласти
