
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКупоросСервер.ПриСозданииНаСервереФормыВыбора(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьНеактуальныеПроектыПриИзменении(Элемент)
	
	ПоказыватьНеактуальныеПроектыПереключение();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказыватьНеактуальныеПроектыПереключение() 
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		"Актуальность", Не ПоказыватьНеактуальныеПроекты, ВидСравненияКомпоновкиДанных.Равно, ,Не ПоказыватьНеактуальныеПроекты);
	
КонецПроцедуры

#КонецОбласти

