#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НачалоРабочегоДня > КонецРабочегоДня Тогда
		
		ТекстСообщения = НСтр("ru = 'Начало рабочего дня не может быть больше конца рабочего дня.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ВсегоЧасовВРабочийДень = (КонецРабочегоДня - НачалоРабочегоДня) / 3600;
	
	Если КоличествоРабочихЧасовВРабочийДень > ВсегоЧасовВРабочийДень Тогда
		
		ТекстСообщения = НСтр("ru = 'Количество рабочих часов не может быть больше общей продолжительности рабочего дня.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		
	КонецЕсли;
	
	КоличествоРабочихЧасовВПредпраздничныйДень = КоличествоРабочихЧасовВРабочийДень - 1;
	ВсегоЧасовВПредпраздничныйДень = ВсегоЧасовВРабочийДень - 1;
	
	Если ВсегоЧасовВРабочийДень = 0 Тогда
		
		КоэффициентУчетаВремени = 1;
		
	Иначе
		
		КоэффициентУчетаВремени = КоличествоРабочихЧасовВРабочийДень / ВсегоЧасовВРабочийДень;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
