

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Параметры.Заголовок;
	Состояние = Параметры.Состояние;
	
	ТаблицаИзДругойФормыПоПереходамСостояний = ПолучитьИзВременногоХранилища(Параметры.АдресПереходыПоСостояниям);
	ПереходыПоСостояниям.Загрузить(ТаблицаИзДругойФормыПоПереходамСостояний);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ПереходыПоСостояниям",ПереходыПоСостояниям);
	ПараметрыЗакрытия.Вставить("Состояние",Состояние);
	
	Оповестить("ЗаполнениеПереходаПоСостояниюЗавершение",ПараметрыЗакрытия);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

