
#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТест("СозданиеЗадач").ВТранзакции();

КонецПроцедуры

Процедура СозданиеЗадач() Экспорт

	Проект = ЮТест.Данные().СоздатьЭлемент("Справочники.Проекты");	
	
	Задача1 = ЮТест.Данные().СоздатьЭлемент("Задачи.ЗадачиПользователя");	
	
	Задача2 = ЮТест.Данные().Фикция(Тип("ЗадачаСсылка.ЗадачиПользователя"));
	
	КонструкторЗадача3 = ЮТест.Данные().КонструкторОбъекта("Задачи.ЗадачиПользователя")
		.ФикцияОбязательныхПолей()
	    .Установить("Проект", Проект) 
	    .Установить("Исполнитель", Пользователи.ТекущийПользователь()) 
		.Установить("СрокИсполнения", ЮТест.Данные().СлучайнаяДатаВБудущем(30, "дней"))
		.Фикция("ВидЗадачи")
		.Фикция("ТипЗадачи");
	Задача3 = КонструкторЗадача3.Записать();
	
	Задачи.ЗадачиПользователя.ВыполнитьЗадачу(Задача3, Ложь);
		
	ЮТест.ОжидаетЧто(Задача3)
	    .Свойство("Выполнена").ЭтоИстина()
	    .Свойство("ДатаВыполнения").Заполнено();
		
КонецПроцедуры  

#КонецОбласти

