

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаКартинка.Видимость = ПоказыватьКартинку;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьКартинкуПриИзменении(Элемент)
	
	Элементы.ГруппаКартинка.Видимость = ПоказыватьКартинку;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧтениеКартинкиАктивизированнойСтроки(ТекущиеДанные.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьНавигационнуюСсылкуКартинки(ФайлКартинки, ИдентификаторФормы)

	УстановитьПривилегированныйРежим(Истина);

	Возврат РаботаСФайлами.ДанныеФайла(ФайлКартинки, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	
КонецФункции

&НаСервере
Процедура ЧтениеКартинкиАктивизированнойСтроки(ВыбраннаяСсылка)
	
	Если ПоказыватьКартинку Тогда
		Если (НЕ ВыбраннаяСсылка.ЭтоГруппа) 
			И (Не ВыбраннаяСсылка.ФайлКартинки.Пустая()) Тогда
			АдресКартинки = ПолучитьНавигационнуюСсылкуКартинки(ВыбраннаяСсылка.ФайлКартинки, УникальныйИдентификатор)
		Иначе
			АдресКартинки = "";
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


