
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Сведения_О_Внешней_Обработке

Функция СведенияОВнешнейОбработке() Экспорт
	
    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
    ПараметрыРегистрации.Версия = "1.4";   // 14.01.2023
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Информация = НСтр("ru = 'Сервис обмена с 1С Купорос'");
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = '1. Параметры обмена с Купорос'");
	Команда.Идентификатор = "ФормаПараметровОбмена";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Ложь;
	
    Команда = ПараметрыРегистрации.Команды.Добавить();
    Команда.Представление = НСтр("ru = '2. Обмен с Купорос: Загрузка списка пользователей текущей ИС (в справочник КП_ПользователиТекущейИС).'");
    Команда.Идентификатор = "ОбменСКупорос_ЗагрузкаПользователейИзКупорос";
    Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
    Команда.Представление = НСтр("ru = '3. Обмен с Купорос: Актуализация справочника Пользователи.'");
    Команда.Идентификатор = "ОбменСКупорос_УправлениеДоступомПользователей";
    Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
    Команда.Представление = НСтр("ru = '4. Обмен с Купорос: Выгрузка шаблонов доступа в Купорос.'");
    Команда.Идентификатор = "ОбменСКупорос_ОбработкаВыгрузкиАктуальныхШаблоновДоступа";
    Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
    Команда.Представление = НСтр("ru = '5. Обмен с Купорос: Загрузка прав доступа из Купорос.'");
    Команда.Идентификатор = "ОбменСКупорос_ЗагрузкаПравДоступаИзКупорос";
    Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
 
    Возврат ПараметрыРегистрации; 
	
КонецФункции 

Процедура ВыполнитьКоманду(Идентификатор) Экспорт
	
	Если Идентификатор = "ОбменСКупорос_ЗагрузкаПользователейИзКупорос" Тогда
		
		МодульОбменДаннымиКупорос = ОбщегоНазначения.ОбщийМодуль("КП_ОбменДаннымиКупорос");
		МодульОбменДаннымиКупорос.ФормированиеАктуальногоСпискаПользователейТекущийИС();
		
	КонецЕсли;
	
	Если Идентификатор = "ОбменСКупорос_УправлениеДоступомПользователей" Тогда
		
		МодульОбменДаннымиКупорос = ОбщегоНазначения.ОбщийМодуль("КП_УправлениеПравамиДоступа");
		МодульОбменДаннымиКупорос.АктуализацияНаДоступПользователей();
		
	КонецЕсли;
	
	Если Идентификатор = "ОбменСКупорос_ОбработкаВыгрузкиАктуальныхШаблоновДоступа" Тогда
		
		МодульОбменДаннымиКупорос = ОбщегоНазначения.ОбщийМодуль("КП_ОбменДаннымиКупорос");
		МодульОбменДаннымиКупорос.ОбработкаВыгрузкиАктуальныхШаблоновДоступа();
		
	КонецЕсли;
	
	Если Идентификатор = "ОбменСКупорос_ЗагрузкаПравДоступаИзКупорос" Тогда
		
		МодульОбменДаннымиКупорос = ОбщегоНазначения.ОбщийМодуль("КП_ОбменДаннымиКупорос");
		МодульОбменДаннымиКупорос.ОбработкаЗагрузкаПравДоступа();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли



