#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Параметры() Экспорт
	
	Возврат Получить();
	
КонецФункции

Функция ЗначениеПараметра(Параметр) Экспорт
	
	Параметры = Параметры();
	
	Возврат Параметры[Параметр];
	
КонецФункции

// Устанавливает значения параметров
//
// Параметры:
//  ЗначенияНовыхПараметров	 - Структура - содержит новые данные обновляемых параметров
//
Процедура ДобавитьЗначенияПараметров(ЗначенияНовыхПараметров) Экспорт
	
	ТекущиеПараметры = Параметры();
	НаборЗаписей = РегистрыСведений.ПараметрыКупорос.СоздатьНаборЗаписей();
	НоваяЗапись = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекущиеПараметры);
	ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗначенияНовыхПараметров);
	НаборЗаписей.Записать();
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
