////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИОНАЛ ПОДСИСТЕМЫ "Учет задач пользователей" (ПОВТОРНО ИСПОЛЬЗУЕМЫЕ КЭШ ФУНКЦИИ)
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ТаблицаИзбранныхПроектовТекущегоПользователя() Экспорт

	Возврат РаботаСЗадачами.ТаблицаИзбранныхПроектовТекущегоПользователя();
	
КонецФункции // СписокИзбранныхПроектовТекущегоПользователя()

// Функция возвращает состояния задач (Кэшированные на время сеанса)
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки:
//		* Ссылка
//		* УчитыватьПриРасчетеВремениВыполнения
//		* ОбязателенСрокСостояния
//		* ОбязательнаПричинаИзмененияСостояния
//
Функция СостоянияЗадачКэш() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СостоянияЗадач.Ссылка КАК Ссылка,
	               |	СостоянияЗадач.УчитыватьПриРасчетеВремениВыполнения КАК УчитыватьПриРасчетеВремениВыполнения,
	               |	СостоянияЗадач.ОбязателенСрокСостояния КАК ОбязателенСрокСостояния,
	               |	СостоянияЗадач.ОбязательнаПричинаИзмененияСостояния КАК ОбязательнаПричинаИзмененияСостояния,
	               |	СостоянияЗадач.ПроцентВыполнения100 КАК ПроцентВыполнения100
	               |ИЗ
	               |	Справочник.СостоянияЗадач КАК СостоянияЗадач
	               |ГДЕ
	               |	НЕ СостоянияЗадач.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();
	
КонецФункции // СостоянияЗадачКэш()

// см. описание Справочники.НастройкиДоступностиПоСостояниюЗадачи.НастройкиДоступностиФормыЗадачи(...)
Функция НастройкиДоступностиФормыЗадачи(Контекст, ТипКонтекста = "ФормаЗадачи", ТипыПользователя = Неопределено) Экспорт
	
	Возврат Справочники.НастройкиДоступностиПоСостояниюЗадачи.НастройкиДоступностиФормыЗадачи(Контекст, ТипКонтекста, ТипыПользователя);
	
КонецФункции

// см. РаботаСЗадачами.ЭтоПолноправныйПользовательЗадач() 
Функция ЭтоПолноправныйПользовательЗадач() Экспорт

	Возврат РаботаСЗадачами.ЭтоПолноправныйПользовательЗадач();	

КонецФункции 

// см. Пользователи.ТекущийПользователь()
Функция ТекущийПользователь() Экспорт

	Возврат Пользователи.ТекущийПользователь();

КонецФункции 

#КонецОбласти
