
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСписокВидовНоменклатуры();	
	
КонецПроцедуры

//
&НаСервере
Процедура ОбновитьСписокВидовНоменклатуры() 
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ВидыНоменклатуры.Ссылка
	                |ИЗ
	                |	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	                |ГДЕ
	                |	НЕ ВидыНоменклатуры.ЭтоГруппа
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ВидыНоменклатуры.Наименование";
	 
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выгрузить();
	 СписокВидовНоменклатуры.ЗагрузитьЗначения(Выборка.ВыгрузитьКолонку("Ссылка"));
	 
	 Для каждого ТекСтрока Из СписокВидовНоменклатуры Цикл
		 ФайлКартинки = ТекСтрока.Значение.ФайлКартинки.Получить();
		 Если ФайлКартинки<>Неопределено Тогда
			 ТекСтрока.Картинка = ТекСтрока.Значение.ФайлКартинки.Получить();
		 КонецЕсли;
	 КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВидовНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОповеститьОВыборе(Элемент.ТекущиеДанные.Значение);	
	
КонецПроцедуры
