
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Задача = Параметры.Отбор.Задача;
	
	Если Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "Проект.ВестиУчетАктовВыполненныхРабот") = Истина Тогда
		
		Элементы.РаботыНаОплату.Видимость = Ложь;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(РаботыНаОплату.Отбор,
		"Задача",
		Задача,
		ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Изменение_ФактическиеТрудозатратыЗадачи" Тогда
	
		Элементы.Список.Обновить();
		Элементы.РаботыНаОплату.Обновить();
	
	КонецЕсли;
	
КонецПроцедуры



