
#Область ПрограммныйИнтерфейс

// Возвращает версию расширения из объекта метаданных
// 
// Возвращаемое значение:
//   Строка - версия расширения
//
Функция ВерсияРасширения() Экспорт

	МассивРасширений = РасширенияКонфигурации.Получить(Новый Структура("Имя", "УправлениеДоступомПользователей"));
	Если МассивРасширений.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат МассивРасширений[0].Версия;

КонецФункции

// Быстрая запись в журнал регистрации. Использовать из шаблона разработчика.
//
// Параметры:
//  ИмяСобытияВход				 - Строка - Состоит из <Подразделение>.<Функционал/Процедура> 
//  ТекстОписания				 - Строка - любое текстовое пояснение
//  Уровень						 - УровеньЖурналаРегистрации - для ошибок: УровеньЖурналаРегистрации.Ошибка
//  ВыводитьПредставлениеОшибки	 - Булево - если процедура вызывается в исключении попытки, то устанавливать Истина для вывода информации по ошибке
//
Процедура ЗаписьЖурналаРегистрацииРасширенная(ИмяСобытияВход, ТекстОписания, Уровень, ВыводитьПредставлениеОшибки = Ложь) Экспорт

	КодЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	ИмяСобытия = СтрШаблон(НСтр("ru = '%1'", КодЯзыка), ИмяСобытияВход);
	
	Если ВыводитьПредставлениеОшибки Тогда
	
		ТекстКомментария = НСтр("ru = '%1 
                    |%2'", КодЯзыка);
		
		// Сравнение версий платформы для совместимости работы с функцией ПодробноеПредставлениеОшибки().
		ПредставлениеОшибки = "";
		ВерсияПлатформыНовая = ВерсияПлатформыВышеИлиРавна("8.3.17.1386");
		УстановитьБезопасныйРежим(Истина);
		Если ВерсияПлатформыНовая Тогда
			Выполнить("ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())");
		Иначе
			Выполнить("ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())");
		КонецЕсли;		
		УстановитьБезопасныйРежим(Ложь);

		КомментарийДляЖурнала = СтрШаблон(ТекстКомментария,
									ТекстОписания,	
									ПредставлениеОшибки);
	Иначе
									
		ТекстКомментария = НСтр("ru = '%1'", КодЯзыка);

		КомментарийДляЖурнала = СтрШаблон(ТекстКомментария,
									ТекстОписания);
	
	КонецЕсли;
									
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень,,, КомментарийДляЖурнала);

КонецПроцедуры

// Сравнивает реквизиты по списку и возвращает флаг изменения.
//
// Параметры:
//  Объект						 - ЛюбойОбъект 
//  СтараяСсылка				 - ДокументСсылка, СправочникСсылка 
//  СписокРеквизитовСравнения	 - Массив Из Строка - список реквизитов, которые надо выгрузить 
//  УжеЕстьИзменения			 - Булево - если ранее уже были определения изменений, то передавать флаг об этом
//  ИзмененныеРеквизиты			 - Строка - в строке передает описание изменений для логов
// 
// Возвращаемое значение:
//  Булево - Истина, если есть изменения реквизитов
//
Функция ЕстьИзмененияРеквизитовОбъекта(Объект, СтараяСсылка, СписокРеквизитовСравнения, УжеЕстьИзменения = Ложь, ИзмененныеРеквизиты = "") Экспорт
	
	Если УжеЕстьИзменения Тогда
		Возврат Истина;
	КонецЕсли;
	
	СписокРеквизитов = СтрСоединить(СписокРеквизитовСравнения, ", ");
	
	РеквизитыСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтараяСсылка, СписокРеквизитов);
	
	ЕстьИзменения = Ложь;
	
	Для каждого ТекСтрока Из РеквизитыСсылки Цикл
		
		ЕстьИзмененияПоОдномуРеквизиту = Ложь;
	
		СравнитьРеквизит(Объект, ТекСтрока.Ключ, ТекСтрока.Значение, ЕстьИзмененияПоОдномуРеквизиту);
		
		Если ЕстьИзмененияПоОдномуРеквизиту Тогда
			ИзмененныеРеквизиты = СтрокаИзмененныхРеквизитов(ИзмененныеРеквизиты, ТекСтрока.Ключ, Объект[ТекСтрока.Ключ], ТекСтрока.Значение);
		КонецЕсли;
		
		// ЕстьИзменения не менять, если хотя бы раз выявилось изменение.
		ЕстьИзменения = ?(ЕстьИзмененияПоОдномуРеквизиту, Истина, ЕстьИзменения);
		
	КонецЦикла;
	
	ИзмененныеРеквизиты = СокрЛП(ИзмененныеРеквизиты);
	
	Возврат ЕстьИзменения;

КонецФункции

// Процедура сравнивает реквизит, в случае если отличается от текущего, то фиксирует флаг изменения
Процедура СравнитьРеквизит(Объект, ИмяРеквизита, НовоеЗначение, ФлагИзменения = Ложь) Экспорт
	
	Если Объект[ИмяРеквизита] <> НовоеЗначение Тогда
		
		ФлагИзменения = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Сравнить две строки версий.
//
// Параметры:
//  СтрокаВерсии1  - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС.
//  СтрокаВерсии2  - Строка - второй сравниваемый номер версии.
//
// Возвращаемое значение:
//   Число   - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0.0.0", СтрокаВерсии1);
	Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0.0.0", СтрокаВерсии2);
	Версия1 = СтрРазделить(Строка1, ".");
	Если Версия1.Количество() <> 4 Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неправильный формат параметра СтрокаВерсии1: %1'"), СтрокаВерсии1);
	КонецЕсли;
	Версия2 = СтрРазделить(Строка2, ".");
	Если Версия2.Количество() <> 4 Тогда
		ВызватьИсключение СтрШаблон(
	    	НСтр("ru = 'Неправильный формат параметра СтрокаВерсии2: %1'"), СтрокаВерсии2);
	КонецЕсли;
	
	Результат = 0;
	Для Разряд = 0 По 3 Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

// Возвращает Истина, если версия платформы больше или равна указанной минимальной
//
// Параметры:
//  Минимальная	 - Строка - версия в формате вида: 8.3.17.1386
// 
// Возвращаемое значение:
//   Булево - Истина, платформа выше или равна указанной минимальной
//
Функция ВерсияПлатформыВышеИлиРавна(Минимальная) Экспорт

	СистемнаяИнформация = Новый СистемнаяИнформация;
	Текущая             = СистемнаяИнформация.ВерсияПриложения;
	УстановитьБезопасныйРежим(Истина);
	Результат =  СравнитьВерсии(Текущая, Минимальная) >= 0;
	
	Возврат Результат;

КонецФункции

// Функция возвращает таблицу разницы отсортированную по "Измерения"
//  Код взят из: https://infostart.ru/public/326983/: Свертка и сортировка
//
// Параметры:
//  Таблица1	 - ТаблицаЗначений	 
//  Таблица2	 - ТаблицаЗначений 
//  Измерения	 - Строка - поле по которому будет сделана сортировка
//  УдалятьКолонкиИзПервойТаблицы - Булево - в случае Истина, удаляются колонки из первой таблицы, которых нет во второй таблице 
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица разницы значений. Состоит из колонок:
//		* Колонки таблицы
//		* Знак - Число - 0 есть в таблице 0, 1 есть в таблице 1
//
Функция РазницаТаблицЗначений(Таблица1, Таблица2, Измерения = Неопределено, УдалятьКолонкиИзПервойТаблицы = Ложь) Экспорт
    	
	Если УдалятьКолонкиИзПервойТаблицы Тогда
	    УдалитьОтсутствующиеКолонкиИзТаблицыЗначений(Таблица1, Таблица2);	
	КонецЕсли;
	    
	// Все колонки Таблица1.
	ВсеКолонки = "";
    Для Каждого Колонка Из Таблица1.Колонки Цикл 
        ВсеКолонки = ВсеКолонки + ", " + Колонка.Имя
    КонецЦикла;
    ВсеКолонки = Сред(ВсеКолонки, 2);
		
    Таблица = Таблица2.Скопировать();    
    
    Таблица.Колонки.Добавить("Знак", Новый ОписаниеТипов("Число"));
    Таблица.ЗаполнитьЗначения(1, "Знак");
    
	Для Каждого Строка Из Таблица1 Цикл 
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Строка) 
	КонецЦикла;
    
    Таблица.Колонки.Добавить("Счёт");
    Таблица.ЗаполнитьЗначения(1, "Счёт");
		
	Таблица.Свернуть(ВсеКолонки, "Знак, Счёт");
	
	ОтборПоСчету = Новый Структура("Счёт", 1);
    Ответ = Таблица.Скопировать(ОтборПоСчету, ВсеКолонки + ", Знак");
	
	Если Измерения <> Неопределено Тогда
		
	    Ответ.Сортировать(Измерения);
		
	КонецЕсли;
    
    Возврат Ответ
    
КонецФункции

// Сравнивает две таблицы значений на равенство по всем измерениям. При этом не учитывается порядок строк.
//
// Параметры:
//  Таблица1                      - ТаблицаЗначений
//  Таблица2                      - ТаблицаЗначений
//	СравниватьКолонки             - Булево - в случае Истина, будет сравнивать колонки и по результату выдавать меньшее кол-во. 
//								    Если колонки не сравнивать и они будут отличаться, то будет ошибка выполнения функции. По-умолчанию: Ложь.
//  Измерения	                  - Строка - поле по которому будет сделана сортировка
//  УдалятьКолонкиИзПервойТаблицы - Булево - в случае Истина, удаляются колонки из первой таблицы, которых нет во второй таблице
// 
// Возвращаемое значение:
//  Булево
//
Функция ТаблицыЗначенийРавны(Таблица1, Таблица2, СравниватьКолонки = Ложь, Измерения = Неопределено, УдалятьКолонкиИзПервойТаблицы = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(Таблица1)
		И Не ЗначениеЗаполнено(Таблица2) Тогда
		
		Возврат Истина;
		
	ИначеЕсли ЗначениеЗаполнено(Таблица1)
		И Не ЗначениеЗаполнено(Таблица2) Тогда
		
		Возврат Ложь;
		
	ИначеЕсли Не ЗначениеЗаполнено(Таблица1)
		И ЗначениеЗаполнено(Таблица2) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если СравниватьКолонки Тогда
		Для Каждого Колонка Из Таблица1.Колонки Цикл
			Если Таблица2.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;		
		КонецЦикла;	
		Для Каждого Колонка Из Таблица2.Колонки Цикл
			Если Таблица1.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
		
	Разница = РазницаТаблицЗначений(Таблица1, Таблица2, Измерения, УдалятьКолонкиИзПервойТаблицы);
	
	Возврат (Разница.Количество() = 0);
	
КонецФункции

// Удаляет колонки из первой таблицы, которых нет во второй таблице.
//
// Параметры:
//  Таблица1	 - ТаблицаЗначений.
//  Таблица2	 - ТаблицаЗначений.
//
Процедура УдалитьОтсутствующиеКолонкиИзТаблицыЗначений(Таблица1, Таблица2) Экспорт 
		
	Если Не ЗначениеЗаполнено(Таблица1) 
		Или Не ЗначениеЗаполнено(Таблица2) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КолонкиКУдалению = Новый Массив;
	
	Для Каждого Колонка Из Таблица1.Колонки Цикл
		Если Таблица2.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
			КолонкиКУдалению.Добавить(Колонка.Имя);
		КонецЕсли;		
	КонецЦикла;	         
	
	Для каждого Колонка Из КолонкиКУдалению Цикл
		Таблица1.Колонки.Удалить(Колонка);	
	КонецЦикла;
		
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ВЕБ-СЕРВИСАМИ

Функция ВыполнитьЗапросHTTP_JSON(АдресСервера, АдресРесурса, МетодОтправки, ПараметрыЗапроса = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Если ПараметрыЗапроса = Неопределено Тогда
		
		ПараметрыЗапроса = Новый Структура;
		
	КонецЕсли;
	
	Если ПараметрыЗапроса.Свойство("ЗначениеДляОтправки") Тогда
		
		ПараметрыЗапроса.Вставить("ТекстЗапроса", СтрокаИзJSON(ПараметрыЗапроса.ЗначениеДляОтправки));
		Результат.Вставить("ТекстЗапроса", ПараметрыЗапроса.ТекстЗапроса);
		
	КонецЕсли;
	
	Если Не ПараметрыЗапроса.Свойство("Заголовки") Тогда
		
		ПараметрыЗапроса.Вставить("Заголовки", Новый Соответствие);
		
	КонецЕсли;
	
	Если ПараметрыЗапроса.Заголовки["Content-Type"] = Неопределено Тогда
		
		ПараметрыЗапроса.Заголовки.Вставить("Content-Type", "application/json");
		
	КонецЕсли;
	
	Если Не ПараметрыЗапроса.Свойство("ПрочитатьВСоответствие") Тогда
		
		ПараметрыЗапроса.Вставить("ПрочитатьВСоответствие", Ложь);
		
	КонецЕсли;
	
	Ответ = ВыполнитьЗапросHTTP(АдресСервера, АдресРесурса, МетодОтправки, ПараметрыЗапроса);
	
	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
	ЗначениеJSON = JSONИзСтроки(ТекстОтвета, ПараметрыЗапроса.ПрочитатьВСоответствие);
	Результат.Вставить("ЗначениеОтвета", ЗначениеJSON);
	
	// Прогоним ответ через запись JSON, чтобы получить нормальное форматирование.
	ТекстОтвета = СтрокаИзJSON(ЗначениеJSON);
	Результат.Вставить("ТекстОтвета", ТекстОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьЗапросHTTP(АдресСервера, АдресРесурса, МетодОтправки, ПараметрыЗапроса = Неопределено) Экспорт
	
	// Заполним параметры запроса значениями по умолчанию.
	Если ПараметрыЗапроса = Неопределено Тогда
		
		ПараметрыЗапроса = Новый Структура;
		
	КонецЕсли;
	
	Если Не ПараметрыЗапроса.Свойство("Порт") Тогда
		
		ПараметрыЗапроса.Вставить("Порт", Неопределено);
		
	КонецЕсли;
	
	Если Не ПараметрыЗапроса.Свойство("Таймаут") Тогда
		
		ПараметрыЗапроса.Вставить("Таймаут", 60);
		
	КонецЕсли;
	
	Если Не ПараметрыЗапроса.Свойство("Заголовки") Тогда
		
		ПараметрыЗапроса.Вставить("Заголовки", Новый Соответствие);
		
	КонецЕсли;
	
	Если Не ПараметрыЗапроса.Свойство("ИспользоватьАутентификациюОС") Тогда
		
		ПараметрыЗапроса.Вставить("ИспользоватьАутентификациюОС", Ложь);
		
	КонецЕсли;
	
	Если Не ПараметрыЗапроса.Свойство("ТекстЗапроса") Тогда
		
		ПараметрыЗапроса.Вставить("ТекстЗапроса", "");
		
	КонецЕсли;
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(АдресСервера, ПараметрыЗапроса.Порт, , , , ПараметрыЗапроса.Таймаут, SSL, ПараметрыЗапроса.ИспользоватьАутентификациюОС);
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
	
	Для каждого КлючИЗначение Из ПараметрыЗапроса.Заголовки Цикл
		
		HTTPЗапрос.Заголовки.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		
	КонецЦикла;
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыЗапроса.ТекстЗапроса);
	
	Если МетодОтправки = "GET" Тогда
		
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		
	ИначеЕсли МетодОтправки = "PUT" Тогда
		
		Ответ = HTTPСоединение.Записать(HTTPЗапрос);
		
	ИначеЕсли МетодОтправки = "POST" Тогда
		
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции


//////////////////////////////////////////////////////////////////////////////////////////
// РАБОТА С JSON

Функция СтрокаИзJSON(ЗначениеJSON) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ЗначениеJSON);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции

Функция JSONИзСтроки(СтрокаJSON, ПрочитатьВСоответствие = Ложь) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Попытка
		
		ЗначениеJSON = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
		
	Исключение
	    
		ЗначениеJSON = Неопределено;
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
	КонецПопытки;
	
	Возврат ЗначениеJSON;
	
КонецФункции

#КонецОбласти  

#Область СлужебныйПрограммныйИнтерфейс

Функция СтрокаИзмененныхРеквизитов(Знач ИсторияРеквизитов, ИмяРеквизита, СтароеЗначение, НовоеЗначение) Экспорт

	СтрокаРеквизитов = СтрШаблон(НСтр("ru = '%1 {%2: [%3] -> [%4]}'"), ИсторияРеквизитов, ИмяРеквизита, СтароеЗначение, НовоеЗначение);
	
	Возврат СтрокаРеквизитов;

КонецФункции

#КонецОбласти

 
