
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокЛистов = ОбщегоНазначения.СкопироватьРекурсивно(Параметры.СписокЛистов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЛистов

&НаКлиенте
Процедура СписокЛистовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбратьЛистНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьЛист(Команда)
	
	ВыбратьЛистНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЛистНаКлиенте()
	
	ТекущиеДанные = Элементы.СписокЛистов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Закрыть(ТекущиеДанные.Значение);
	
КонецПроцедуры

#КонецОбласти

