
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормойСервер();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПользовательШаблонПриИзменении(Элемент)
	
	УправлениеФормойСервер();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаГруппДоступа

&НаКлиенте
Процедура ТаблицаГруппДоступаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТаблицаГруппДоступаГруппаДоступа" Тогда
	
		ПоказатьЗначение(, Элемент.ТекущиеДанные.ГруппаДоступа);
		
	ИначеЕсли Поле.Имя = "ТаблицаГруппДоступаГруппаПользователей" 
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ГруппаПользователя) Тогда
		
		ПоказатьЗначение(, Элемент.ТекущиеДанные.ГруппаПользователя);
		
	Иначе
		
		// без обработки	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	УправлениеФормойСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормойСервер()
	
	Если ЗначениеЗаполнено(Объект.ПользовательШаблон) Тогда
		ТаблицаДанных = КП_УправлениеПравамиДоступа.ДанныеПоДоступамПользователя(Объект.ПользовательШаблон);
		ТаблицаГруппДоступа.Загрузить(ТаблицаДанных);
	Иначе
		ТаблицаГруппДоступа.Очистить();
	КонецЕсли;
	
	GUID = Строка(Объект.Ссылка.УникальныйИдентификатор())
	
КонецПроцедуры 

#КонецОбласти