#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру полей папки форума
//
// Возвращаемое значение:
//   Структура
//     Наименование
//     Родитель
//     Описание
//     Ответственный
//     ДатаСоздания
//
Функция ПолучитьСтруктуруПапки() Экспорт
	
	СтруктураПапкиФорума = Новый Структура;
	СтруктураПапкиФорума.Вставить("Наименование");
	СтруктураПапкиФорума.Вставить("Родитель");
	СтруктураПапкиФорума.Вставить("Описание");
	СтруктураПапкиФорума.Вставить("Ответственный");
	СтруктураПапкиФорума.Вставить("ДатаСоздания");
	
	Возврат СтруктураПапкиФорума;
	
КонецФункции

// Создает и записывает в БД папку форума
//
// Параметры:
//   СтруктураПапкиФорума - Структура - структура полей папки форума.
//
// Возвращаемое значение:
//   СправочникСсылка.ПапкиФорума
//
Функция СоздатьПапку(СтруктураПапкиФорума) Экспорт
	
	НоваяПапкаФорума = СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НоваяПапкаФорума, СтруктураПапкиФорума);
	НоваяПапкаФорума.Записать();
	
	Возврат НоваяПапкаФорума.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
