//{{ *Олег Каратаев >>>>>>>>>>>>>>>>>>>>>>> ОПИСАНИЕ ИЗМЕНЕНИЙ >>>>>>>>>>>>>>>>>>>>>>>>>>>
// 
// ИЗМЕНЕННЫЕ СВОЙСТВА ОБЪЕКТА ОТСУТСТВУЮТ
// 
// НОВЫЕ/ИЗМЕНЕННЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//  * [Процедура]ОбработкаКоманды - изменено обращение на ОМ ЗадачиПользователя #TaskUsers
//
// ТЕГИ ИЗМЕНЕНИЙ
//  #TaskUsers
//   Типовой функционал все обращения делает к объекту ЗадачаИсполнителя, а в Купорос используется ЗадачиПользователя. 
//	 Во всех используемых местах делается замена на ЗадачиПользователя.
// 
//}} *Олег Каратаев <<<<<<<<<<<<<<<<<<<<<<< ОПИСАНИЕ ИЗМЕНЕНИЙ <<<<<<<<<<<<<<<<<<<<<<<<<<<

// Разделитель описания изменений общего модуля >> *Олег Каратаев
Функция ИзмененияОбщегоМодуля()

	Возврат Неопределено;	

КонецФункции // Конец Разделитель описания изменений общего модуля


///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

#КонецОбласти

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// { *Олег Каратаев [19.05.2012]
	ОткрытьФорму("Задача.ЗадачиПользователя.Форма.ФормаСписка",
		Новый Структура("ЗначениеОтбора", ПараметрКоманды),
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Источник.КлючУникальности,
			ПараметрыВыполненияКоманды.Окно);	
	
	//ОткрытьФорму("Задача.ЗадачаИсполнителя.Форма.ЗадачиПоПредмету",
	//	Новый Структура("ЗначениеОтбора", ПараметрКоманды),
	//		ПараметрыВыполненияКоманды.Источник,
	//		ПараметрыВыполненияКоманды.Источник.КлючУникальности,
	//		ПараметрыВыполненияКоманды.Окно);	
	// }
	
КонецПроцедуры
