#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
	
		// Свойства
		УправлениеСвойствами.ПередЗаписьюВидаОбъекта(ЭтотОбъект, "Задача_ЗадачиПользователя", "НаборСвойств");
		// Конец Свойства
	
	КонецЕсли;
	
	Если ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
		Актуальность = Не ПометкаУдаления;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения)
		И ДанныеЗаполнения.Свойство("Родитель")
		И СтандартныеПодсистемыСервер.ЭтоПредопределенныеДанные(ДанныеЗаполнения.Родитель) Тогда
		// Обнуляем родитель, если он предопределенный.
		ДанныеЗаполнения.Родитель = "";	
	КонецЕсли;
	
	Если ДанныеЗаполнения = Неопределено Тогда // Ввод нового.
	
		СтандартныеПодсистемыКупорос.ПриВводеНовогоЗаполнитьОрганизацию(ЭтотОбъект);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
