

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 // Заполнение существующих уже данных из регистра "ТелеграмНастройкиПользователей".
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	*
	 |ИЗ
	 |	РегистрСведений.ТелеграмНастройкиПользователей КАК ТелеграмНастройкиПользователей
	 |ГДЕ
	 |	ТелеграмНастройкиПользователей.Бот = &Бот
	 |	И ТелеграмНастройкиПользователей.ИдентификаторЧата = &ИдентификаторЧата";
	 
	 Запрос.УстановитьПараметр("Бот", Запись.Бот);
	 Запрос.УстановитьПараметр("ИдентификаторЧата", Запись.ИдентификаторЧата);
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 
	 	  ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
	 
	 КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Фиксация изменений по данным для регистра "ТелеграмНастройкиПользователей".
	МенеджерЗаписи = РегистрыСведений.ТелеграмНастройкиПользователей.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Бот = Запись.Бот;
	МенеджерЗаписи.ИдентификаторЧата = Запись.ИдентификаторЧата;
	МенеджерЗаписи.Прочитать();
	Если Не МенеджерЗаписи.Выбран() Тогда
		// новый
		МенеджерЗаписи.Бот = Запись.Бот;
		МенеджерЗаписи.ИдентификаторЧата = Запись.ИдентификаторЧата;
	КонецЕсли;
	// обновляем данные
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЭтаФорма);
	
	МенеджерЗаписи.Записать();	
	
КонецПроцедуры

