#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция БотДляОтправкиСообщенийЗадачПоУмолчанию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТелеграмБоты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТелеграмБоты КАК ТелеграмБоты
	|ГДЕ
	|	ТелеграмБоты.ИспользоватьДляОтправкиСообщенийЗадач
	|	И НЕ ТелеграмБоты.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Возврат Выборка.Ссылка;
	
	КонецЕсли;
	
	Возврат Справочники.ТелеграмБоты.ПустаяСсылка();
	
КонецФункции // БотДляОтправкиСообщенийЗадачПоУмолчанию()

#КонецОбласти

#КонецЕсли
