
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗадачуВИзбранное(Задача, Исполнитель = Неопределено) Экспорт
	
	МенеджерЗаписи = МенеджерЗаписиПоЗадаче(Задача, Исполнитель);
	МенеджерЗаписи.ВИзбранном = Истина;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура УдалитьЗадачуИзИзбранного(Задача, Исполнитель = Неопределено) Экспорт
	
	МенеджерЗаписи = МенеджерЗаписиПоЗадаче(Задача, Исполнитель);
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МенеджерЗаписиПоЗадаче(Задача, Знач Исполнитель)
	
	Если Исполнитель = Неопределено Тогда
		
		Исполнитель = Пользователи.ТекущийПользователь();
		
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.Исполнитель = Исполнитель;
	
	Возврат МенеджерЗаписи;
	
КонецФункции

#КонецОбласти

#КонецЕсли
