#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользуемоеИмяФайла = РеквизитФормыВЗначение("Объект").ИспользуемоеИмяФайла;
	
	Файл = Новый Файл(ИспользуемоеИмяФайла);
	Путь = Файл.Путь;
	
	//Путь = "s:\END_USER\1C\Купорос\УправлениеДоступомПользователей\"; // Используем абсолютный путь где искать расширение.
	
	ПредставлениеРасширения = "Купорос: Управление доступом пользователей";
	
	ВерсияНовогоРасширения = "1.0.1.2";
    ВерсияРасширения = ВерсияНовогоРасширения;  
	
	ТребуемаяВерсияПлатформы = "8.3.18";
	ТребуемаяВерсияБСП = "2.3";
	ТребуемыйРежимСовместимости = "8.3.14";

	ОбновитьДанныеУстановленного();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Заголовок = "Установщик " + ПредставлениеРасширения;
	
	ТекущийШаг = 1;
	ОбновитьЭлементыФормы();
	
	Если РежимПакетнойУстановки() Тогда 
		
		ВозможнаУстановка = ПакетнаяУстановка();
		Если Не ВозможнаУстановка Тогда
			
			ЗаписатьЛогПакетнойУстановки();
			ЗавершитьРаботуСистемы(Ложь);
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрименитьИзмененияНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗавершитьРаботуСистемы(Ложь, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДомашняяСтраница(Команда)
	
	ПерейтиПоНавигационнойСсылке("https://u.krastsvetmet.ru/profile/AqoutGzKSJp5yko");
	
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда = Неопределено)
	
	НачатьОперацию(НСтр("ru = 'Установка'; en = 'Installation'"), "ПодключаемыйУстановка");

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда = Неопределено)
	
	НачатьОперацию(НСтр("ru = 'Обновление'; en = 'Update'"), "ПодключаемыйОбновить");
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	НачатьОперацию(НСтр("ru = 'Удаление'; en = 'Removing'"), "ПодключаемыйУдаление");

КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	ОбновитьДанныеУстановленного();
	
	ТекущийШаг = 1;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Если ТекущийШаг = 1 Тогда
		
		ТекущаяСтраница = Элементы.СтраницаНачальная;
		
	Иначе
		
		ТекущаяСтраница = Элементы.СтраницаРезультатУстановки;
		
	КонецЕсли;
	Элементы.Страницы.ТекущаяСтраница = ТекущаяСтраница;
	
	ИмеютсяКритичныеТребования = ИмеютсяКритичныеТребования();
	
	Элементы.УстановленныхВерсийНет.Видимость = Не УстановленоРасширение;
	Элементы.УстановленнаяВерсия.Видимость = УстановленоРасширение;
	
	Элементы.Назад.Видимость = (ТекущийШаг > 1);
	Элементы.Установить.Видимость = Не УстановленоРасширение И (ТекущийШаг = 1);
	Элементы.Обновить.Видимость = ДоступноОбновление() И (ТекущийШаг = 1);
	Элементы.Удалить.Видимость = УстановленоРасширение И (ТекущийШаг = 1);
	
	Если ДоступноОбновление() Тогда
		
		КнопкаПоУмолчанию = Элементы.Обновить;
		
	Иначе
		
		КнопкаПоУмолчанию = Элементы.Установить;
		
	КонецЕсли;
	
	КнопкаПоУмолчанию.КнопкаПоУмолчанию = Истина;
	КнопкаПоУмолчанию.Доступность = НЕ ИмеютсяКритичныеТребования;
	
	Элементы.ТабличныйДокументИдетОперация.Видимость = ИдетОперация;
	ОтображениеСостояния = Элементы.ТабличныйДокументИдетОперация.ОтображениеСостояния;
	ОтображениеСостояния.Видимость = Истина;
	ОтображениеСостояния.Картинка = Элементы.ДлительнаяОперация.Картинка;
	ОтображениеСостояния.Текст = Операция;
	
	Элементы.РезультатОперации.Видимость = Не ИдетОперация;
	Элементы.ГруппаПрименитьИзменения.Видимость = ЕстьИзмененияОжидающиеПрименения;

КонецПроцедуры

&НаКлиенте
Функция ИмеютсяКритичныеТребования()
	
	Результат = Ложь;
	Для Каждого СтрокаТребование Из Информация.ПолучитьЭлементы() Цикл 
		
		Если СтрокаТребование.Критичное Тогда
			
			Результат = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеУстановленного()
	
	Расширение = НашеУстановленноеРасширение();
	УстановленоРасширение = (Расширение <> Неопределено);
	Если УстановленоРасширение Тогда
		
		УстановленнаяВерсия = Расширение.Версия;
		ИмяУстановленнойВерсии = Расширение.Имя;
		
	КонецЕсли;
	
	НайденныеРасширения = РасширенияКонфигурации.Получить(Новый Структура("Имя", "УправляемаяКонсольОтчетов"));
	УстановленоРасширениеУправляемаяКонсольОтчетов = ЗначениеЗаполнено(НайденныеРасширения);
	
	ПроверитьТребованияУстановки();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьТребованияУстановки()
	
	Информация.ПолучитьЭлементы().Очистить();
	
	// Проверка платформы
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ВерсияПлатформы = СистемнаяИнформация.ВерсияПриложения;
	
	ДопустимаяВерсияПлатформы = (СравнениеВерсий(ВерсияПлатформы, ТребуемаяВерсияПлатформы) <> -1);
	Если Не ДопустимаяВерсияПлатформы Тогда
		
		Шаблон = НСтр("ru = 'Требуется платформа не ниже: %1'; en = 'Requires a platform of at least %1'");
		ДобавитьСтрокуТребование(СтрШаблон(Шаблон, ТребуемаяВерсияПлатформы), Элементы.КритичноеПредупреждение.Картинка, Истина);
		
	КонецЕсли;
	
	// Проверка режима совместимости
	РежимСовместимостиКонфигурации = Метаданные.РежимСовместимости;
	Если РежимСовместимостиКонфигурации = Метаданные.СвойстваОбъектов.РежимСовместимости.НеИспользовать Тогда
		
		РежимСовместимостиКонфигурации = "";
		
	Иначе
		
		РежимСовместимостиКонфигурации = СтрЗаменить(РежимСовместимостиКонфигурации, "Версия", "");
		РежимСовместимостиКонфигурации = СтрЗаменить(РежимСовместимостиКонфигурации, "_", ".");
		
	КонецЕсли;
	
	Если Не ДопустимыйРежимСовместимости(ТребуемыйРежимСовместимости) Тогда
		
		Шаблон = НСтр("ru = 'Требуется режим совместимости конфигурации не ниже: %1'; en = 'Requires a configuration compatibility mode of at least %1'");
		ДобавитьСтрокуТребование(СтрШаблон(Шаблон, ТребуемыйРежимСовместимости), Элементы.КритичноеПредупреждение.Картинка, Истина);
		
	КонецЕсли;
	
	// Проверка включена защита от опасных действий
	Если ПользователиИнформационнойБазы.ТекущийПользователь().ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях Тогда
		
		ДобавитьСтрокуТребование(НСтр("ru = 'Включена защита от опасных действий, рекомендуется отключить';
										|en = 'Protection against dangerous actions is enabled, it is recommended to disable'"),
										Элементы.ИнформацияУстановки.Картинка);
	КонецЕсли;
	
	// Проверка БСП
	УстановленнаяБСП = УстановленнаяБСП();
	Если УстановленнаяБСП.Установлена Тогда
		
		Если НЕ УстановленнаяБСП.Совместима Тогда
			
			Родитель = ДобавитьСтрокуТребование(НСтр("ru = 'Установленная библиотека стандартных подсистем (БСП) не совместима';
													|en = 'The library of standard subsystems (SSL) is not compatible'"),
										Элементы.ВажноеПредупреждение.Картинка);
			// Добавим проблемы совместимости							
			Для Каждого ПроблемаСовместимости Из УстановленнаяБСП.Проблемы Цикл 
											
				ДобавитьСтрокуТребование(ПроблемаСовместимости.Представление, Элементы.ВажноеПредупреждение.Картинка, , Родитель);
				
			КонецЦикла;							
										
		КонецЕсли;
		
	Иначе
		
		ДобавитьСтрокуТребование(НСтр("ru = 'Библиотека стандартных подсистем (БСП) не установлена';
									|en = 'The library of standard subsystems (SSL) is not installed'"),
										Элементы.ВажноеПредупреждение.Картинка);
		
	КонецЕсли;
	
	// Проверка установлена Управляемая консоль отчетов
	Если УстановленоРасширениеУправляемаяКонсольОтчетов Тогда
		
		ДобавитьСтрокуТребование(НСтр("ru = 'Установлено расширение ""Управляемая консоль отчетов"" рекомендуется не использовать';
										|en = 'The ""Managed Reporting Console"" extension is installed. It is recommended not to use'"),
										Элементы.ИнформацияУстановки.Картинка);
										
	КонецЕсли;
									
	ДобавитьСтрокуТребование(НСтр("ru = 'Расширение устанавливается с отключенными безопасным режимом и защитой от опасных действий';
								|en = 'The extension is installed with disabled safe mode and protection against dangerous actions'"),
								Элементы.ИнформацияУстановки.Картинка);
								
	ДобавитьСтрокуТребование(НСтр("ru = 'Не изменяет структуру данных'; en = 'Does not change data structure'"),
								Элементы.ИнформацияУстановки.Картинка);
	
КонецПроцедуры

&НаСервере
Функция ДобавитьСтрокуТребование(Представление, Картинка, Критичное = Ложь, Родитель = Неопределено)
	
	Если Родитель = Неопределено Тогда
		Родитель = Информация;
	КонецЕсли;
	
	НоваяСтрока = Родитель.ПолучитьЭлементы().Добавить();
	НоваяСтрока.Критичное = Критичное;
	НоваяСтрока.Картинка = Картинка;
	НоваяСтрока.Представление = Представление;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Процедура НачатьОперацию(Представление, ИмяОбработчика)
	
	ТекущийШаг = 2;
	ИдетОперация = Истина;
	Операция = Представление;
	
	ОбновитьЭлементыФормы();
	
	ПодключитьОбработчикОжидания(ИмяОбработчика, 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьРезультатОперации(Результат)
	
	РезультатОперации.Очистить();
	
	Если ЗначениеЗаполнено(Результат) Тогда 
		
		ДобавитьСтрокуВРезультат(Результат, Элементы.КритичноеПредупреждение.Картинка);
		
	Иначе
		
		ЕстьИзмененияОжидающиеПрименения = Истина;
		
		Шаблон = НСтр("ru = 'Операция: %1, выполнена успешно'; en = 'Operation: %1 completed successfully'");
		ДобавитьСтрокуВРезультат(СтрШаблон(Шаблон, Операция), Элементы.ВыполненоУспешно.Картинка);
		
	КонецЕсли;
	
	Если РежимПакетнойУстановки() Тогда
		
		ЗаписатьЛогПакетнойУстановки();
		ЗавершитьРаботуСистемы(Ложь);
		
	КонецЕсли;
	
	ИдетОперация = Ложь;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйУдаление() Экспорт
	
	Результат = УдалитьРасширение();
	ОтобразитьРезультатОперации(Результат);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УдалитьРасширение()
	
	Результат = Неопределено;
	
	Расширение = НашеУстановленноеРасширение();
	Если Расширение <> Неопределено Тогда
		
		Попытка
			
			Расширение.Удалить();
			
		Исключение
			
			Результат = ИнформацияОбОшибке().КраткоеПредставление;;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодключаемыйУстановка() Экспорт
	
	ЗагрузитьРасширение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершенПоискФайлов(НайденныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(НайденныеФайлы) Тогда
		
		ДанныеРасширения = Новый ДвоичныеДанные(НайденныеФайлы[0].ПолноеИмя);
		Результат = УстановитьРасширение(ДанныеРасширения, ДополнительныеПараметры.Обновление);
		
	Иначе
		
		Шаблон = НСтр("ru = 'В поставке не найден файл: %1'; en = 'File not found in delivery: %1'");
		Результат = СтрШаблон(Шаблон, ДополнительныеПараметры.Маска);
		
	КонецЕсли;
	
	ОтобразитьРезультатОперации(Результат);
	
КонецПроцедуры

&НаСервере
Функция УстановитьРасширение(Данные, Обновление)
	
	Попытка
		
		Результат = Неопределено;
		
		Если Обновление Тогда
			Расширение = НашеУстановленноеРасширение();
		Иначе 
			Расширение = РасширенияКонфигурации.Создать();		
		КонецЕсли;
		
		Расширение.БезопасныйРежим = Ложь;
		
		ОписаниеЗащитыОтОпасныхДействий = Новый ОписаниеЗащитыОтОпасныхДействий;
		ОписаниеЗащитыОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
		Расширение.ЗащитаОтОпасныхДействий = ОписаниеЗащитыОтОпасныхДействий;
		
		Расширение.Записать(Данные);
		
	Исключение
		
		Результат = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодключаемыйОбновить() Экспорт
	
	ЗагрузитьРасширение(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВРезультат(Представление, Картинка)
	
	НоваяСтрока = РезультатОперации.Добавить();
	НоваяСтрока.Картинка = Картинка;
	НоваяСтрока.Представление = Представление
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СравнениеВерсий(Версия, ПроверяемаяВерсия)

	Если Не ЗначениеЗаполнено(Версия) Тогда
		Возврат -1;
	КонецЕсли;
	
	МассивВерсия = СтрРазделить(Версия, ".");
	МассивПроверяемаяВерсия = СтрРазделить(ПроверяемаяВерсия, ".");

	Результат = 0;
	Для Счетчик = 0 По МассивПроверяемаяВерсия.ВГраница() Цикл
		
		Если Число(МассивВерсия[Счетчик]) > Число(МассивПроверяемаяВерсия[Счетчик]) Тогда
			
			Результат = 1; 
			Прервать;
			
		ИначеЕсли Число(МассивВерсия[Счетчик]) < Число(МассивПроверяемаяВерсия[Счетчик]) Тогда
			
			Результат = -1;
			Прервать;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция НашеУстановленноеРасширение()
	
	ИменаРасширения = Новый Массив;
	ИменаРасширения.Добавить("УправлениеДоступомПользователей");
	
	Результат = Неопределено;
	
	Для Каждого ИмяРасширения Из ИменаРасширения Цикл 
		
		Отбор = Новый Структура("Имя", ИмяРасширения);
		НайденныеРасширения = РасширенияКонфигурации.Получить(Отбор);
		
		Если ЗначениеЗаполнено(НайденныеРасширения) Тогда
			
			Результат = НайденныеРасширения[0];
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьРасширение(Обновление = Ложь)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Обновление", Обновление);
	
	ИмяПродукта = ИмяПродукта();
	УстановленнаяБСП = УстановленнаяБСП();
	
	Если УстановленнаяБСП.Совместима Тогда
		
		Если УстановленнаяБСП.АнглийскаяВерсия Тогда
			ТипВерсии = "SSL_ENG";
		Иначе
			ТипВерсии = "SSL_RU";
		КонецЕсли;

	Иначе
		ТипВерсии = "NO_SSL";
	КонецЕсли;
	Маска = СтрШаблон("%1.cfe", ИмяПродукта);
	
	ДополнительныеПараметры.Вставить("Маска", Маска);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершенПоискФайлов", ЭтотОбъект, ДополнительныеПараметры);
	НачатьПоискФайлов(ОписаниеОповещения, Путь, Маска);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДопустимыйРежимСовместимости(ТребуемыйРежимСовместимости)
	
	РежимСовместимости = Метаданные.РежимСовместимости;
	Если РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.НеИспользовать Тогда
		
		Результат = Истина;
		
	Иначе
		
		РежимСовместимости = СтрЗаменить(РежимСовместимости, "Версия", "");
		РежимСовместимости = СтрЗаменить(РежимСовместимости, "Version", "");
		РежимСовместимости = СтрЗаменить(РежимСовместимости, "_", ".");
		
		Результат = (СравнениеВерсий(РежимСовместимости, ТребуемыйРежимСовместимости) <> -1);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьКомандуКонфигуратора1С(Команда, ДанныеСоединения = "")

	КаталогПрограммы = КаталогПрограммы();
	Конфигуратор = "1cv8.exe CONFIG ";
	
	ЗапуститьПриложение(СтрШаблон("%1 /DisableStartupDialogs %2 %3", Конфигуратор, ДанныеСоединения, Команда), КаталогПрограммы, Истина); 
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОбъектыРасширения(Путь, Объекты)
	
	// ConfigDumpInfo.xml
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ПолноеИмяXMLФайла = Путь + "\ConfigDumpInfo.xml";
	ТекстовыйДокумент.Прочитать(ПолноеИмяXMLФайла);
	НовыйТекст = ТекстовыйДокумент.ПолучитьТекст();
	
	Для Каждого ОписаниеОбъекта Из Объекты Цикл 
		
		ТипОбъекта = ОписаниеОбъекта.Значение;
		ИмяОбъекта = ОписаниеОбъекта.Представление;
		
		ИскомаяСтрока = СтрШаблон("%1.%2", ТипОбъекта, ИмяОбъекта);
		Индекс = СтрНайти(НовыйТекст, ИскомаяСтрока);
		Если ЗначениеЗаполнено(Индекс) Тогда
			
			НачалоСтроки = СтрНайти(НовыйТекст, Символы.ПС, НаправлениеПоиска.СКонца, Индекс);
			КонецСтроки = СтрНайти(НовыйТекст, Символы.ПС, , Индекс);
			
			НовыйТекст = Лев(НовыйТекст, НачалоСтроки) + Сред(НовыйТекст, КонецСтроки + 1);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстовыйДокумент.УстановитьТекст(НовыйТекст);
	ТекстовыйДокумент.Записать(ПолноеИмяXMLФайла);
	
	// Configuration.xml
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ПолноеИмяXMLФайла = Путь + "\Configuration.xml";
	ТекстовыйДокумент.Прочитать(ПолноеИмяXMLФайла);
	НовыйТекст = ТекстовыйДокумент.ПолучитьТекст();
	
	Для Каждого ОписаниеОбъекта Из Объекты Цикл 
	
		ТипОбъекта = ОписаниеОбъекта.Значение;
		ИмяОбъекта = ОписаниеОбъекта.Представление;
		
		НовыйТекст = СтрЗаменить(НовыйТекст, СтрШаблон("<%1>%2</%1>", ТипОбъекта, ИмяОбъекта), "");
		
		Если ТипОбъекта = "Language" И ИмяОбъекта = "Русский" Тогда
			НовыйТекст = СтрЗаменить(НовыйТекст, "<DefaultLanguage>Language.Русский</DefaultLanguage>", "<DefaultLanguage>Language.Английский</DefaultLanguage>");
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстовыйДокумент.УстановитьТекст(НовыйТекст);
	ТекстовыйДокумент.Записать(ПолноеИмяXMLФайла);
	
	// Удаление команд в подсистемах
	НайденныеФайлы = НайтиФайлы(Путь + "\Subsystems", "CommandInterface.xml", Истина);
	Для Каждого НайденныйФайл Из НайденныеФайлы Цикл 
		
		ПолноеИмяФайла = НайденныйФайл.ПолноеИмя;
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(ПолноеИмяФайла);
		НовыйТекст = ТекстовыйДокумент.ПолучитьТекст();
		
		Для Каждого ОписаниеОбъекта Из Объекты Цикл 
			
			ТипОбъекта = ОписаниеОбъекта.Значение;
			ИмяОбъекта = ОписаниеОбъекта.Представление;
			
			НачальныйБлок = СтрШаблон("<Command name=""%1.%2"">", ТипОбъекта, ИмяОбъекта);
			НачалоБлока = СтрНайти(НовыйТекст, НачальныйБлок);
			Если ЗначениеЗаполнено(НачалоБлока) Тогда
				
				КонечныйБлок = "</Command>";
				КонецБлока = СтрНайти(НовыйТекст, КонечныйБлок, , НачалоБлока);
				
				НовыйТекст = Лев(НовыйТекст, НачалоБлока - 1) + Сред(НовыйТекст, КонецБлока + СтрДлина(КонечныйБлок)+ 3);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТекстовыйДокумент.УстановитьТекст(НовыйТекст);
		ТекстовыйДокумент.Записать(ПолноеИмяФайла);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ИмяПродукта()
	
	Возврат "УправлениеДоступомПользователей";
	
КонецФункции

&НаСервере
Функция УстановленнаяБСП()
	
	Результат = Новый Структура;
	
	Установлена = Ложь;
	Совместима = Ложь;
	Версия = "";
	ИнтегрированаЧастично = Ложь;
	Проблемы = Новый СписокЗначений;
	
	ИмяМодуляСтандартныеПодсистемыСерверРусское = "СтандартныеПодсистемыСервер";
	ИмяМодуляСтандартныеПодсистемыСерверАнглийское = "StandardSubsystemsServer";
	
	ОбъектМодульСтандартныеПодсистемыСервер = Метаданные.ОбщиеМодули.Найти(ИмяМодуляСтандартныеПодсистемыСерверРусское);
	Если ОбъектМодульСтандартныеПодсистемыСервер <> Неопределено Тогда
		
		Установлена = Истина;
		АнглийскаяВерсия = Ложь;
		
	КонецЕсли;
	
	ОбъектМодульСтандартныеПодсистемыСервер = Метаданные.ОбщиеМодули.Найти(ИмяМодуляСтандартныеПодсистемыСерверАнглийское);
	Если ОбъектМодульСтандартныеПодсистемыСервер <> Неопределено Тогда
		
		Установлена = Истина;
		АнглийскаяВерсия = Истина;
		
	КонецЕсли;
	
	Если Установлена Тогда
		
		Если АнглийскаяВерсия Тогда 
			
			ИмяМодуляСтандартныеПодсистемыСервер = ИмяМодуляСтандартныеПодсистемыСерверАнглийское;
			ИмяМодуляПодключаемыеКоманды = "AttachableCommands";
			ИмяРолиАдминистраторСистемы = "SystemAdministrator";
			ИмяФункцииВерсияБиблиотеки = "LibraryVersion";
			
		Иначе
			
			ИмяМодуляСтандартныеПодсистемыСервер = ИмяМодуляСтандартныеПодсистемыСерверРусское;
			ИмяМодуляПодключаемыеКоманды = "ПодключаемыеКоманды";
			ИмяРолиАдминистраторСистемы = "АдминистраторСистемы";
			ИмяФункцииВерсияБиблиотеки = "ВерсияБиблиотеки";
			
		КонецЕсли;
		
		Версия = Вычислить(СтрШаблон("%1.%2()", ИмяМодуляСтандартныеПодсистемыСервер, ИмяФункцииВерсияБиблиотеки));
		
		Если Метаданные.ОбщиеМодули.Найти(ИмяМодуляПодключаемыеКоманды) = Неопределено Тогда
			
			Представление = НСтр("ru = 'Не интегрирован модуль ПодключаемыеКоманды'; en = 'AttachableCommands module not integrated'");
			ДобавитьПроблемуСовместимостиБСП(Проблемы, Представление);
			
		КонецЕсли;
		
		Если Метаданные.Роли.Найти(ИмяРолиАдминистраторСистемы) = Неопределено Тогда
			
			Представление = НСтр("ru = 'Не интегрирована роль АдминистраторСистемы'; en = 'SystemAdministrator role is not integrated'");
			ДобавитьПроблемуСовместимостиБСП(Проблемы, Представление);
			
		КонецЕсли;
		
		ИнтегрированаЧастично = ЗначениеЗаполнено(Проблемы);
		
		СовместимаяВерсия = (СравнениеВерсий(Версия, ТребуемаяВерсияБСП) <> -1);
		Если НЕ СовместимаяВерсия Тогда
			
			Представление = НСтр("ru = 'Требуется версия не ниже: %1'; en = 'Requires a version of at least: %1'");
			ДобавитьПроблемуСовместимостиБСП(Проблемы, Представление);
			
		КонецЕсли;
		
		Совместима = НЕ ИнтегрированаЧастично И СовместимаяВерсия;
		
	КонецЕсли;
	
	Результат.Вставить("Установлена", Установлена);
	Результат.Вставить("Версия", Версия);
	Результат.Вставить("Совместима", Совместима);
	Результат.Вставить("ИнтегрированаЧастично", ИнтегрированаЧастично);
	Результат.Вставить("Проблемы", Проблемы);
	Результат.Вставить("АнглийскаяВерсия", АнглийскаяВерсия);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьПроблемуСовместимостиБСП(Проблемы, Представление)
	
	Проблемы.Добавить( , Представление);
	
КонецПроцедуры

&НаКлиенте
Функция ОграниченнаяВерсияТуллкит()
	
КонецФункции

&НаКлиенте
Функция РежимПакетнойУстановки() Экспорт
	
	Возврат СтрНайти(ВРег(ПараметрЗапуска), КлючПакетнойУстановки());
	
КонецФункции

&НаКлиенте
Функция ДоступноОбновление() Экспорт
	

	Результат = УстановленоРасширение;
	
	//Результат = УстановленоРасширение
	//						И ((СравнениеВерсий(ВерсияРасширения, УстановленнаяВерсия) = 1)
	//								ИЛИ (ВерсияРасширения = УстановленнаяВерсия
	//										И СтрЗаканчиваетсяНа(ИмяУстановленнойВерсии, "ADMIN")
	//										И СтрЗаканчиваетсяНа(ПредставлениеРасширения, "PROF"))
	//								ИЛИ (ВерсияРасширения = УстановленнаяВерсия
	//										И СтрЗаканчиваетсяНа(ИмяУстановленнойВерсии, "PROF")
	//										И СтрЗаканчиваетсяНа(ПредставлениеРасширения, "CORP")));
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПакетнаяУстановка()
	
	Если ИмеютсяКритичныеТребования() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДоступноОбновление() Тогда
		Обновить();
	Иначе
		
		Если УстановленоРасширение Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Установить();
		
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КлючПакетнойУстановки()
	
	Возврат "ITK_AUTOINSTALL";
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьЛогПакетнойУстановки()
	
	Индекс = СтрНайти(ПараметрЗапуска, КлючПакетнойУстановки());
	НачальныйИндекс = Индекс + СтрДлина(КлючПакетнойУстановки());
	
	ИндексНачала = Неопределено;
	ИндексКонца = Неопределено;
	Для Индекс = НачальныйИндекс По СтрДлина(ПараметрЗапуска) Цикл 
		
		Символ = Сред(ПараметрЗапуска, Индекс, 1);
		
		Если ИндексНачала = Неопределено
				И Символ = "/" Тогда
			Прервать;
		КонецЕсли;
		
		Если ИндексНачала = Неопределено
				И Символ = """" Тогда
				
			ИндексНачала = Индекс;
			Продолжить;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИндексНачала)
				И Символ = """" Тогда
				
			ИндексКонца = Индекс;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИндексНачала = Неопределено
			ИЛИ ИндексКонца = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		ПолноеИмяФайлаЛога = Сред(ПараметрЗапуска, ИндексНачала + 1, ИндексКонца - ИндексНачала - 1); 
		ЗаписьТекста = Новый ЗаписьТекста(ПолноеИмяФайлаЛога);
		
		Для Каждого Строка Из РезультатОперации Цикл 
			ЗаписьТекста.ЗаписатьСтроку(Строка.Представление);
		КонецЦикла;
		
		Для Каждого Строка Из Информация.ПолучитьЭлементы() Цикл 
			
			Если НЕ Строка.Критичное Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаписьТекста.ЗаписатьСтроку(Строка.Представление);
			
		КонецЦикла;
		
		ЗаписьТекста.Закрыть();
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуОбменСКупорос(Команда)
	
    //Помещаем обработку во временном хранилище
    АдресХранилища = "";
	ПутьКОбработке = СтрШаблон("%1%2", Путь, "ОбменСКупорос.epf");
	
	Результат = ПоместитьФайл(АдресХранилища, ПутьКОбработке, , Ложь);           
    ИмяОбработки = ПодключитьВнешнююОбработку(АдресХранилища);
    
    // Откроем форму подключенной внешней обработки
    ОткрытьФорму("ВнешняяОбработка."+ ИмяОбработки +".Форма");	
	
КонецПроцедуры

&НаСервере
Функция ПодключитьВнешнююОбработку(АдресХранилища)

    Возврат ВнешниеОбработки.Подключить(АдресХранилища,, Ложь);

КонецФункции  

&НаКлиенте
Процедура ЗагрузитьВоВнешниеОбработкиОбменСКупорос(Команда)
	
	ИмяФайла = СтрШаблон("%1%2", Путь, "ОбменСКупорос.epf");
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("ИмяФайла", "");
	ПараметрыРегистрации.Вставить("ПолноеИмя", ИмяФайла);
	ПараметрыРегистрации.Вставить("ЭтоОтчет", Неопределено);
	ПараметрыРегистрации.Вставить("ОтключатьКонфликтующие", Ложь);
	ПараметрыРегистрации.Вставить("ОтключатьПубликацию", Ложь);
	ПараметрыРегистрации.Вставить("Конфликтующие",  Новый СписокЗначений);
	ПараметрыРегистрации.Вставить("АдресДанныхОбработки", "");
	
	ФайлОбработки = Новый Файл(ИмяФайла);
	ПараметрыРегистрации.ИмяФайла = ФайлОбработки.Имя;
	РасширениеФайла = ВРег(ФайлОбработки.Расширение);
	Если РасширениеФайла = ".ERF" Тогда
		ПараметрыРегистрации.ЭтоОтчет = Истина;
	ИначеЕсли РасширениеФайла = ".EPF" Тогда
		ПараметрыРегистрации.ЭтоОтчет = Ложь;
	КонецЕсли;
	Попытка
		
		НачатьПомещениеФайла(Новый ОписаниеОповещения("ОкончаниеПомещенияВнешнейОбработки", ЭтотОбъект, ПараметрыРегистрации), ,ИмяФайла,Ложь, УникальныйИдентификатор);
		
	Исключение
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка помещения файла: %1.'"), ИмяФайла);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеПомещенияВнешнейОбработки(Результат, АдресДанныхОбработки, ВыбранноеИмяФайла, ПараметрыРегистрации) Экспорт
	
	РезультатПодключения = НСтр("ru = 'Не подключена'");
	
	Если Результат = Ложь Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка помещения файла хранилище: %1.'"), ВыбранноеИмяФайла);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	Иначе
		ПараметрыРегистрации.АдресДанныхОбработки = АдресДанныхОбработки;
		РезультатПодключения = ЗарегистрироватьОбработкуНаСервере(ПараметрыРегистрации);
	КонецЕсли;
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Результат подключения обработки: %1.'"), РезультатПодключения);
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
 КонецПроцедуры
  
&НаСервере
Функция ЗарегистрироватьОбработкуНаСервере(ПараметрыРегистрации)
	Перем Результат;
	Результат = "Успешно";  //По умолчанию успех.
	 
	//ПараметрыРегистрации.Вставить("КомандыСохраненные", Неопределено);
	// Вызов сервера
	РезультатРегистрации = ЗарегистрироватьОбработку(ПараметрыРегистрации);
	
	Если ПустаяСтрока(РезультатРегистрации.КраткоеПредставлениеОшибки) Тогда 

		// Обработка результата работы сервера
		Если РезультатРегистрации.Успех = Истина Тогда
			
			ЗаполнитьКомандыРегламентныеЗадания(РезультатРегистрации, РезультатРегистрации.КомандыСохраненные);

			РезультатРегистрации.ОбъектСправочника.ХранилищеОбработки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ПараметрыРегистрации.АдресДанныхОбработки), Новый СжатиеДанных(9));
			РезультатРегистрации.ОбъектСправочника.Записать();
			Возврат Результат;

		КонецЕсли;
	Иначе 
		Результат = РезультатРегистрации.КраткоеПредставлениеОшибки;

		// Разбор причины отказа загрузки обработки и отображение информации пользователю
		Если РезультатРегистрации.ИмяОбъектаЗанято = Ложь Тогда

			// Причина отказа в КраткоеПредставлениеОшибки
			Результат = РезультатРегистрации.КраткоеПредставлениеОшибки;

		ИначеЕсли РезультатРегистрации.Конфликтующие.Конфликтующие.Количество() > 0 Тогда 

			// Представление занявших объектов
			КоличествоКонфликтующих = РезультатРегистрации.Конфликтующие.Количество();
			ПредставлениеЗанявших = "";
			Для Каждого ЭлементСписка Из РезультатРегистрации.Конфликтующие Цикл
				ПредставлениеЗанявших = ПредставлениеЗанявших
				+ ?(ПредставлениеЗанявших = "", "", ", ")
				+ СокрЛП(ЭлементСписка.Представление);
				Если СтрДлина(ПредставлениеЗанявших) > 80 Тогда
					ПредставлениеЗанявших = Лев(ПредставлениеЗанявших, 70)
					+ "... ("
					+ Формат(КоличествоКонфликтующих, "ЧН=0; ЧГ=")
					+ " "
					+ НСтр("ru = 'шт'")
					+ ")";
					Прервать;
				КонецЕсли;
			КонецЦикла;

			Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Имя ""%1"" уже занято другими дополнительными отчетами (обработками):
					|%2.'"),
				РезультатРегистрации.ИмяОбъекта,
				ПредставлениеЗанявших
			);

		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
 КонецФункции

&НаСервере
Функция ЗарегистрироватьОбработку(ПараметрыРегистрации)

	СсылкаСправочника = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяФайла", ПараметрыРегистрации.ИмяФайла);
	Если СсылкаСправочника.Пустая() Тогда
		ОбъектСправочника = Справочники.ДополнительныеОтчетыИОбработки.СоздатьЭлемент();
		ОбъектСправочника.Заполнить(Неопределено);
		ОбъектСправочника.ИспользоватьДляФормыОбъекта = Истина;
		ОбъектСправочника.ИспользоватьДляФормыСписка  = Истина;
	Иначе
		ОбъектСправочника = СсылкаСправочника.ПолучитьОбъект();
	КонецЕсли;
	
	КомандыСохраненные = ОбъектСправочника.Команды.Выгрузить();

	Результат = ДополнительныеОтчетыИОбработки.ЗарегистрироватьОбработку(ОбъектСправочника, ПараметрыРегистрации);
	АдресРазрешений = ПоместитьВоВременноеХранилище(ОбъектСправочника.Разрешения.Выгрузить());

	Результат.Вставить("ОбъектСправочника", ОбъектСправочника);
	Результат.Вставить("КомандыСохраненные", КомандыСохраненные);

	Возврат Результат;

КонецФункции

&НаСервере
Процедура ЗаполнитьКомандыРегламентныеЗадания(РезультатРегистрации, КомандыСохраненные = Неопределено)
	
	РезультатРегистрации.ОбъектСправочника.Команды.Сортировать("Представление");
	
	ВидДополнительнаяОбработка = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ВидДополнительныйОтчет = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
		
	Для Каждого ЭлементКоманда Из РезультатРегистрации.ОбъектСправочника.Команды Цикл
		
		Если РезультатРегистрации.ОбъектСправочника.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка
			И (ЭлементКоманда.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.ВызовСерверногоМетода
			ИЛИ ЭлементКоманда.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.СценарийВБезопасномРежиме) Тогда
			
			РегламентноеЗаданиеGUID = ЭлементКоманда.РегламентноеЗаданиеGUID;
			Если КомандыСохраненные <> Неопределено Тогда
				НайденнаяСтрока = КомандыСохраненные.Найти(ЭлементКоманда.Идентификатор, "Идентификатор");
				Если НайденнаяСтрока <> Неопределено Тогда
					РегламентноеЗаданиеGUID = НайденнаяСтрока.РегламентноеЗаданиеGUID;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(РегламентноеЗаданиеGUID) Тогда
				ЭлементКоманда.РегламентноеЗаданиеGUID = РегламентноеЗаданиеGUID;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

