
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВладелецФайлов = Параметры.ВладелецФайла;
	ЗакрыватьПриВыборе = Параметры.ЗакрыватьПриВыборе;
	
	ДобавитьИзображенияВСписокЗначений();
	
	Если Параметры.АдресКартинки<>"" Тогда
		КартинкаПоУмолчанию = ПолучитьИзВременногоХранилища(Параметры.АдресКартинки);
		АктивныйЭлемент = СписокИзображений.НайтиПоЗначению(КартинкаПоУмолчанию);
		Если АктивныйЭлемент<>Неопределено Тогда
			Элементы.СписокИзображений.ТекущаяСтрока = АктивныйЭлемент.ПолучитьИдентификатор(); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокИзображенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработкаВыбораЗначения();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаВыбораЗначения()
	
	Если Элементы.СписокИзображений.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СписокИзображений.ТекущиеДанные;
	
	ОповеститьОВыборе(ТекущиеДанные.Значение);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьИзображенияВСписокЗначений() 
	
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_БлокПитания,"Блок питания",,БиблиотекаКартинок.Набор_БлокПитания);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_Картинка1С,"1С:Предприятие",,БиблиотекаКартинок.Набор_Картинка1С);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_USB1C,"USB 1C",,БиблиотекаКартинок.Набор_USB1C);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_Клавиатура,"Клавиатура",,БиблиотекаКартинок.Набор_Клавиатура);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_Лицензия,"Лицензия",,БиблиотекаКартинок.Набор_Лицензия);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_Монитор,"Монитор",,БиблиотекаКартинок.Набор_Монитор);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_LED,"LED",,БиблиотекаКартинок.Набор_LED);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_МФУ,"МФУ",,БиблиотекаКартинок.Набор_МФУ);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_Мышь,"Мышь",,БиблиотекаКартинок.Набор_Мышь);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_Ноутбук,"Ноутбук",,БиблиотекаКартинок.Набор_Ноутбук);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_Планшет,"Планшет",,БиблиотекаКартинок.Набор_Планшет);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_Полка,"Полка",,БиблиотекаКартинок.Набор_Полка);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_Принтер,"Принтер",,БиблиотекаКартинок.Набор_Принтер);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_ПрограммноеОбеспечение,"Программное обеспечение",,БиблиотекаКартинок.Набор_ПрограммноеОбеспечение);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_РабочееМесто,"Рабочее место",,БиблиотекаКартинок.Набор_РабочееМесто);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_СерверныйШкаф,"Серверный шкаф",,БиблиотекаКартинок.Набор_СерверныйШкаф);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_СетевоеОборудование,"Сетевое оборудование",,БиблиотекаКартинок.Набор_СетевоеОборудование);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_СистемныйБлок,"Системный блок",,БиблиотекаКартинок.Набор_СистемныйБлок);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_Сканер,"Сканер",,БиблиотекаКартинок.Набор_Сканер);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_Склад,"Склад",,БиблиотекаКартинок.Набор_Склад);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_СкладРасходныхМатериалов,"Склад расходных материалов",,БиблиотекаКартинок.Набор_СкладРасходныхМатериалов);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_СкладРемонта,"Склад ремонта",,БиблиотекаКартинок.Набор_СкладРемонта);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_ТВ,"ТВ",,БиблиотекаКартинок.Набор_ТВ);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_Телефон,"Телефон",,БиблиотекаКартинок.Набор_Телефон);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_ТонкийКлиент,"Тонкий клиент",,БиблиотекаКартинок.Набор_ТонкийКлиент);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_Шкаф,"Шкаф",,БиблиотекаКартинок.Набор_Шкаф);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_USB1,"USB №1",,БиблиотекаКартинок.Набор_USB1);
	СписокИзображений.Добавить(БиблиотекаКартинок.Набор_USB2,"USB №2",,БиблиотекаКартинок.Набор_USB2);
	
КонецПроцедуры

#КонецОбласти

