
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресТаблицаСгруппированныхДанных") Тогда
	
		ТаблицаЗадач = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицаСгруппированныхДанных); 
		
		ИсполнителиЗадач.Загрузить(ТаблицаЗадач);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УдалитьЗадачиПоИсполнителю(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ТипОбработки", "УдалитьЗадачиПоИсполнителю");
	ПараметрыЗакрытия.Вставить("АдресСписокОтмеченныхИсполнителей", СписокОтмеченныхИсполнителей());
	
	Закрыть(ПараметрыЗакрытия);	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТолькоПовторяемые(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ТипОбработки", "УдалитьТолькоПовторяемые");
	ПараметрыЗакрытия.Вставить("АдресСписокОтмеченныхИсполнителей", СписокОтмеченныхИсполнителей());
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНеВходящихВКомандуСпринта(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ТипОбработки", "УдалитьНеВходящихВКомандуСпринта");
	ПараметрыЗакрытия.Вставить("АдресСписокОтмеченныхИсполнителей", СписокОтмеченныхИсполнителей());
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СписокОтмеченныхИсполнителей()
	
	ПараметрыОтбора = Новый Структура("Отметка", Истина);
	
	СписокОтмеченных = ИсполнителиЗадач.Выгрузить(ПараметрыОтбора).ВыгрузитьКолонку("Исполнитель");
	
	АдресСписокОтмеченных = ПоместитьВоВременноеХранилище(СписокОтмеченных);
		
	Возврат АдресСписокОтмеченных;
	
КонецФункции

#КонецОбласти
