
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("КП_ВнешнееУправлениеДоступом") Тогда
		ВызватьИсключение НСтр("ru = 'Не установлено расширение ""УправлениеДоступомПользователей"" из поставки 1С:Купорос.'");
	КонецЕсли;
	
	МодульОбщегоНазначенияКупорос = ОбщегоНазначения.ОбщийМодуль("КП_ОбщегоНазначенияКупорос");
	ВерсияРасширения = МодульОбщегоНазначенияКупорос.ВерсияРасширения();
	
	ПараметрыПодсистемы = РегистрыСведений["КП_ПараметрыСистемыУправленияДоступомПользователей"].Параметры();
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыПодсистемы);
	
	ПроверкаПодключенияККупоросНаСервере();
	
	ЗаполнитьТаблицуПользователи();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РезультатПодключенияВыводСообщения();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверкаПодключенияККупорос(Команда)
	
	ПроверкаПодключенияККупоросНаСервере();
	
	РезультатПодключенияВыводСообщения();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПараметры(Команда)
	
	СохранитьПараметрыНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Параметры успешно обновлены.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеАктуальногоСпискаПользователейТекущийИС(Команда)
	ФормированиеАктуальногоСпискаПользователейТекущийИСНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДоступаПользователей(Команда)
	ОбновлениеДоступаПользователейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтключениеДоступаНеВходящимВТекущуюИС(Команда)
	ОтключениеДоступаНевходящимВТекущуюИСНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаАктуальныхШаблоновДоступа(Команда)
	ВыгрузкаАктуальныхШаблоновДоступаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	
	// TODO: Переделать
	Возврат;
	
	СохранитьИзмененияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТестОтправкиСообщенияVKTeams(Команда)
	ТестОтправкиСообщенияVKTeamsНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКП_ПользователиТекущейИС(Команда)
	
	ПерейтиПоНавигационнойСсылке("e1cib/list/Справочник.КП_ПользователиТекущейИС");	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКП_ШаблоныДоступаПользователей(Команда)
	
	ПерейтиПоНавигационнойСсылке("e1cib/list/Справочник.КП_ШаблоныДоступаПользователей");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКП_ПараметрыСистемыУправленияДоступомПользователей(Команда)
	
	ПерейтиПоНавигационнойСсылке("e1cib/list/РегистрСведений.КП_ПараметрыСистемыУправленияДоступомПользователей");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКП_ИсключенныеПользователиИзОбработки(Команда)
	
	ПерейтиПоНавигационнойСсылке("e1cib/list/РегистрСведений.КП_ИсключенныеПользователиИзОбработки");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаПравДоступаИзКупорос(Команда)
	
	ЗагрузкаПравДоступаИзКупоросНаСервере();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеПравДоступаПользователей(Команда)
	ОбновлениеПравДоступаПользователейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПользователей(Команда)
	
	ЗаполнитьТаблицуПользователи();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьПараметрыНаСервере()

	МенеджерЗаписи = РегистрыСведений["КП_ПараметрыСистемыУправленияДоступомПользователей"].СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЭтаФорма);
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаПодключенияККупоросНаСервере()
	
	Если Не ЗначениеЗаполнено(ИД_ТекущейСистемы) Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(АдресВебСервисаКупорос) Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбменДаннымиКупорос = ОбщегоНазначения.ОбщийМодуль("КП_ОбменДаннымиКупорос");
	Попытка
		
		РезультатПодключения = МодульОбменДаннымиКупорос.ПроверкаПодключенияККупорос();
		
	Исключение
		
		РезультатПодключения = Ложь;
		
		ТекстОшибкиПодключения = НСтр("ru = 'Ошибка подключения к веб-сервису Купорос. 
                            |%1'"); 
		ТекстОшибкиПодключения = СтрШаблон(ТекстОшибкиПодключения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Если РезультатПодключения Тогда
		НоваяВерсия = МодульОбменДаннымиКупорос.НоваяВерсия();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ФормированиеАктуальногоСпискаПользователейТекущийИСНаСервере()
	
	МодульОбменДаннымиКупорос = ОбщегоНазначения.ОбщийМодуль("КП_ОбменДаннымиКупорос");
	МодульОбменДаннымиКупорос.ФормированиеАктуальногоСпискаПользователейТекущийИС();
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Данные успешно обработаны.%1'"), "");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ОбновлениеДоступаПользователейНаСервере()
	
	Сообщения = "";
	
	МодульОбменДаннымиКупорос = ОбщегоНазначения.ОбщийМодуль("КП_УправлениеПравамиДоступа");
	МодульОбменДаннымиКупорос.ОбработкаПользователейНаДоступ(ТолькоИнформацияНаДоступПользователей, Сообщения);
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Данные успешно обработаны.%1'"), "");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры

&НаСервере
Процедура ОтключениеДоступаНеВходящимВТекущуюИСНаСервере()
	
	Сообщения = "";
	
	МодульОбменДаннымиКупорос = ОбщегоНазначения.ОбщийМодуль("КП_УправлениеПравамиДоступа");
	МодульОбменДаннымиКупорос.ОтключениеДоступаНевходящимВТекущуюИС(Истина, Сообщения);
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Данные успешно обработаны.%1'"), "");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПользователи()
	
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	Пользователи.Ссылка КАК Пользователь,
	                 |	Пользователи.Недействителен КАК Недействителен,
	                 |	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ,
	                 |	ЛОЖЬ КАК АутентификацияСтандартная,
	                 |	ЛОЖЬ КАК АутентификацияОС,
	                 |	ЛОЖЬ КАК АутентификацияOpenIDConnect,
	                 |	""                                      "" КАК ПользовательОС,
	                 |	""                                      "" КАК Комментарий
	                 |ИЗ
	                 |	Справочник.Пользователи КАК Пользователи
	                 |ГДЕ
	                 |	НЕ Пользователи.ПометкаУдаления
	                 |
	                 |УПОРЯДОЧИТЬ ПО
	                 |	Пользователи.Наименование";
	  
	  //Запрос.Текст = СтрЗаменить(Запрос.Текст, "Пользователи.Недействителен КАК Недействителен", 
	  //	"Пользователи.Недействителен КАК Недействителен, Пользователи.КП_ТехническийПользователь КАК КП_ТехническийПользователь");
	  
	  Результат = Запрос.Выполнить();
	  Выборка = Результат.Выгрузить();
	  
	  Для каждого ТекСтрока Из Выборка Цикл
	  
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
			ТекСтрока.ИдентификаторПользователяИБ);	
		Если ПользовательИБ <> Неопределено Тогда
			//ТекСтрока.АутентификацияСтандартная = ПользовательИБ.АутентификацияСтандартная;
			ЗаполнитьЗначенияСвойств(ТекСтрока, ПользовательИБ);
		Иначе
			ТекСтрока.Комментарий = НСтр("ru = 'Пользователь ИБ не определен.'")
		КонецЕсли;	
	  
	  КонецЦикла;
	  
	  Пользователи.Загрузить(Выборка);

КонецПроцедуры 

&НаСервере
Процедура СохранитьИзмененияНаСервере()
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Изменить", Истина);
	
	НайденныеСтроки = Пользователи.НайтиСтроки(ПараметрыОтбора);
	
	Для каждого ТекСтрока Из НайденныеСтроки Цикл
	
		ОбъектДанных = ТекСтрока.Пользователь.ПолучитьОбъект();
		ОбъектДанных["КП_ТехническийПользователь"] = ТекСтрока.КП_ТехническийПользователь;
		ОбъектДанных.Записать();
		
		ТекСтрока.Изменить = Ложь;
		
	КонецЦикла;
	
	ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Сохранение выбранных пользователей успешно.'"));
	
КонецПроцедуры

&НаСервере
Процедура ТестОтправкиСообщенияVKTeamsНаСервере()
	
	МодульУправлениеБотомVKTeams = ОбщегоНазначения.ОбщийМодуль("КП_УправлениеБотомVKTeams");
   	МодульУправлениеБотомVKTeams.ОтправитьСообщение(VKTeams_ЧатИД, НСтр("ru = 'Тест сообщения из обработки.'"));

КонецПроцедуры

&НаСервере
Процедура ВыгрузкаАктуальныхШаблоновДоступаНаСервере()
	
	МодульОбменДаннымиКупорос = ОбщегоНазначения.ОбщийМодуль("КП_ОбменДаннымиКупорос");
	МодульОбменДаннымиКупорос.ОбработкаВыгрузкиАктуальныхШаблоновДоступа();
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Данные успешно обработаны.%1'"), "");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаПравДоступаИзКупоросНаСервере()
	
	МодульОбменДаннымиКупорос = ОбщегоНазначения.ОбщийМодуль("КП_ОбменДаннымиКупорос");
	МодульОбменДаннымиКупорос.ОбработкаЗагрузкаПравДоступа();
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Данные успешно обработаны.%1'"), "");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры 

&НаСервере
Процедура ОбновлениеПравДоступаПользователейНаСервере()
	
	МодульОбменДаннымиКупорос = ОбщегоНазначения.ОбщийМодуль("КП_УправлениеПравамиДоступа");
	МодульОбменДаннымиКупорос.ОбновлениеПравДоступаПользователей();
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Данные успешно обработаны.%1'"), "");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПодключенияВыводСообщения()

	ТекстСообщения = СтрШаблон(НСтр("ru = 'Результат подключения к Купорос: %1.'"), Формат(РезультатПодключения, "БЛ='Не подключается'; БИ=Успешно"));
	
	Если Не РезультатПодключения Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + ТекстОшибкиПодключения;
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры 

#КонецОбласти

