
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаголовокИзменен = Ложь;
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		Элементы.ПараметрыАдминистрированияИБ.Видимость = Ложь;
	КонецЕсли;
	
	ПользовательДокументооборот = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ИнтеграцияС1СДокументооборот", "Пользователь");
	
	УстановитьДоступностьПолейБизнесПроцессовИЗадач();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьИнтерфейс();
	
	АдресВебСервиса1СДокументооборотИзменен = Ложь;
	
	Если ЗаголовокИзменен Тогда
		СтандартныеПодсистемыКлиент.УстановитьРасширенныйЗаголовокПриложения();
		ЗаголовокИзменен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаголовокСистемыПриИзменении(Элемент)
	ЗаголовокИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьУправлениеСетьюПриИзменении(Элемент)
	
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьStoryMapПриИзменении(Элемент)
	
	// Если используется подсистема StoryMap, то необходимо включить использование учета конфигураций
	НаборКонстант.ИспользоватьУчетКонфигураций = ?(НаборКонстант.ИспользоватьStoryMap, Истина, НаборКонстант.ИспользоватьУчетКонфигураций);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПараметрыАдминистрированияИБ(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ПараметрыАдминистрированияПрограммы");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьДоступностьПолейБизнесПроцессовИЗадач()
	
	ИспользоватьБизнесПроцессыИЗадачи = Константы.ИспользоватьБизнесПроцессыИЗадачи.Получить();
	
	Элементы.БизнесПроцессыИЗадачиЗадание.Доступность = ИспользоватьБизнесПроцессыИЗадачи;
	
КонецПроцедуры

#КонецОбласти

