
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтображениеИнформацииНаФорме();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОтображениеИнформацииНаФорме();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПринадлежитКADПриИзменении(Элемент)
	
	ОтображениеИнформацииНаФорме();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Открытие формы быстрого создания пользователя (на основании данных из AD)
&НаКлиенте
Процедура СоздатьПользователяБазы(Команда)
	
	СписокПользователей = Новый СписокЗначений;
	СписокПользователей.Добавить(Объект.Ссылка);
	
	ПараметрыДанных = Новый Структура;
	ПараметрыДанных.Вставить("Пользователи", СписокПользователей);
	ПараметрыДанных.Вставить("ГруппаДоступа", ПредопределенноеЗначение("Справочник.ГруппыДоступа.ПустаяСсылка"));
	
	ОткрытьФорму("Справочник.СтруктураПредприятия.Форма.СозданиеПользователяБазы", ПараметрыДанных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтображениеИнформацииНаФорме()

	Если Объект.ПринадлежитКAD Тогда
		
		Элементы.ГруппаСвойстваAD.Доступность = Истина;
		
	Иначе
		
		Элементы.ГруппаСвойстваAD.Доступность = Ложь;
		
	КонецЕсли;	

КонецПроцедуры // ОтображениеИнформацииНаФорме()

#КонецОбласти

