
#Область ПрограммныйИнтерфейс

Функция ШаблонУдаленногоПодключенияПоУмолчанию() Экспорт	 
	
	Возврат "";  // не задано
	
КонецФункции

// Основной шаблон удаленного доступа
//
// Параметры:
//  РабочееМесто - СправочникСсылка.РабочиеМеста
// 
// Возвращаемое значение:
//   СправочникСсылка.ШаблоныУдаленногоДоступа
//
Функция ОсновнойШаблонУдаленногоДоступа(РабочееМесто) Экспорт 	 
	Возврат РабочееМесто.ОсновнойШаблонУдаленногоДоступа;	 
КонецФункции

// Шаблон подключения рабочий каталог
//
// Параметры:
//  ШаблонПодключения	 - СправочникСсылка.ШаблоныУдаленногоДоступа 
// 
// Возвращаемое значение:
//  Строка 
//
Функция ШаблонПодключенияРабочийКаталог(ШаблонПодключения) Экспорт 	 
	Возврат ШаблонПодключения.РабочийКаталог;
КонецФункции

// Текст командной строки
//
// Параметры:
//  РабочееМесто - СправочникСсылка.РабочиеМеста
//  ШаблонПодключения - СправочникСсылка.ШаблоныУдаленногоДоступа 
// 
// Возвращаемое значение:
//  Строка 
//
Функция ПолучитьТекстКоманднойСтроки(РабочееМесто, ШаблонПодключения) Экспорт 
	
	СтрокаКоманды = ШаблонПодключения.ШаблонКоманднойСтроки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаДополнительныеРеквизиты.Ссылка КАК Объект,
	|	РабочиеМестаДополнительныеРеквизиты.Свойство КАК Свойство,
	|	РабочиеМестаДополнительныеРеквизиты.Значение КАК Значение
	|ИЗ
	|	Справочник.РабочиеМеста.ДополнительныеРеквизиты КАК РабочиеМестаДополнительныеРеквизиты
	|ГДЕ
	|	РабочиеМестаДополнительныеРеквизиты.Ссылка = &Объект"; 
	
	Запрос.УстановитьПараметр("Объект", РабочееМесто);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Свойство = "%"+ВыборкаДетальныеЗаписи.Свойство+"%";
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды,Свойство, ВыборкаДетальныеЗаписи.Значение); 	
		
	КонецЦикла;
	
	Возврат СтрокаКоманды;	 
	
КонецФункции 

#КонецОбласти
