
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		//Новый
		
		Объект.Актуальность = Истина;
		
		ЗаполнитьТипыМодулейПоУмолчанию();
		
	КонецЕсли;
	
	УстановитьКоличестваВЗаголовки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Обновить_СписокОбъектовМетаданных");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИзмененияПоУмолчаниюПриИзменении(Элемент)
	
	УстановитьКоличестваВЗаголовки();

КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаМетаданныхПриИзменении(Элемент)
	
	ЗаполнитьТипыМодулейПоУмолчанию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьКоличестваВЗаголовки()

	Элементы.ГруппаИзмененияПоУмолчанию.Заголовок = СтрШаблон(НСтр("ru = 'Изменения по умолчанию (%1)'"), Объект.ИзмененияПоУмолчанию.Количество()); 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипыМодулейПоУмолчанию() 
	
	Объект.ИзмененияПоУмолчанию.Очистить();
	
	Для каждого стр Из Объект.ТипОбъектаМетаданных.ТипыМодулейПоУмолчанию Цикл
		
		НовСтрИзм = Объект.ИзмененияПоУмолчанию.Добавить();
		НовСтрИзм.ТипМодуля = стр.ТипМодуля;
		
	КонецЦикла;
	
	УстановитьКоличестваВЗаголовки();
	
КонецПроцедуры

#КонецОбласти

