
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПараметрыНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыНаСервере()

	EmailEvernote = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"Evernote", "EmailEvernote","");
	
	ХэшТегСтандартный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"Evernote", "ХэшТегСтандартный","");

	БлокнотСтандартный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"Evernote", "БлокнотСтандартный","");
		
		
КонецПроцедуры // ЗаполнитьПараметрыНаСервере()

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	МассивСтруктур = Новый Массив;

	МассивСтруктур.Добавить(ОписаниеНастройки(
	    "Evernote",
	    "EmailEvernote",
	    EmailEvernote));
		
	МассивСтруктур.Добавить(ОписаниеНастройки(
	    "Evernote",
	    "ХэшТегСтандартный",     	
	    ХэшТегСтандартный));
		
	МассивСтруктур.Добавить(ОписаниеНастройки(
	    "Evernote",
	    "БлокнотСтандартный",     	
	    БлокнотСтандартный));
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранитьМассив(МассивСтруктур, Истина);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеНастройки(Объект, Настойка, Значение)
	
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", Объект);
	Элемент.Вставить("Настройка", Настойка);
	Элемент.Вставить("Значение", Значение);
	
	Возврат Элемент;
	
КонецФункции
